{"title":"Cute fashion illustrations","description":"","link":"https://www.reddit.com/gallery/121qwwy","created":"2023-03-25","tags":["prompteng","reddit","promptdesign"],"meta":{"num_comments":1}}
{"title":"Prompt Engineering Job Board","description":"Hi everyone, I'm the founder of Prompt People, for which I believe is the first prompt engineering job board.  \n\n\nIf you have prompt engineering jobs, you can post them for free while we are in beta, or you can sign up for weekly job alerts if you're looking for a job.  \n\n\nCheck it out here - hope you find it useful:\n\n[https://promptppl.com/](https://promptppl.com/)","link":"https://www.reddit.com/r/PromptDesign/comments/121f2l0/prompt_engineering_job_board/","created":"2023-03-25","tags":["prompteng","reddit","promptdesign"],"meta":{"num_comments":6}}
{"title":"Looking for other informative subreddits, websites, blogs, YouTube-channels, Twitter-accounts, wiki's and newsletters to RSS Feed on the topics discussed here on r/PromptDesign","description":"Hi, In my attempts to digest as much valuable information about topics posted and being discussed here at r/PromptDesign, I am reorganizing my RSS Feed to create a daily routine of consuming info (overload.) The time is now. Especially with how fast AI developments follow up on each other. \n\nFeedly has been my RSS Feed app since december 2014 and I cannot live without it anymore. (Although I am always looking out for good alternatives.)\n\nCurrently I am subscribed to the following subreddits: r/PromptDesign/, r/aipromptprogramming, r/MachineLearning/, r/midjourney/, r/OpenAI, r/ChatGPT/, r/Wolfram/\n\nFurthermore I have a subscription to Medium, which has a fair amount of great articles posted about the subject of AI on a daily basis. And I subscribed to YouTube-channels from companies behind the AI-projects (for which I make frequent use of [https://glasp.co/youtube-summary](https://glasp.co/youtube-summary) to create and read summaries made by ChatGPT.)\n\nI am looking for more other informative subreddits, websites, blogs, YouTube-channels, Twitter-accounts, wiki's and newsletters to RSS Feed on the topics discussed here, so if you have any good suggestions, I welcome and appreciate any comment to expand the ever-growing list of sources for more AI-news to distil and digest.","link":"https://www.reddit.com/r/PromptDesign/comments/121jxbc/looking_for_other_informative_subreddits_websites/","created":"2023-03-25","tags":["prompteng","reddit","promptdesign"],"meta":{"num_comments":2}}
{"title":"Spoiler: so much better than #BLIP2!","description":"In the last OpenAI demo, they unveiled the impressive multimodal capabilities of GPT-4, generating text descriptions from images with ease. Give PromptPerfect a spin to experience this feature firsthand!\n\nhttps://i.redd.it/8dwj26karopa1.gif","link":"https://www.reddit.com/r/PromptDesign/comments/120jnwc/spoiler_so_much_better_than_blip2/","created":"2023-03-24","tags":["prompteng","reddit","promptdesign"],"meta":{"num_comments":0}}
{"title":"green fairy","description":"","link":"https://www.reddit.com/gallery/120ao7w","created":"2023-03-24","tags":["prompteng","reddit","promptdesign"],"meta":{"num_comments":0}}
