{"title":"Finding a good Tiny Yolo to train in Python","description":"I am trying to train some model that will at the end of the day run in the browser, which can be done with tensorflow js. So the model, for an object detection task, has to be small.\n\nI am trying then to train and then convert some Tiny Yolo. \n\nThere are several projects on GH most are unreliable  or unmaintained or just break and you need to patch the files and so on.\n\n* The only project I found is this one [that implements Yolov7](https://github.com/WongKinYiu/yolov7)\n\nI tried others but they break or are not very complete.\n\nThere is also Ultralytics but I am not so sure about their stuff at the moment (should research more).\n\nDo you know any other projects that implements Yolo and could be used to train the tiny version ?","link":"https://www.reddit.com/r/deeplearning/comments/114jlsv/finding_a_good_tiny_yolo_to_train_in_python/","created":"2023-02-17","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
{"title":"PC reboot while training and what is the best hardware options for small set training (1 GPU)","description":"1. Does anyone who have some problem system reboot while training? \n\nthis is normal situation while training, \n\nI think this is not that hard for pc, \n\nbut sometime (2\\~3 times a week) shut down and reboot wile training process.\n\nhttps://preview.redd.it/bai09d87dpia1.png?width=739&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=59b195a129ba615f9b492060ce316d42cceed477\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n2. and also, I am a bit curious about the system,\n\nI normally train with small media (sound/visual) training.\n\n  \n\nIf you can choose only 1-2 GPU pc, \n\nwhat kind of hardware will you use? \n\n&amp;#x200B;\n\nhttps://preview.redd.it/4aqz2a71dpia1.png?width=707&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=c8cb725f532b16fc9b889d3a87949227beded63f","link":"https://www.reddit.com/r/deeplearning/comments/114dsrq/pc_reboot_while_training_and_what_is_the_best/","created":"2023-02-17","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":2}}
{"title":"How likely is ChatGPT to be weaponized as an information pollution tool? What are the possible implementation paths? How to prevent possible attacks?","description":"","link":"https://www.reddit.com/r/deeplearning/comments/1148t20/how_likely_is_chatgpt_to_be_weaponized_as_an/","created":"2023-02-17","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":8}}
{"title":"[Tutorial] Basics of TensorFlow GradientTape","description":"Basics of TensorFlow GradientTape\n\n[https://debuggercafe.com/basics-of-tensorflow-gradienttape/](https://debuggercafe.com/basics-of-tensorflow-gradienttape/)\n\nhttps://preview.redd.it/ftkd0owv6nia1.png?width=1000&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=3d85e48dfbd136f78fd34d9fa71a7792af720a89","link":"https://www.reddit.com/r/deeplearning/comments/1145npr/tutorial_basics_of_tensorflow_gradienttape/","created":"2023-02-17","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
{"title":"My Neural Net is stuck, I've run out of ideas","description":"Hi,\n\nI have been trying to draw a bounding box around objects using a ML/NN approach.\n\nThe project uses Transfer Learning. This is a pretrained [VGG16](https://towardsdatascience.com/step-by-step-vgg16-implementation-in-keras-for-beginners-a833c686ae6c) with a Regression Head. I selected this one because it seems a good architecture and was easy to implemented it in Javascript, where you wont find it.\n\nThe first 16 layers use pretrained weights taken from the [Keras creator GH page](https://github.com/fchollet/deep-learning-models).\n\nI have trained the out putlayers it with [Caltech101 datasets](https://data.caltech.edu/records/mzrjq-6wc02) airplanes (800), faces (400), stop signs (60) etc.\n\nIt predicts reasonably well with images of the same dataset not seen before by the model.\n\nYet for any new image (any picture with a face that I have in the laptop) the predictions are terrible.\n\nAfter running out of ideas I am reaching out for some help. I have tried:\n\n* changed number of layers,\n* changed number of units,\n* train some VGG16 inner layers","link":"https://www.reddit.com/r/deeplearning/comments/113o5up/my_neural_net_is_stuck_ive_run_out_of_ideas/","created":"2023-02-16","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":21}}
{"title":"Candidates for lightweight object detector NNs ?","description":"I am trying to create a custom-object detector, for barcodes. Tried a few things already that didn't work, so I'm going ahead and reading a bit more.\n\nAfter following tutorials, reading some paper intros etc, I have a somewhat good idea that Yolo, SSD, Retina, and others are probably fine models for the task.\n\nYet I plan this Neural Net to be send from the server to the client. This is important because the net should not be more than 100MB large, which is the max can tolerate for now, until things are less complex to understand.\n\nI have seen some of these models have mobile versions, or lite versions, but I wonder if there are a few \"go-tos\" because implementing the parsing of the output will take time, so I'd prefer to start with a somewhat solid model.\n\n At the moment, I am planning to do it with Python Keras, such that it can be saved as a Layers Model.","link":"https://www.reddit.com/r/deeplearning/comments/113u8u8/candidates_for_lightweight_object_detector_nns/","created":"2023-02-16","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":6}}
{"title":"We made a map showing what each US state \"loves\" with our text-to-location machine learning models","description":"For Valentine's, we wanted to see what people love. We created a map of what word comes after \"love \\_\\_\\_\" for people posting to social media.\n\nFor example, you can see that Illinois really loves Chipotle 😂🌯  \n\n\nhttps://preview.redd.it/iuht8a2s7gia1.jpg?width=797&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=6b00538aa4322b4c394a1a79d4d0ebbe284ecfda\n\nThe full, interactive map is here: [https://1712n.github.io/yachay-public/maps/14feb/](https://1712n.github.io/yachay-public/maps/14feb/)","link":"https://www.reddit.com/r/deeplearning/comments/113dpbg/we_made_a_map_showing_what_each_us_state_loves/","created":"2023-02-16","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":2}}
{"title":"Question about \"training model\" in general","description":"I do not quite understand what a model for training is as a concept. For example, in  SciKit we make a model by instantiating a class containing a learning algorithm. For example like that:\n\n    model = KNeighborsClassifier()\n\nThen we \"try on\" the model on the data.\n\n    model.fit(some_data)\n\nafter fit has worked - what is happening with that model? \n\nIs the model \"saved\" somehow, somewhere, along with what it has learned to be reused later?\n\nHow it changes as a result of what it \"learned\" by \"training\"?\n\nWhat is generally meant by \"training\" a model if it is just an instance of a class?\n\nThanks in advance","link":"https://www.reddit.com/r/deeplearning/comments/1136qn3/question_about_training_model_in_general/","created":"2023-02-15","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":1}}
{"title":"Lecture 11 CNN Architectures II by Justin Johnson - help finding the video lecture","description":"Can someone please be so kind to help me find the Lecture11 [CNN Architectures II](https://web.eecs.umich.edu/~justincj/teaching/eecs498/WI2022/schedule.html) video explanation (share a link ) from the EECS 498.008 / 598.008 Deep Learning for Computer Vision by Justin Johnson?\n\nThank you","link":"https://www.reddit.com/r/deeplearning/comments/1138r5z/lecture_11_cnn_architectures_ii_by_justin_johnson/","created":"2023-02-15","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
{"title":"Hello. I am looking for a way to improve audio quality of older videos - perhaps audio super resolution - or any other ways","description":"Hello everyone. I am a software engineering assistant professor at a private university. I have got lots of older lecture videos on my channel.\n\nI am using NVIDIA broadcast to remove noise and it works very well.\n\nHowever, I want to improve audio quality as well.\n\nAfter doing a lot of research I found that  **audio super-resolution**  is the way to go\n\nThe only github repo I have found so far not working\n\nAny help is appreciated\n\nHow can I improve speech quality?\n\nHere my example lecture video (noise removed already - reuploaded - but sound is not good)\n\nC# Programming For Beginners - Lecture 2: Coding our First Application in .NET Core Console\n\n[https://youtu.be/XLsrsCCdSnU](https://youtu.be/XLsrsCCdSnU)","link":"https://www.reddit.com/r/deeplearning/comments/1138r22/hello_i_am_looking_for_a_way_to_improve_audio/","created":"2023-02-15","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
{"title":"Participants wanted for my dissertation survey!!","description":" If anyone has 20-30 minutes to click the link below and complete a survey for my dissertation it would be really appreciated:))\n\nWe are looking for participants aged 18 or over. You will be asked to complete a questionnaire investigating the impacts of life experiences and individual differences on the likelihood of engaging in antisocial behaviour. This questionnaire should take no longer than 20-30 minutes to complete. For participation, you will be given the opportunity to win one of two £75 Flexi eGift Card - which can be spent in many places including Amazon, and many supermarkets. If you have any queries/questions, please feel free to contact the researchers via the below emails.\n\nShanté Browne – [ed18s2b@leeds.ac.uk](mailto:ed18s2b@leeds.ac.uk)  \nCharlotte Ball – [ps20cb@leeds.ac.uk](mailto:ps20cb@leeds.ac.uk)  \nOlivia Bloom- [ps20ob@leeds.ac.uk](mailto:ps20ob@leeds.ac.uk)  \nDaisy Elliott - [ps20dje@leeds.ac.uk](mailto:ps20dje@leeds.ac.uk)  \nHolly Sherlock - [ps19hms@leeds.ac.uk](mailto:ps19hms@leeds.ac.uk)\n\nAccess link: [https://leedspsychology.eu.qualtrics.com/jfe/form/SV\\_eWYnELpCVEs0zUq](https://leedspsychology.eu.qualtrics.com/jfe/form/SV_eWYnELpCVEs0zUq)","link":"https://www.reddit.com/r/deeplearning/comments/1138085/participants_wanted_for_my_dissertation_survey/","created":"2023-02-15","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
{"title":"Finding a Data Labeling Methodology for Companies","description":"Hey everyone, I recently needed to implement a data labeling workflow in my company and found a methodology that worked well for us. We took a few steps to begin the data labeling process as follows:\n\nWe defined the ontology of our labels by preparing a handbook to describe our use case and requirements and determined the labels we needed.\n\nThen, we created an instruction, prepared the required infrastructure, set up the labeling tools, and started labeling the data using provided data labeling tools.\n\nFinally, we will assess the quality of the labels using data assessment methods, most probably with active learning.\n\nIf you're interested in learning more about this methodology, you can check out this post on [data labeling](https://galliot.us/blog/data-labeling-approaches-challenges-tools/). It also goes into more detail about data labeling approaches, challenges, and solutions and offers some available data labeling tools. I hope this helps anyone looking to implement a data labeling workflow in their own company!","link":"https://www.reddit.com/r/deeplearning/comments/1130h37/finding_a_data_labeling_methodology_for_companies/","created":"2023-02-15","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
{"title":"LangChain X Weaviate - New Weaviate Podcast!","description":"Hey everyone, I am super excited to share our newest Weaviate Podcast featuring Harrison Chase, the creator of LangChain and Weaviate CEO / Co-Founder Bob van Luijt! LangChain is one of the most exciting emerging tools in the space of working with LLMs. LangChain provides a set of abstractions around flowing Language Models Calls to one another and connecting them to external tool use. As Bob describes, there was a lot of interest in hooking these LLMs up with Google Search to connect it to knowledge and reduce hallucination -- so why not hook it up to your own data enabled with Semantic Search through Weaviate!! Harrison and Bob are both incredibly knowledgeable about this emerging area of Deep Learning technology and I really enjoyed this conversation!\n\nCheck out the podcast here!  \n[https://youtu.be/lhby7Ql7hbk](https://youtu.be/lhby7Ql7hbk)","link":"https://www.reddit.com/r/deeplearning/comments/11302xl/langchain_x_weaviate_new_weaviate_podcast/","created":"2023-02-15","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
