{"title":"Thursday Daily Thread: Python Careers, Courses, and Furthering Education!","description":"Discussion of using Python in a professional environment, getting jobs in Python as well as ask questions about courses to further your python education!\n\n**This thread is not for recruitment, please see** r/PythonJobs **or the thread in the sidebar for that.**","link":"https://www.reddit.com/r/Python/comments/11mcnzg/thursday_daily_thread_python_careers_courses_and/","created":"2023-03-09","tags":["reddit","python"],"meta":{"num_comments":2}}
{"title":"Pyfuck - A python to brainfuck translater","description":"https://github.com/cmspeedrunner/Pyfuck\nWhat do you guys think","link":"https://www.reddit.com/r/Python/comments/11nci0v/pyfuck_a_python_to_brainfuck_translater/","created":"2023-03-10","tags":["reddit","python"],"meta":{"num_comments":11}}
{"title":"Python remote debugging on windows machines is now made easy!","description":"Hi guys, I couldn't find latterly a single solution for pycharm to remote debug my python code on other windows machines, and I wanted to do that to do my AI training stuff on my friend's pc because mine is no strong enough, I ended up making my own python library that exactly does that!  \n\n\nWith only two lines of code, you can debug an python script on a windows machine easily, and a copy of all the stdout, stderr and stdin calls will be forwarded to you and you will feel like you are working on your own machine.  \n\n\nI wanted to share it here if anyone needs such capability, I also uploaded it to PyPl so pip will be able to install it, here's the project's github page: [https://github.com/AhmedAhmedEG/PyWinRD](https://github.com/AhmedAhmedEG/PyWinRD)","link":"https://www.reddit.com/r/Python/comments/11nod6t/python_remote_debugging_on_windows_machines_is/","created":"2023-03-10","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"Is there some hidden genius in the handle-exception package that I'm missing?","description":"I ran across [the handle-exception package](https://github.com/dillibk777/handle_exception) whose supposed benefit is:\n\n&gt; you can handle exceptions in a centralized way, instead of having to write try-except blocks in multiple places.\n\nBut you can *already* handle exceptions in a centralized way, correct?","link":"https://www.reddit.com/r/Python/comments/11niekp/is_there_some_hidden_genius_in_the/","created":"2023-03-10","tags":["reddit","python"],"meta":{"num_comments":4}}
{"title":"heyoka.py 0.21 - ODE integration wth LLVM, now supporting multiprecision","description":"Hello there!\n\nI posted here before about [heyoka.py](https://github.com/bluescarni/heyoka.py), our high-performance ODE integrator based on LLVM.\n\nWe recently released a new version supporting arbitrary-precision computations. This support is built on top of a multiprecision class exposed from C++ to Python, with full NumPy support. That is, this new datatype can be used as a native ``dtype`` in NumPy arrays. I believe this might be a first in the scientific Python ecosystem.\n\nHere is a tutorial introducing the new feature:\n\nhttps://bluescarni.github.io/heyoka.py/notebooks/arbitrary_precision.html\n\nThanks to the properties of the specific numerical integration method employed by heyoka.py (Taylor's method), multiprecision numerical integrations can be orders of magnitude faster than DifferentialEquations.jl, as shown in the benchmarks section here:\n\nhttps://bluescarni.github.io/heyoka/benchmarks.html#extended-and-arbitrary-precision\n\nThe latest version of heyoka.py also introduces a prebuilt ``pip`` wheel for Linux x86-64 (whereas previous versions had only ``conda`` packages):\n\n```\n$ pip install heyoka\n```\n\nPlease let me know if you have comments, questions, criticism, etc.!","link":"https://www.reddit.com/r/Python/comments/11nj2g0/heyokapy_021_ode_integration_wth_llvm_now/","created":"2023-03-10","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"Released python module for imports modules in parent directories.","description":"I had a difficulties when importing modules in parent directory. syspend module is one of the solution.\n\n[https://pypi.org/project/syspend/](https://pypi.org/project/syspend/)\n\nIn the case, [sample.py](https://sample.py) want to import mypackage, but it locates in parent directory. syspend module searches SYSPEND\\_ROOT recursively, and calls sys.path.append. Doing so, python interpreter can find mypackage module from [sample.py](https://sample.py).\n\n&amp;#x200B;\n\n* project\n   * mypackage.py\n   * samples\n      * sample.py\n   * SYSPEND\\_ROOT &lt;------- make this file by your self. empty file is ok.\n\n&amp;#x200B;\n\nIn [sample.py](https://sample.py), you just write like this:\n\n    import syspend\n    import mypackage\n    \n    if __name__ == '__main__':\n        mypackage.hello()","link":"https://www.reddit.com/r/Python/comments/11npl20/released_python_module_for_imports_modules_in/","created":"2023-03-10","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"How to use python to upload data into SQL Server Database","description":"I’ve been able to pull data out of the database. But I’m having issues with appending the table. \n\nI keep getting an error\n\nThe first code I tried was like this \n\nFor row in df.itertuples():\n\n       Cursor.execute ( ‘’’\n                         Insert into country2 (country, city) values (?,?)\n‘’’,\nRow.Country,\nRow.City,\n)\n\nConn.commit()\n\n\n\nWhen I did this , I think it may have worked but I wasn’t able to read the data from the table. I would read the data from other tables but it just kept executing for ages, so the code broke the table or something -  I haven’t come across this issue before so I’m not sure \n\nI left it to execute for like 30 mins and I couldn’t get the table to open in SQL. I tried deleting the table and nothing happened.\n\nI created a new table in another test db with the same name and I tried.\n\nThen I tried df.to_sql(Country2, conn, if_exists = ‘append’, index=False)\n\nAnd got an error that pandas only supports SQLAlchemy engineer/connection or database string uri or SQLIte3 dbapi2 connection \n\n\nThanks in advance","link":"https://www.reddit.com/r/Python/comments/11nl8vu/how_to_use_python_to_upload_data_into_sql_server/","created":"2023-03-10","tags":["reddit","python"],"meta":{"num_comments":1}}
{"title":"Can you break my Flask authentication system?","description":" I recently created a Flask authentication system that focuses on security. As a challenge, I invite you to try and find vulnerabilities in my system.\n\nThe repository contains a comprehensive README.md that explains the system's design and implementation. I believe that it can be a great exercise for developers who are interested in security and want to test their skills.\n\nYou can access the repository at [**https://github.com/IdanHajbeko/Secure-Flask-Auth**](https://github.com/IdanHajbeko/Secure-Flask-Auth).\n\nPlease feel free to fork the repository, test the system, and share your feedback. I am open to any suggestions, comments, or contributions that can help me improve this project.\n\nLet's see if you can break my Flask authentication system!","link":"https://www.reddit.com/r/Python/comments/11n082u/can_you_break_my_flask_authentication_system/","created":"2023-03-09","tags":["reddit","python"],"meta":{"num_comments":19}}
{"title":"I created Flask-Squeeze, it minifies and compresses responses so that your data transfers are as small as possible!","description":"Hi guys! I just wanted to share the Flask extension [Flask-Squeeze](https://github.com/mkrd/Flask-Squeeze) with you. It will minify javascript and css, and compress responses with brotli, deflate, or gzip depending on the request, with almost zero configuration.\n\nI know there are other extensions aswell, but as far as I know, none of them have a complete feature set of minification AND compression.\n\nLet me know what you think, if there are more things that could be added!","link":"https://www.reddit.com/r/Python/comments/11ms54x/i_created_flasksqueeze_it_minifies_and_compresses/","created":"2023-03-09","tags":["reddit","python"],"meta":{"num_comments":6}}
{"title":"How to learn Python and where to start for beginners?","description":"","link":"https://www.reddit.com/r/Python/comments/11ne8fh/how_to_learn_python_and_where_to_start_for/","created":"2023-03-10","tags":["reddit","python"],"meta":{"num_comments":9}}
{"title":"qStore - Youtube as file storage","description":"Okay, first and foremost, I want to say that I got inspired by GitHub: DvorakDwarf's [Infinite-Storage-Glitch](https://github.com/DvorakDwarf/Infinite-Storage-Glitch). So I decided to make my own proof of concept version in python3 instead of rust. I also wanted to use steganography but youtube's compression killed any and all hope I had. I have tried LSB, RGB, DCT, and Spacial Domain steganography and ALL work normally on their own...but all have failed when I upload the video to youtube and then download it.\n\nSo I decided to be a little clever and use QR codes. I modify one of many frames in the video with a QR code, and then re make the video and then it's ready to upload. One may wonder, \"well if it's in the QR code then the data can be easily obtained.\" Yes and No. Yes in terms of it's indeed a normal QR code and works how you'd expect it to work, and no in terms of the file data is encrypted using GCMlib (AES-GCM. KDF Argon2id) before being turned into the QR code. One can use any encryption method they want but I use GCMlib. (use at your own risk obviously).\n\n&amp;#x200B;\n\n[qStore](https://github.com/therealOri/qStore) also has its own database to keep track of what videos are what and the keys used to encrypt the file that is in the QR code. This database can also be locked and unlocked. (Like bitwarden). Just give it a key that was generated and then it's up to you on how you store it and keep it safe. (You can also use your own way of encrypting files if you wish, my methods are use at your own risk obviously.) You can add, remove, and view entries/records as well.\n\nThere's nothing really more to say about it as this project is still being worked on and I still really hope that eventually I can use actual steganography to embed a file into the videos. But for now, just QR codes.\n\nIf you or anyone you know would like to help out or even try it out/use my project then the link is below. &lt;3\n\nLink to github repo: [https://github.com/therealOri/qStore](https://github.com/therealOri/qStore)  \n\n\n  \n\n\n[qStore main menu](https://preview.redd.it/gqi2fnz01rma1.png?width=851&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=aa637f2bbf49ea9a040cd6ea0be48a808ed6028d)","link":"https://www.reddit.com/r/Python/comments/11my1tz/qstore_youtube_as_file_storage/","created":"2023-03-09","tags":["reddit","python"],"meta":{"num_comments":3}}
{"title":"Help with ABC Formula Python code","description":"Pls send me the whole script/ code \n\nMuch appreciated!","link":"https://www.reddit.com/r/Python/comments/11nlj7q/help_with_abc_formula_python_code/","created":"2023-03-10","tags":["reddit","python"],"meta":{"num_comments":3}}
{"title":"I made a Finance Database with over 300.000 tickers to make Investment Decisions easier","description":"It has been well over 2 years since I first introduced the database to this community, see [here](https://github.com/JerBouma/FinanceDatabase), and since then a lot changed so I felt like it is worth sharing about my package yet again and honestly, also to ask for a little bit of help.\n\nSo, within the investment universe there exists tens of thousands of companies (and even more when you include all exchanges). Identifying all of them and understanding in detail where they fit in the world is tough up to a point that it either requires you to pay a hefty fee to obtain this type of categorisation or do a massive amount of manual research. I found it a bit strange that this information was not publicly available while it is quite crucial for investment research. Therefore I got to work.\n\n**Insert the** [**FinanceDatabase**](https://github.com/JerBouma/FinanceDatabase)**.** This is a database of over 300.000 symbols (155k+ companies, 36k+ ETFs, 57k+ Funds, 3k+ Cryptocurrencies and more) that is fully categorised per country, industry, sector, category and more. It includes a package, written in Python and installable with \\`pip install financedatabase\\`, that gives access to the data with ease. You can obtain the entire dataset per asset class, search through it and filter based on specific options. Have a look at [this Notebook](https://github.com/JerBouma/FinanceDatabase/blob/main/examples.ipynb) to have an idea what it is offering.\n\nA simple example of what it does in the following:\n\n    import financedatabase as fd\n    \n    # Initialize the Equities database\n    equities = fd.Equities()\n    \n    # Obtain all data available excluding international exchanges\n    equities.select()\n\nWhich returns the following DataFrame: https://preview.redd.it/5gmiej7pbjma1.png?width=1516&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=faa84ca0e91107530f9845a5313ff79adc54ba6a\n\nBy default it hides non-US exchanges (since the ticker symbols work for most other programs) but that can be turned off with **equities.select(exclude\\_exchanges=False)** which returns 155.000 rows.\n\nThe database explicitly does not store up to date fundamental data. It tries to be as timeless as possible so that it doesn't become outdated fast. Because there are a variety of other ways, like FinancialModelingPrep, yFinance etc, to get this data there is no use in including this in the database.\n\nI've improved this database not only by increasing the amount of symbols (from 180k to 300k) but also:\n\n* Approximated the The Global Industry Classification Standard (GICS®), a standard used for sectors and industries everywhere. Note that this was approximated and therefore no actual data is collected. Furthermore, not all categories are included.\n* Updated and removed tickers that either no longer exist or had outdated information.\n* Made the package itself object orientated making data collecting and searching much more efficient and logical. (shoutout to [Colin Delahunty](https://github.com/colin99d) for the help here too)\n* The database initially featured thousands of JSON files. At the time it made sense also given my rather novice background in programming. However, a much more efficient (and manageable way) is to work with CSV files. So instead, one CSV file per asset class.\n* Due to using CSV files, it becomes **really** easy to update accordingly.\n* To make loading data itself still quick, it automatically compresses the data so that loading in data is not slowed down by using a format that is more easy to update.\n* Updated the README, Contributing Guidelines and overal documentation.\n\nSo being an open source project and trying to maintain such a database is tough to do alone. While I strongly believe the database can stay relevant for a long period due to the fact that the majority of companies do not suddenly stop existing, some maintenance is needed. Therefore, with this post I would like to not only invite you to explore the database but also to see if you can improve it along the way. Please visit the [CONTRIBUTING GUIDELINES](https://github.com/JerBouma/FinanceDatabase/blob/main/CONTRIBUTING.md) that explains in detail how you can contribute. Just pointing out wrong or missing information is already very beneficial!\n\nHope this database is still just as useful as it was two years ago!","link":"https://www.reddit.com/r/Python/comments/11lyyzb/i_made_a_finance_database_with_over_300000/","created":"2023-03-08","tags":["reddit","python"],"meta":{"num_comments":31}}
{"title":"Hosting --- simple python sit, PySimpleGUIWeb","description":"Can anyone recommend give ideas on where I can get some simple cheap hosting a single website built inPySimpleGUIWeb and SQLlite3 DB---  I tried all the usual suspects Bluehost said they don't support SQL Lite and amazingly Hostinger posting articles tell me they don't support Python ?","link":"https://www.reddit.com/r/Python/comments/11n85lm/hosting_simple_python_sit_pysimpleguiweb/","created":"2023-03-10","tags":["reddit","python"],"meta":{"num_comments":4}}
{"title":"Distributed Tracing guide","description":"If you're looking to learn more about distributed tracing, check out this [guide.](https://gethelios.dev/distributed-tracing/)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gqq8mi5jaqma1.png?width=2200&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=051e9e0c5ef03bf5bd28829652e6091a7981491e","link":"https://www.reddit.com/r/Python/comments/11mufw4/distributed_tracing_guide/","created":"2023-03-09","tags":["reddit","python"],"meta":{"num_comments":2}}
{"title":"How can I deploy a full Tkinter app with database included?","description":"How to deploy a full desktop app with database ready to install on any pc?","link":"https://www.reddit.com/r/Python/comments/11mfk3l/how_can_i_deploy_a_full_tkinter_app_with_database/","created":"2023-03-09","tags":["reddit","python"],"meta":{"num_comments":23}}
{"title":"Training Transformer Networks in Scikit-Learn?!","description":"Have you ever wanted to use handy scikit-learn functionalities with your neural networks, but couldn’t because TensorFlow models are not compatible with the scikit-learn API?\n\nI’m excited to introduce one-line wrappers for TensorFlow/Keras models that enable you to use TensorFlow models within scikit-learn workflows with features like Pipeline, GridSearch, and more.\n\n&amp;#x200B;\n\n[Swap in one line of code to use keras\\/TF models with scikit-learn.](https://preview.redd.it/g5ssnz1f6rma1.png?width=960&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=206be211c08985c0693929c445f3c274234bd58d)\n\nTransformers are extremely popular for modeling text nowadays with GPT3, ChatGPT, Bard, PaLM, FLAN excelling for conversational AI and other Transformers like T5 &amp; BERT excelling for text classification. Scikit-learn offers a broadly useful suite of features for classifier models, but these are hard to use with Transformers. However not if you use these wrappers we developed, which only require changing one line of code to make your existing Tensorflow/Keras model compatible with scikit-learn’s rich ecosystem!\n\nAll you have to do is swap `keras.Model` → `KerasWrapperModel`, or `keras.Sequential` → `KerasSequentialWrapper`. The wrapper objects have all the same methods as their keras counterparts, plus you can use them with tons of awesome scikit-learn methods.\n\nYou can find a demo jupyter notebook and read more about the wrappers here: [https://cleanlab.ai/blog/transformer-sklearn/](https://cleanlab.ai/blog/transformer-sklearn/)","link":"https://www.reddit.com/r/Python/comments/11mzd3p/training_transformer_networks_in_scikitlearn/","created":"2023-03-09","tags":["reddit","python"],"meta":{"num_comments":0}}
