{"title":"Wednesday Daily Thread: Beginner questions","description":"New to Python and have questions? Use this thread to ask anything about Python, there are no bad questions!\n\nThis thread may be fairly low volume in replies, if you don't receive a response we recommend looking at r/LearnPython or joining the Python Discord server at [https://discord.gg/python](https://discord.gg/python) where you stand a better chance of receiving a response.","link":"https://www.reddit.com/r/Python/comments/11xzshx/wednesday_daily_thread_beginner_questions/","created":"2023-03-22","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"PyVibe: Generate styled HTML pages from Python","description":"&amp;#x200B;\n\nhttps://preview.redd.it/s9zir6gfh6pa1.png?width=2560&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=f3e2bed1ee99d958272d2b579a56d2c5283dee6d\n\nI've been using Tailwind CSS, in particular [Flowbite](https://flowbite.com/), for a number of different Python projects that I was working on and through that process, I realized that I end up either repeating or copying functions that generate UI components.\n\nThat led me to create this Python library to make it easier to use re-use UI components for my Flask applications: [https://www.pyvibe.com/](https://www.pyvibe.com/)\n\n[https://github.com/pycob/pyvibe](https://github.com/pycob/pyvibe)\n\nI wrote it in such a way that it generates an HTML string, so it's usable in Flask, as a static HTML file, or even in Pyodide (which is Python running in the browser via WebAssembly). \n\nLet me know what you think!","link":"https://www.reddit.com/r/Python/comments/11xzbyp/pyvibe_generate_styled_html_pages_from_python/","created":"2023-03-21","tags":["python","reddit"],"meta":{"num_comments":6}}
{"title":"Open source tool Pair, An iterative, stateful chat-like interface for programmers to pair programming with GPT-4","description":"we have released an Open source tool Pair ([https://github.com/jiggy-ai/pair](https://github.com/jiggy-ai/pair)), An iterative, stateful chat-like interface for programmers to pair programming with GPT-4, might be useful to some of you. Github Copilot is a great tool for leveraging GPTs while coding, but it is too “open loop” for more complex tasks that require Q&amp;A, feedback to guide it in a particular direction, iteration on code execution errors, etc. There is a large class of tasks that are better accomplished in an iterative, stateful chat-like interface, thus we built Pair. You are welcome to use it and also to contribute to it.","link":"https://www.reddit.com/r/Python/comments/11y8w3t/open_source_tool_pair_an_iterative_stateful/","created":"2023-03-22","tags":["python","reddit"],"meta":{"num_comments":1}}
{"title":"How do you decide to use a Python Package","description":"Hey guys,\n\nso I was wondering how do you decide on using a Python package? Of course there is the obvious answer that you chose a package based on functionality that you need (Pytorch for neural networks, requests for well... requests, etc.).\n\nThere are though in my eyes other factors that are important, especially in professional development and that is both safety of the package and also quality of the package. So my question is how do you judge those two parameters? Do you fly over the source code? Do you look at test coverage? Do you check for documentation before installing or are there any resources that provide insights into different packages? \n\nThanks in advance for your answers!","link":"https://www.reddit.com/r/Python/comments/11xfo9c/how_do_you_decide_to_use_a_python_package/","created":"2023-03-21","tags":["python","reddit"],"meta":{"num_comments":53}}
{"title":"Practice 1,000+ Free Python Challenges with AI","description":"Hi friends! I built the Codehub AI app that helps people to learn Python with an AI. The app offers 1,000+ coding challenges and AI features that explain code errors, offer personalized practice and guide users through challenges step by step. Give it a try and share your thoughts! \n\nDownload from here - [https://apps.apple.com/us/app/coding-python-java-code/id1632477791](https://apps.apple.com/us/app/coding-python-java-code/id1632477791)","link":"https://www.reddit.com/r/Python/comments/11xo6m1/practice_1000_free_python_challenges_with_ai/","created":"2023-03-21","tags":["python","reddit"],"meta":{"num_comments":5}}
{"title":"Was there a reason the post regarding the Devpost Python Hackathon was removed?","description":"I was interested in competing, however after seeing that it had gotten removed so quickly and that the OP’s comments were being downvoted to oblivion, I am a little suspicious of it’s legitimacy.","link":"https://www.reddit.com/r/Python/comments/11y2nk2/was_there_a_reason_the_post_regarding_the_devpost/","created":"2023-03-22","tags":["python","reddit"],"meta":{"num_comments":1}}
{"title":"Twitter API - free, no tokens required","description":"A complete implementation of the Twitter API (1.1/2/graphql)\n\n- automate account actions (tweet,dm,like, etc.)\n- pull data (async)\n- search (async)\n\nhttps://pypi.org/project/twitter-api-client/","link":"https://www.reddit.com/r/Python/comments/11xlw5k/twitter_api_free_no_tokens_required/","created":"2023-03-21","tags":["python","reddit"],"meta":{"num_comments":23}}
{"title":"Opinion on the monaco lib ?","description":"Hi everyone,\n\nI want to develop Monte Carlo simulations for various uses, with tkinter as GUI. I initially planned to interface python with c++, but i just came across the monaco lib. Maybe it is enough for what i need (simulation of traffic jams for example), and could avoid me to interface python and c++ which doesn't seem to be that easy. Do you guys have experience with monaco ? Is it fast / flexible ?\n\nThanks !","link":"https://www.reddit.com/r/Python/comments/11xbg6o/opinion_on_the_monaco_lib/","created":"2023-03-21","tags":["python","reddit"],"meta":{"num_comments":11}}
{"title":"Hello everyone, this is my deep learning project to recognize pokemon by image on Github, hope you enjoy!","description":"Code: [https://github.com/vovod/pytorch-who-is-that-pokemon](https://github.com/vovod/pytorch-who-is-that-pokemon)\n\nhttps://preview.redd.it/ngx9x2cxf3pa1.png?width=640&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ad674ab21c8530d82ab595d40170717c40225163","link":"https://www.reddit.com/r/Python/comments/11xgqwf/hello_everyone_this_is_my_deep_learning_project/","created":"2023-03-21","tags":["python","reddit"],"meta":{"num_comments":3}}
{"title":"How to check if pip package is malicious","description":"I'm looking for some tips on what to look for when evaluating a pip package for malicious code.    \nHere is an actual example I recently went through:\n\nThere is a fairly known pip package called **Cython**: [https://pypi.org/project/Cython/](https://pypi.org/project/Cython/).   \nAt the same time there is a lesser known package very similarly called **cPython**: [https://pypi.org/project/cPython/](https://pypi.org/project/cPython/)^1\n\nIt's easy to mistype:\n`pip install cpython`\ninstead of:\n`pip install cython`\n\nSince pip install executes code from the package itself I thought it would be useful to investigate what this package contains so went through the following steps:\n\n1. Went to project homepage under pypi.org https://pypi.org/project/cPython/ and downloaded the latest package version since I'm assuming this is what pip install fetches if no version is provided. The latest version seems to be 0.0.6 under Downloads: https://pypi.org/project/cPython/#files\n2. Uncompressed the file, it's a tar.gz\n3. Checked the following files:\n    1. setup.py : no suspicious code at first sight. Also looked at dependencies (install_requires) and got 2: pymongo and requests, which are well known packages\n    2. cPython.py in subdirectory cPython: I'm assuming this file is not executed by pip install but I'm not sure if the imports are not resolved, it seems there are more dependencies in this file than listed under setup.py, but none triggers any concerns.\n    3. __init__.py in same subdirectory cPython: empty, similar comment to above.\n\nIt seems this particular package does not distribute binary components so this makes reviewing easier.\n\nWould you think these kind of checks are sufficient or can there be some more hidden traps one can miss even on a simple package as in this example?\n\n\n^1 I should note that at the time of this writing there is no information to assume that malicious code is delivered through the cPython package, although it's not very clear why the author went with this name for what seems to be just a wrapper script.","link":"https://www.reddit.com/r/Python/comments/11xj3ua/how_to_check_if_pip_package_is_malicious/","created":"2023-03-21","tags":["python","reddit"],"meta":{"num_comments":4}}
{"title":"Going to fail an Exam because I wasn't prepared","description":"I feel rather demoralized right now.\n\nI've been studying pretty good all semester in my Python class. I've been reading each chapter in the text book, watching the videos, and doing the assignments to a T. Yet, when I entered into the Midterm Exam, I felt WAY under prepared. I don't feel like I was taught anything.\n\nThis is a course about Python in a program called ArcGIS Pro. First assignment was just introduction. Second was an introduction to IDLE (no scripting yet). The third was towards a little bit of model building and then a tiny bit of scripting. Now we're JUST being introduced to scripting and actually running something.\n\nThe Midterm Exam was way more than \"here a script, run it and see what happens.\" It was \"I want you to create a buffer utilizing a list of four numbers that I'm going to give you and you're going to use a function that I never taught you how to use.\"\n\nHow the hell am I supposed to create a script from my head when I just started learning how to script a few days ago?\n\nMy biggest fear is finding out that other students were able to do this and I'm just a moron.\n\nI thought I was doing well and learning here and there. Now I don't think so.\n\nSorry if this doesn't belong here. I figured this place would be good as any to vent and have people understand what I'm talking about. If you need this removed, it's okay.","link":"https://www.reddit.com/r/Python/comments/11y6h5r/going_to_fail_an_exam_because_i_wasnt_prepared/","created":"2023-03-22","tags":["python","reddit"],"meta":{"num_comments":15}}
{"title":"[ZnFlow] Play around with Graphs","description":"I wrote a small package [ZnFlow](https://github.com/zincware/ZnFlow) ``pip install znflow`` that allows you to build computational graphs based on functions and/or classes. You can define your graph using inheritance or decorators and connect them in what ever way you like. The graph will only be executed when you call ``graph.run()``.\n\nHere is a small example:\n\n```python\nimport znflow\nimport dataclasses\n\n@znflow.nodify\ndef compute_mean(x, y):\n    return (x + y) / 2\n\n@dataclasses.dataclass\nclass ComputeMean(znflow.Node):\n    x: float\n    y: float\n    \n    results: float = None\n    \n    def run(self):\n        self.results = (self.x + self.y) / 2\n        \nwith znflow.DiGraph() as graph:\n    n1 = ComputeMean(2, 8)\n    n2 = compute_mean(13, 7)\n    # connecting classes and functions to a Node\n    n3 = ComputeMean(n1.results, n2) \n    \ngraph.run()\nprint(n3.results)\n# &gt;&gt;&gt; 7.5\n```\n\nSo far there is no parallel execution and this is ment as a playground for writing graphs. The graph is stored using ``networkx`` and can be visualized as such.","link":"https://www.reddit.com/r/Python/comments/11xhb4a/znflow_play_around_with_graphs/","created":"2023-03-21","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"Lona - create full web-applications from a simple Python script","description":"It's been more than a year since last time i posted about my web-framework Lona, and it evolved quite a bit since then!\n\nLona is an easy to use, full Python, framework to create beautiful web-applications in minutes, without dealing with JavaScript or CSS. It has a very flat learning curve to get you started, and scales as your project grows. It is written in vanilla Python and JavaScript, so you don't have to deal with tools and libraries like npm, vue, react etc.\n\nOne of the newest additions to the project is the tutorial i wrote ([https://lona-web.org/1.x/tutorial/index.html](https://lona-web.org/1.x/tutorial/index.html)) to make the first steps even easier. It contains many examples, and small clips of them.\n\nFeedback in any form would be very welcome!\n\n&amp;#x200B;\n\nGithub: [https://github.com/lona-web-org/lona](https://github.com/lona-web-org/lona)\n\nDocumentation: [https://lona-web.org/1.x/](https://lona-web.org/1.x/)\n\nDemos: [https://lona-web.org/1.x/demos/index.html](https://lona-web.org/1.x/demos/index.html)","link":"https://www.reddit.com/r/Python/comments/11wppu7/lona_create_full_webapplications_from_a_simple/","created":"2023-03-20","tags":["python","reddit"],"meta":{"num_comments":62}}
{"title":"Made a basic system monitor with pygame","description":"Full app can be found at: [https://drive.google.com/drive/folders/1-K8IfYNAVmEw35yT2aoZwWBRaK3Ju3fi?usp=share\\_link](https://drive.google.com/drive/folders/1-K8IfYNAVmEw35yT2aoZwWBRaK3Ju3fi?usp=share_link)\n\nAlthough this is a showcase of the app, feel free to let me know if there's any problems\n\n&amp;#x200B;\n\nUpdate: Fixed the credits alignment problem\n\n[System Display](https://reddit.com/link/11xeeuj/video/zc3cmsw0z2pa1/player)","link":"https://www.reddit.com/r/Python/comments/11xeeuj/made_a_basic_system_monitor_with_pygame/","created":"2023-03-21","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"Making a Really good discord bot anyone wanna collaborate reply \"Yeah Let's do it\"","description":"Features:\n1. Ban and Kick\n2. Delete Duplicate Channels\n3. Welcome members\n4. Member count command\n5. Random joke\n6. Random Video\n7. Special rules for server setup command\n8. Designated rules for servers\n9. Channel ID of specific channel\n10. Server ID\n11. Message ID\n\nAND PLANNING TO ADD EVEN MORE....","link":"https://www.reddit.com/r/Python/comments/11y9l2g/making_a_really_good_discord_bot_anyone_wanna/","created":"2023-03-22","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"chat-toolkit: an extensible package for creating ML-powered chatbots","description":"Hello!\n\nI would like to share my first public PyPI project.\n\n    pip install -U chat-toolkit\n\nsource code: [https://github.com/danb27/chat-toolkit](https://github.com/danb27/chat-toolkit)\n\nThis is a quick way to proof of concept a ChatGPT chatbot from the terminal: `python -m chat_toolkit`. But it is also much more.\n\nWhile I have seen other packages/repos recently that also require an OpenAI API key and provide an easy way to access ChatGPT from the terminal, my package is not designed exclusively around the terminal or ChatGPT. It also has the following features:\n\n* Is an extensible framework for making different types of components for conversational AI. Currently, the three types of components are Chatbots, Speech-to-Text, and Text-to-Speech. Each component type currently only supports a single API to start with: OpenAI's ChatGPT (paid), OpenAI's Whisper (paid), and pyttsx3 (free), respectively.\n* Using these three (for now) types of components allows the user to proof of concept more complicated chatbots, such as a Speech to Speech chatbot that you can speak directly with and hear responses from: `python -m chat_toolkit --speech-to-text --text-to-speech`\n* Users can subclass the component base classes to proof of concept currently unsupported algorithms. This is the same process I will use to add support for more algorithms. Components of the same type can be hot-swapped for each other.\n* Extensible components can be used directly for developing your own applications, not just creating a quick proof of concept in the terminal.\n\nWould appreciate any constructive and respectful feedback.\n\nEDIT:\n\n\\- formatting","link":"https://www.reddit.com/r/Python/comments/11xm82u/chattoolkit_an_extensible_package_for_creating/","created":"2023-03-21","tags":["python","reddit"],"meta":{"num_comments":0}}
