{"title":"Wrotescan: Prompt Library and Prompt Database","description":"hi all! I created a free library of prompts at [http://www.wrotescan.com/Prompt\\_Library](http://www.wrotescan.com/Prompt_Library).  It also has a feature where you can submit you own prompt when running the demos to the library and it will show up in the \"Community\" section of history. \n\nas a note, API keys and documents are not persisted on [wrotescan.com](https://wrotescan.com). please create then delete any temp keys used for the site.","link":"https://www.reddit.com/r/PromptDesign/comments/11mm4qu/wrotescan_prompt_library_and_prompt_database/","created":"2023-03-09","tags":["promptdesign","reddit","prompteng"],"meta":{"num_comments":1}}
{"title":"Sharing a tool I am creating to fine-tune a model using reddit data.","description":"So as my billionth side project, I decided to create a web-app that scrapes data from reddit and generates a text file that can be used to fine-tune an openAI model such as davinci-003.  I would love to find people to critique this project and contribute to it.\n\n[here](https://platform.openai.com/docs/guides/fine-tuning) is a link for instructions on how to fine tune a model.  When it comes to the step called **prepare training data** I wanted to sort of automate this by allowing the user to get a bunch of prompts/completions from reddit.  I created an app that generates a jsonl file for fine-tuning using the submission title as the prompt and the submission body and/or comments as the completion.  Let me know if this is something people are interested in collaborating on or if there are other people doing similar things.\n\nLink to my app: [https://fine-tune-reddit.herokuapp.com/](https://fine-tune-reddit.herokuapp.com/)\n\nLink to the CLI project on github: [https://github.com/brianSalk/openai-finetune-reddit](https://github.com/brianSalk/openai-finetune-reddit)\n\nLink to the web-app on github: [https://github.com/brianSalk/reddit-finetune-frontend](https://github.com/brianSalk/reddit-finetune-frontend)","link":"https://www.reddit.com/r/PromptDesign/comments/11lzs34/sharing_a_tool_i_am_creating_to_finetune_a_model/","created":"2023-03-08","tags":["promptdesign","reddit","prompteng"],"meta":{"num_comments":3}}
{"title":"Is it possible to ask Chatgpt to write an article based on information that I provide?","description":"Hi, I am wondering if ChatGPT or other similar AI model can write articles based on information that I provide. For example, if I want to write an article on effectiveness of asthma medication and then give it several research articles to read, can it generate an article based no those articles? I know GPT-3 (with API) probably can do it; however, can we do it on ChatGPT or other AI models? Thank you!","link":"https://www.reddit.com/r/PromptDesign/comments/11l88fv/is_it_possible_to_ask_chatgpt_to_write_an_article/","created":"2023-03-07","tags":["promptdesign","reddit","prompteng"],"meta":{"num_comments":12}}
