{"title":"Factors Influencing Adoption Intention of ChatGPT","description":"Hello,\n\nI am an information systems student currently conducting research for my undergraduate thesis on the factors that influence people's adoption intention of ChatGPT, as well as identifying the factors that may be holding them back. These factors include people's concerns about potential negative impacts of ChatGPT, such as increased unemployment and the spread of misinformation. Your participation in this study is crucial as it will provide valuable insights to help us understand how ChatGPT can be improved to meet users' needs.\n\nPlease note that I am not affiliated with OpenAI, no identifying information will be collected during the survey, and all responses will be kept confidential. The survey should take approximately 10 to 15 minutes to complete, and participation is voluntary. You may withdraw from the survey at any time, and there are no known risks associated with participating.\n\nIf you are interested in learning more about the study, please follow the link below. https://forms.gle/EwZCtpYDvk9R9M386\n\nThank you for taking the time to contribute to our research study. Your participation is greatly appreciated!","link":"https://www.reddit.com/r/deeplearning/comments/11p7x0f/factors_influencing_adoption_intention_of_chatgpt/","created":"2023-03-12","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"Text2Image using ControlNet and Stable Diffusion","description":"In this tutorial, we will show you how to create beautiful and high-quality images from text using the powerful combination of diffusion model and ControlNet. \n\nText2Image generation is a fascinating field of AI that enables machines to understand and visualize human language in a more creative way.\n\n we will walk you through the step-by-step process of how to use the diffusion model and ControlNet to generate images from text. By the end of this tutorial, you will have a thorough understanding of text2image generation and how to use diffusion model and ControlNet to create stunning images from text. You will also have the knowledge and skills to apply these techniques to your own projects and experiments.\n\n So, get ready to dive into the exciting world of text2image generation and start creating your own beautiful images from text today!\n\nhttps://youtu.be/0D5Nlo2REb0","link":"https://www.reddit.com/r/deeplearning/comments/11p1par/text2image_using_controlnet_and_stable_diffusion/","created":"2023-03-12","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"How to blackout certain landmarks from face?","description":"I am working on a project to classify faces and I want to blackout certain areas especially eyes, nose, mouth so that my model can generalize well. But I am confused how to do that. Can someone please guide me?","link":"https://www.reddit.com/r/deeplearning/comments/11opl7o/how_to_blackout_certain_landmarks_from_face/","created":"2023-03-11","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":1}}
{"title":"https://www.kaggle.com/code/sadikaljarif/plant-disease-classification-using-mobilenetv2","description":"# About Dataset\n\n# This dataset is recreated using offline augmentation from the original dataset. The original dataset can be found on [this](https://github.com/spMohanty/PlantVillage-Dataset) github repo. This dataset consists of about 87K rgb images of healthy and diseased crop leaves which is categorized into 38 different classes. The total dataset is divided into 80/20 ratio of training and validation set preserving the directory structure. A new directory containing 33 test images is created later for prediction purpose\n\n# Notebook : [https://www.kaggle.com/code/sadikaljarif/plant-disease-classification-using-mobilenetv2](https://www.kaggle.com/code/sadikaljarif/plant-disease-classification-using-mobilenetv2)","link":"https://www.reddit.com/r/deeplearning/comments/11otmgd/httpswwwkagglecomcodesadikaljarifplantdiseaseclass/","created":"2023-03-11","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"Desktop Computer or some other way to train neural networks?","description":"Should I buy a desktop with a GPU like Nvidia RTX 3080 or perhaps use online VM/Cloud based machines for deep learning. What would be optimal?  Any and all feedback is welcome \n\nI am new to Deep Learning but want to become an expert in areas of Deep Learning especially Computer Vision.","link":"https://www.reddit.com/r/deeplearning/comments/11o8xjx/desktop_computer_or_some_other_way_to_train/","created":"2023-03-11","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":16}}
{"title":"(Python) Library for deep video generation?","description":"I'm searching for a library that allows the creation of artificial interview like video sequences for an input text\n\nAre there any libraries like this or would the best approach be to choose an existing video and use deep fake libraries with artificial faces?","link":"https://www.reddit.com/r/deeplearning/comments/11oo3dj/python_library_for_deep_video_generation/","created":"2023-03-11","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"Generate READMEs Using ChatGPT","description":"&amp;#x200B;\n\nhttps://i.redd.it/k375our2a0na1.gif\n\n&amp;#x200B;\n\nYou can use this program I wrote to generate readmes: [https://github.com/tom-doerr/codex-readme](https://github.com/tom-doerr/codex-readme)\n\n&amp;#x200B;\n\nIt's far from perfect, but I now added ChatGPT and it is surprisingly good at inferring what the project is about. It often generates interesting usage examples and explains the available command line options.\n\n&amp;#x200B;\n\nYou probably won't yet use this for larger projects, but I think this can make sense for small projects or single scripts. Many small scripts are very useful but might never be published because of the work that is required to document and explain it. Using this AI might assist you with that.\n\n&amp;#x200B;\n\nReportedly GPT-4 is coming out next week, which probably would make it even better.\n\n&amp;#x200B;\n\nWhat do you think?","link":"https://www.reddit.com/r/deeplearning/comments/11o5zyl/generate_readmes_using_chatgpt/","created":"2023-03-11","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"How to code a PPO neural network in java","description":"Hello,\n\nI am trying to find out how to make a RL neural network in java, probably using PPO ig? The problem is, that I am too lazy to do it myself, so I tried to find some library, but I wasn't very successful with finding some examples how to use anything. This is my first time I am trying to make a neural network in java (I've used them in other languages, but I have to use java this time), so I am a total noob in this field. So, can you recommend me some libraries? I found DL4J, but I didn't find anything about how to use ppo to train networks with it.\n\nThanks for any response","link":"https://www.reddit.com/r/deeplearning/comments/11oo58v/how_to_code_a_ppo_neural_network_in_java/","created":"2023-03-11","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":7}}
{"title":"One Shot Learning Task","description":"From my understanding, a one shot learning task requires us that given a query example, we must classify it correctly out of N different classes (typically N = 5 way or 20 way). The goal however is that we are provided with only one example per class.\n\nSuppose we take an MNIST type dataset. I can map every pixel that makes up the digit onto a cartesian plane where the xy coordinates values is every \"pixel\". Using this cartesian representation, can I just find the simple distance metric between the pairs? For example on a 20 way task, My question is: At each iteration, we are provided with some query example, along with 20 other candidates...if we compute some sort of simple similarity score (that doesnt require neural nets) like (intersection over union) between each candidate to query pair, does this still count as a one shot learning task?\n\nSo leaving aside a neural network approach, if we were to just use a simple distance metric on the coordinates to compute the pairwise similarity between the query and every \"candidate\", does this count as one shot learning?","link":"https://www.reddit.com/r/deeplearning/comments/11o9ilf/one_shot_learning_task/","created":"2023-03-11","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":3}}
{"title":"Neural Networks for Computational Biophysics","description":"Hello everyone, I'm trying to replicate the results of this paper: \n\nhttps://aip.scitation.org/doi/full/10.1063/1.5110439?casa_token=52rwZkP90dMAAAAA%3AIdHJU3k3uhc_UbnBxhpt37SY3k_3SDGyoDTdRNt1ZhqlYyahdUzcCy1XlvnpGctKHn3sqJFYDBA\n\nHowever, I'm having some difficulties in understanding how this (especially equation 16) can work. My understanding of gradient descent is that, on an operative level, one must calculate a loss between the true label of the sample and the output of the network, and perform the backpropagation accordingly. However, this is a case of unsupervised learning and I don't really know how to go from eq (16) in the paper, to a \"rule\" that modifies the weights of the network. \n\nIf someone can help me out, they will be thanked in my master thesis ❤️","link":"https://www.reddit.com/r/deeplearning/comments/11ntblu/neural_networks_for_computational_biophysics/","created":"2023-03-10","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":1}}
{"title":"[POC] ChatGPT Audio Bot (like Google Assistant and Alexa) - Opensource","description":"Hey guys, just wanna share this bot that I quickly built using ChatGPT API.\n\nGitHub page: [https://github.com/LanyTek/ChatGPT\\_Audio\\_Bot](https://github.com/LanyTek/ChatGPT_Audio_Bot)\n\nThis service allows you to keep talking to the bot using your voice like you often do with Google Assistant or Alexa. It can be used in a lot of scenarios like teaching, gossiping, or quickly retrieving information without the need of typing. \n\nI have a quick video demo here if you wanna check [https://www.youtube.com/watch?v=e9n0BJfMyKw](https://www.youtube.com/watch?v=e9n0BJfMyKw)\n\nIt's open source so feel free to use it for anything you like :)","link":"https://www.reddit.com/r/deeplearning/comments/11nfrhw/poc_chatgpt_audio_bot_like_google_assistant_and/","created":"2023-03-10","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":2}}
{"title":"Does Reinforcement learning algorithm will do the job ?","description":"Hey\n\n I'm trying to make an algorithm that learns to play Yahtzee and maximizes the win or the score depending on what I manage to do \n\nI'm totally new, I watched a lot of videos, I read wikipedia but I don't know in which direction to go I tell myself that doing deep learning with a coupled neural network seems to correspond \n\nI imagine having the algorithm play around ten games and average the scores squared \n\nThen keep the best ones and include mutation\n\n I saw that it was related to the Markov problem, well as you can see it's going all over the place and I don't know where to start","link":"https://www.reddit.com/r/deeplearning/comments/11nxfkh/does_reinforcement_learning_algorithm_will_do_the/","created":"2023-03-10","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":2}}
{"title":"Should the tf2onnx.convert command be avoided to convert tensorflow models to onnx?","description":"Should the tf2onnx.convert command be avoided to convert tensorflow models to onnx?\n\n[https://medium.com/nerd-for-tech/how-to-convert-tensorflow2-model-to-onnx-using-tf2onnx-when-there-is-custom-ops-6e703376ef20](https://medium.com/nerd-for-tech/how-to-convert-tensorflow2-model-to-onnx-using-tf2onnx-when-there-is-custom-ops-6e703376ef20)","link":"https://www.reddit.com/r/deeplearning/comments/11nvtss/should_the_tf2onnxconvert_command_be_avoided_to/","created":"2023-03-10","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"[D] Version 2.1 of the Open Deep Learning Toolkit for Robotics is already available!","description":" The latest version of the Open Deep Learning Toolkit for Robotics, **Version 2.1 is already available !**\n\nThis new version includes the following updates:\n\n**New Features:**\n\n* Added Efficient LiDAR Panoptic Segmentation\n* Added Nanodet 2D Object Detection tool \n* Added C API implementations of NanoDet 2D Object Detection tool\n* Added C API implementations of forward pass of DETR 2D Object Detection tool\n* Added C API implementations of forward pass of DeepSORT 2D Object Tracking tool \n* Added C API implementations of forward pass of Lightweight OpenPose, Pose Estimator tool\n* Added C API implementations of forward pass of X3D 2D Activity Recognition tool \n* Added C API implementations of forward pass of Progressive Spatiotemporal GCN Skeleton-based Action Recognition tool\n* Added Binary High Resolution Analysis tool\n* Added Multi-Object-Search tool \n\n***Enhancements***\n\n* Added support in C API for detection target structure and vector of detections \n* Added support in C API for tensor structure and vector of tensors\n* Added support in C API for json parser \n\nYou can download the toolkit here:  \n\\- GitHub: [https://github.com/opendr-eu/opendr](https://github.com/opendr-eu/opendr)\n\n\\- pip: [https://pypi.org/project/opendr-toolkit/](https://pypi.org/project/opendr-toolkit/)  \n\\- Docker Hub: [https://hub.docker.com/r/opendr/opendr-toolkit/tags](https://hub.docker.com/r/opendr/opendr-toolkit/tags)\n\nLooking forward for your comments and suggestions!","link":"https://www.reddit.com/r/deeplearning/comments/11nv4lq/d_version_21_of_the_open_deep_learning_toolkit/","created":"2023-03-10","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"Looking for feedback on our new AI-assisted drawing app!","description":"Hi everyone,\n\nWe just launched our new app that uses advanced AI algorithms to enhance your drawings and take your art to the next level. We're looking for feedback from the community on the app's functionality and user experience, and would love for you to try it out.\n\nExamples: https://www.youtube.com/shorts/GIP9ESIXz8M \n\nWith our app, you can simply provide your drawing input and watch as our AI model enhances it with stunning results. We believe it's the perfect tool for artists, designers, and anyone who wants to explore their creativity in new ways.\n\nWe would really appreciate it if you could take the time to download and try our app, and provide us with any feedback or suggestions for improvement. We're committed to creating the best experience for our users, and your feedback will help us get there.\n\nYou can download our app from https://play.google.com/store/apps/details?id=com.ai\\_smart\\_draw . We look forward to hearing your thoughts!\n\nThank you","link":"https://www.reddit.com/r/deeplearning/comments/11nthh2/looking_for_feedback_on_our_new_aiassisted/","created":"2023-03-10","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"OpenAI's Python API walk-through","description":"If you are getting started with OpenAI's newest Python API, you don't have to spend too much time familiarising yourself with how to use it. Here is a video that walks through the different possiblities, API parameters and finally shares a demo app: [https://youtu.be/dcnfhtuL7qA](https://youtu.be/dcnfhtuL7qA) \n\nHope its useful. \n\nhttps://preview.redd.it/z1aczihy2xma1.png?width=1920&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=5b749e1485746ce0beeb1f19cc878109d146a2a7","link":"https://www.reddit.com/r/deeplearning/comments/11npswy/openais_python_api_walkthrough/","created":"2023-03-10","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"Approximately how long will it take to finish Transfer Learning?","description":"Hi there,\n\nI  have a multi-task transformer model that I would like to apply transfer  learning to. It is a multi-task model that takes offers \\~5,000 multi  task outputs. I am planning to add one linear layer to the end and  having it offer 50 multi-task outputs after transfer learning. If it  took \\~3 days to train the first model, and I have 800x additional training data for transfer learning, is there an easy way to tell how  long this should take? I suppose I am specifically wondering whether I  should expect it to take 838x as long if I use the same batch sizes  while training, or if decreasing the amount of tasks from \\~5000 to 50  helps decrease training time at all.\n\n&amp;#x200B;\n\nThanks in advance for helping a beginner!","link":"https://www.reddit.com/r/deeplearning/comments/11ne0nm/approximately_how_long_will_it_take_to_finish/","created":"2023-03-10","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
