{"title":"Sunday Daily Thread: What's everyone working on this week?","description":"Tell /r/python what you're working on this week! You can be bragging, grousing, sharing your passion, or explaining your pain. Talk about your current project or your pet project; whatever you want to share.","link":"https://www.reddit.com/r/Python/comments/11ozevp/sunday_daily_thread_whats_everyone_working_on/","created":"2023-03-12","tags":["reddit","python"],"meta":{"num_comments":5}}
{"title":"Saturday Daily Thread: Resource Request and Sharing! Daily Thread","description":"Found a neat resource related to Python over the past week? Looking for a resource to explain a certain topic?\n\nUse this thread to chat about and share Python resources!","link":"https://www.reddit.com/r/Python/comments/11o54ib/saturday_daily_thread_resource_request_and/","created":"2023-03-11","tags":["reddit","python"],"meta":{"num_comments":2}}
{"title":"New book available: Python GUI - Develop Cross Platform Desktop Applications using Python, Qt and PySide6","description":"I have just released a new book about Python and **PySide6** based on my book about PyQt5.  \nMany thanks to this community for giving me some requests to be implemented in this book.  \nI have added user controls including transitions.  \n\\- I am showing a sample of a line of business app including database access using tinydb, which is also written in Python.  \n\\- I have added a multi-treading example, where HTML will be created in the background on given markdown.  \n\\- I have also added a filterable dropdown listbox.  \nOne user control dynamically creates icons in different colors based on SVG on the fly.   \nAnd many more...  \nI will send some free copies out to those people how inspired me to add additional content and the rest of you can get the book on Amazon in [English](https://kdp.amazon.com/amazon-dp-action/us/dualbookshelf.marketplacelink/B0BY3PKBSM) and [German](https://kdp.amazon.com/amazon-dp-action/de/dualbookshelf.marketplacelink/B0BXYPZ6VY).\n\nIf you have ideas or requests what else to show in this book, then please let me know.\n\nhttps://preview.redd.it/5wq1tpxq84na1.png?width=1600&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=225dff3d591a855fe14a7cb4a0a53311607609ba","link":"https://www.reddit.com/r/Python/comments/11ola58/new_book_available_python_gui_develop_cross/","created":"2023-03-11","tags":["reddit","python"],"meta":{"num_comments":48}}
{"title":"Easy Python scripts to impress the business","description":"Hi Python Devs, which quick and easy scripts have you written that impressed the business and got you some kudos without requiring any real effort on your part?","link":"https://www.reddit.com/r/Python/comments/11olib6/easy_python_scripts_to_impress_the_business/","created":"2023-03-11","tags":["reddit","python"],"meta":{"num_comments":80}}
{"title":"Using ChatGPT API in Python (feat. DALL-E, Karlo)","description":"**Using ChatGPT API in Python (feat. DALL-E, Karlo)**\n\n[https://wooiljeong.github.io/python/chatgpt-api/](https://wooiljeong.github.io/python/chatgpt-api/)\n\nHello, I've written a post on how to use the ChatGPT API (ChatCompletions) in Python, which was recently released.\n\nIn addition, I've also included a method for asking ChatGPT to imagine something and having image generating AIs like Karlo and DALL-E draw pictures based on the results. For example, I automated the process of requesting an imagined image of what buildings might look like if humans settled on Mars from ChatGPT and then having a picture drawn based on the results.\n\nI've attached pictures drawn by Karlo API from Kakao and DALL-E from OpenAI. The impressive thing is that the results of the different AIs' interpretations based on ChatGPT's imaginative input are unique and meaningful. As the shared link is written in Korean, I recommend using a Chrome extension to translate the content into English for those who are interested.\n\n[ The image of a human settlement on Mars drawn by DALL-E. ](https://preview.redd.it/58p82nmva9na1.jpg?width=1024&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=2ca4f49b746141321ce367712456c935af3f1fda)\n\n[ The image of a human settlement on Mars drawn by Karlo ](https://preview.redd.it/ohjqtolwa9na1.jpg?width=1024&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=9e30b01af6124a72927da7fe3317bae26dd7290f)","link":"https://www.reddit.com/r/Python/comments/11p7yrq/using_chatgpt_api_in_python_feat_dalle_karlo/","created":"2023-03-12","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"Best places/ways to learn APIs for career progression?","description":"Looking for YT videos, chat chains, something to help me understand APIs and how to build them to use them effectively.","link":"https://www.reddit.com/r/Python/comments/11p4fd0/best_placesways_to_learn_apis_for_career/","created":"2023-03-12","tags":["reddit","python"],"meta":{"num_comments":5}}
{"title":"Matplotlib showing close but incorrect plot?","description":"&amp;#x200B;\n\nhttps://preview.redd.it/ijy6wrntp7na1.png?width=1153&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=e7ca32ae47d023d2916c35827d11eb6a360a411b","link":"https://www.reddit.com/r/Python/comments/11p1ncc/matplotlib_showing_close_but_incorrect_plot/","created":"2023-03-12","tags":["reddit","python"],"meta":{"num_comments":23}}
{"title":"Python Cybersecurity — Build your own python tools (PortScanner, Visual Network Tracker and Anonymous FTP Scanner)","description":"**Python Cybersecurity — PortScanner**\n\nBuild a simple Port Scanner using the Python Programming language. Port Scanner is an application designed to probe a server or host for open ports. Such an application may be used by administrators to verify security policies of their networks and by attackers to identify network services running on a host and exploit vulnerabilities.\n\n**Link**: [https://youtu.be/bH-3PuQC\\_n0](https://youtu.be/bH-3PuQC_n0)\n\n**Python Cybersecurity — Visual Network Tracker**\n\nDive into Network Traffic visualization using the Python programming language, Wireshark and Google Maps. This tutorial covers the implementation steps needed to take a file of network traffic and convert it into a visual presentation using Google Maps.\n\n**Link**: [https://youtu.be/xuNuy8n8u-Y](https://youtu.be/xuNuy8n8u-Y)\n\n**Python Cybersecurity — Anonymous FTP Scanner**\n\nBuild a simple FTP Scanner using the Python Programming language. Anonymous FTP is a means by which archive sites allow general access to their archives of information. These sites create a special account called “anonymous”\n\n**Link**: [https://youtu.be/BIZfRodSW9w](https://youtu.be/BIZfRodSW9w)","link":"https://www.reddit.com/r/Python/comments/11ohb9e/python_cybersecurity_build_your_own_python_tools/","created":"2023-03-11","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"FastKafka - free open source python lib for building Kafka-based services","description":"We were searching for something like FastAPI for Kafka-based service we were developing, but couldn’t find anything similar. So we shamelessly made one by reusing beloved paradigms from FastAPI and we shamelessly named it FastKafka. The point was to set the expectations right - you get pretty much what you would expect: function decorators for consumers and producers with type hints specifying Pydantic classes for JSON encoding/decoding, automatic message routing to Kafka brokers and documentation generation.\n\nPlease take a look and tell us how to make it better. Our goal is to make using it as easy as possible for some how has experience with FastAPI.\n\n[https://github.com/airtai/fastkafka](https://github.com/airtai/fastkafka)","link":"https://www.reddit.com/r/Python/comments/11paz9u/fastkafka_free_open_source_python_lib_for/","created":"2023-03-12","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"I made Flask-Squeeze 2.0, it squeezes responeses with minification and compression!","description":"Hi guys! I just wanted to share the Flask extension [Flask-Squeeze](https://github.com/mkrd/Flask-Squeeze) with you. It will minify HTML, JS and CSS, and compress responses with brotli, deflate, or gzip depending on the request, with almost zero configuration.\n\nI know there are other extensions aswell, but as far as I know, none of them have a complete feature set of minification AND compression.\nI just published version 2.0, which noch also includes HTML minification!\n\nLet me know what you think, and what else could be added :)","link":"https://www.reddit.com/r/Python/comments/11okzqb/i_made_flasksqueeze_20_it_squeezes_responeses/","created":"2023-03-11","tags":["reddit","python"],"meta":{"num_comments":9}}
{"title":"Python Declarative UI Framework","description":"Got the idea days ago, looks like it’s possible to maintain some portability between Tk and Qt.\n\nhttps://github.com/buganini/PUI","link":"https://www.reddit.com/r/Python/comments/11otvzf/python_declarative_ui_framework/","created":"2023-03-11","tags":["reddit","python"],"meta":{"num_comments":1}}
{"title":"Can you help me distinguish library, package, and module in python?","description":"While some tells pandas is a library, others tells it is a package. So I get confused.","link":"https://www.reddit.com/r/Python/comments/11p7g5w/can_you_help_me_distinguish_library_package_and/","created":"2023-03-12","tags":["reddit","python"],"meta":{"num_comments":3}}
{"title":"PSA: conda-libmamba-solver can cut two hours off of your Anaconda install, but has only 47 GitHub stars. It deserves more praise.","description":"If you've dealt with Conda for data science, or just because it's a cool environment, you know the algorithm Conda uses to solve library conflicts is not great. Trying to add 6 packages for example can take 300 seconds to solve. That's just normal. A bit more complex environment, and you can take 20 minutes. If you misstep in just the wrong way however, you can easily take **3+ hours** for the algorithm to figure out what's compatible. Mamba, an alternative to Conda, is a known solution but it just isn't the same. Lots of people would rather keep using Conda. Well... apparently it's fairly straightforward to *fix Conda*:\n\n    conda install -n base conda-libmamba-solver\n\nThen you just add the flag `--solver=libmamba` to each command you want to use it with thereafter and compare the difference. In my case it took a 2 hour 17 minute install down to 16 minutes or so.\n\nThis is also an interesting lesson in software design. Conda tried to roll their own solver that runs on a single core in pure Python. The alternative a proven multi-core C++ library.\n\nHopefully someone finds this useful.\n\n[Link to relevant GitHub. (no affiliation)](https://github.com/conda/conda-libmamba-solver)","link":"https://www.reddit.com/r/Python/comments/11o3n76/psa_condalibmambasolver_can_cut_two_hours_off_of/","created":"2023-03-10","tags":["reddit","python"],"meta":{"num_comments":49}}
{"title":"Cake Day - 1st Job","description":"Just wanted to celebrate my Reddit cake day by announcing that I may be getting my first programming job as I got an email today to be moved forward!!! That’s all. Hope the best for you all.","link":"https://www.reddit.com/r/Python/comments/11o91ik/cake_day_1st_job/","created":"2023-03-11","tags":["reddit","python"],"meta":{"num_comments":20}}
{"title":"How to debug complex tool chains?","description":"Bat files calling python scripts and execution that jumps between multiple python interpreters and virtual environments. How do I debug that in PyCharm.\n\nI only know how to debug within one specific environment (global, virtual environment, app environment - like Maya, Blender, etc) but for chains where the execution jumps around a lot I tend to just run the whole thing manually from the entry point and so only print debugging (and it's time consuming). \n\nHow can I be more effective here?","link":"https://www.reddit.com/r/Python/comments/11omjc1/how_to_debug_complex_tool_chains/","created":"2023-03-11","tags":["reddit","python"],"meta":{"num_comments":3}}
{"title":"« PhoneScan » find information of unknown phone number.","description":"M’y friend based un china create a script in Python to retrieve informations of mobile number.(provider, country, and more…\n\nThe code: https://github.com/L3xiuS/PhoneScanner","link":"https://www.reddit.com/r/Python/comments/11p43ah/phonescan_find_information_of_unknown_phone_number/","created":"2023-03-12","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"Near-Earth Objects &amp; Asteroids: Some space science","description":"Hey everyone,\n\nI wanted to write this small post since a few weeks, but somehow lost track due to new videos and coding I am currently doing in parallel.\n\nAnyway. In the last couple of weeks I created a small Python based project series on Near-Earth Objects (NEOs). Quick intro: NEOs are objects that approach the Sun within a distance of max. 1.3 AU. 1.0 AU corresponds to the average distance between Earth and Sun (around 150 Million km).\n\nYou may hear sometimes of these objects in the media when an asteroid is approaching us, is having a close flyby, or is detected before it vanishes while disintegrating in the night sky, [like this one](https://www.bbc.com/news/uk-64621721).\n\n*But how many objects are out there? Where are they and how do they \"travel\" around the Sun? Are they bright? If yes, how bright? How can we compute their brightness? Can we also model a theoretical distribution of NEOs to get an understanding where we have \"to look at\"? And what kind of telescopes are needed?*\n\nThese are ... a lot of questions. And in my 16 parts tutorial I try to tackle all questions as thoroughly as possible. If you are interested in getting an understanding how this particular topic is handled in \"space science\", feel free to take a look at my GitHub repository and the corresponding explanatory videos.\n\nSpace Science is approachable; and there are tons of libraries and Open Access data for Python. I try to gather my academic knowledge and create these tutorials to support students, free-time coders and everyone, who is into Python and astronomy.\n\nEnjoy!\n\nThomas\n\n[GitHub Link](https://github.com/ThomasAlbin/Astroniz-YT-Tutorials/tree/main/%5BProject%5D-Near-Earth-Objects)\n\n[YouTube Playlist](https://www.youtube.com/watch?v=tVyFqVuuM6g&amp;list=PLNvIBWkEdZ2hL5be8mQdpTU3BjhKIhD6L)","link":"https://www.reddit.com/r/Python/comments/11or701/nearearth_objects_asteroids_some_space_science/","created":"2023-03-11","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"[GlassJar] Stores records as Python objects in the database!","description":"Hi guys!\n\nI created a pickled-based database for storing Python objects. [GlassJar](https://github.com/furkanonder/glassjar) is a database that, unlike other databases, stores records as Python objects in the database and allows you to use them with ORM.\n\n*Let's look at the small example;*\n\nNormally, we can't directly store the Python dict in a database. But in the [GlassJar](https://github.com/furkanonder/glassjar) we can do that!\n\n    &gt;&gt; from glassjar.model import Model\n    &gt;&gt;&gt;\n    &gt;&gt;&gt; class Item(Model):\n    ...     name: str\n    ...     attrs: dict\n    ...\n    &gt;&gt;&gt; item = Item.records.create(name=\"item\", attrs={\"color\": \"red\", \"shape\":\"rectangle\"})\n    &gt;&gt;&gt; item.as_dict()\n    {'name': 'item', 'attrs': {'color': 'red', 'shape': 'rectangle'}}\n    &gt;&gt;&gt; item2 = Item.records.create(name=\"item 2\", attrs={\"color\": \"blue\", \"shape\":\"triangle\"})\n    &gt;&gt;&gt; Item.records.first()\n    Item(name='item', attrs={'color': 'red', 'shape': 'rectangle'})\n    &gt;&gt;&gt; Item.records.last()\n    Item(name='item 2', attrs={'color': 'blue', 'shape': 'triangle'})\n    &gt;&gt;&gt;\n\nCheck out our [documentation](https://furkanonder.github.io/glassjar/) to learn more!","link":"https://www.reddit.com/r/Python/comments/11oh9jc/glassjar_stores_records_as_python_objects_in_the/","created":"2023-03-11","tags":["reddit","python"],"meta":{"num_comments":22}}
{"title":"Do you feel like your education prepped you in becoming a good programmer?","description":"I am just a little bitter. I feel my undergrad was pretty much useless. Do you feel like your undergrad made you what you are today? or did you have to learn on your own?","link":"https://www.reddit.com/r/Python/comments/11nxfx3/do_you_feel_like_your_education_prepped_you_in/","created":"2023-03-10","tags":["reddit","python"],"meta":{"num_comments":126}}
{"title":"How to fix the format","description":"hello, im working on my gui project using tkinter,\n\ni want to execute other .py file in my gui, but the thing is if i do the function like this :\n\nos.system('python3 \"/full/path/name.py\"')\n\nit works,\n\nbut when i do it like this :\n\nos.system(\"'\"+\"python3 \"+ ED\\_entry.get()+ \"'\")\n\nit doesnt work..\n\nanyone knows how can i arrange ED\\_entry.get() value so it can have the same format as the first code?\n\nThank you","link":"https://www.reddit.com/r/Python/comments/11p119h/how_to_fix_the_format/","created":"2023-03-12","tags":["reddit","python"],"meta":{"num_comments":3}}
{"title":"SayIt: a simple text-to-speech CLI app","description":"I made a simple CLI app that can read any text aloud: https://github.com/jabbalaci/say-it . It uses the excellent gTTs library. It can be integrated in other projects too. Possible use cases: PDF to audiobook conversion, practicing pronunciation (for English learners), etc.","link":"https://www.reddit.com/r/Python/comments/11ojkb4/sayit_a_simple_texttospeech_cli_app/","created":"2023-03-11","tags":["reddit","python"],"meta":{"num_comments":5}}
{"title":"IndexError: single positional indexer is out-of-bounds","description":"Getting following error - any help would be much appreciated\n\nIndexError: single positional indexer is out-of-bounds\n\n&amp;#x200B;\n\n    import pandas as pd\n    import yfinance as yf\n    from datetime import datetime\n    \n    # Define the ticker symbol for ES (E-mini S&amp;P 500 Futures)\n    ticker_symbol = \"^ES\"\n    \n    # Define the start and end dates for the data\n    start_date = \"2020-01-01\"\n    end_date = datetime.today().strftime('%Y-%m-%d')  # Today's date\n    \n    # Get the data from Yahoo Finance using yfinance library\n    data = yf.download(ticker_symbol, start=start_date, end=end_date)\n    \n    # Define the periods for the SMAs and EMAs\n    sma_periods = [21, 50, 100, 200]\n    ema_periods = [21, 50, 100, 200]\n    \n    # Calculate the SMAs using Pandas rolling() function\n    sma_output = []\n    for period in sma_periods:\n        sma = data['Close'].rolling(window=period).mean()\n        sma_output.append([f\"{period}-SMA\", sma.iloc[-1]])\n    \n    # Calculate the EMAs using Pandas ewm() function\n    ema_output = []\n    for period in ema_periods:\n        ema = data['Close'].ewm(span=period, adjust=False).mean()\n        ema_output.append([f\"{period}-EMA\", ema.iloc[-1]])\n    \n    # Print the output with headers\n    print(\"{:&lt;10} {:&lt;10} {:&lt;10}\".format('Type', 'Period', 'Value'))\n    for row in sma_output + ema_output:\n        print(\"{:&lt;10} {:&lt;10} {:&lt;10.2f}\".format(row[0], row[1], row[2]))","link":"https://www.reddit.com/r/Python/comments/11osiy1/indexerror_single_positional_indexer_is/","created":"2023-03-11","tags":["reddit","python"],"meta":{"num_comments":3}}
