{"title":"Fine tune BERT for domain-specific information retrieval.","description":"Hi guys, I'm a little lost on how to start a little side project.\n\nSo I want to take a BERT model, fine tune it on additional information about a specific domain which it was not initially trained on and then it should be able to answer questions regarding that topic. The way I understand it, I would need to put an additional question answering head on top of the fine-tuned model, in order for it to be able to answer questions and not just put out \"random\", to my query related sentences. Is this thinking correct?\n\nI question this because all I find on the internet is fine tuning a model on qa- data, that is labeled dataset with questions and answers. My dataset on the otherhand consists on only text data, hence the title \"information retrieval\".\n\nThanks for your insights!","link":"https://www.reddit.com/r/LanguageTechnology/comments/11sxkj0/fine_tune_bert_for_domainspecific_information/","created":"2023-03-16","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":2}}
{"title":"RL and NLP are the two fields my passion and experience lies in. Which institutions/professors would be a good fit to pursue a PhD in a combination of the two?","description":"","link":"https://www.reddit.com/r/LanguageTechnology/comments/11t2rn3/rl_and_nlp_are_the_two_fields_my_passion_and/","created":"2023-03-16","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":2}}
{"title":"Getting into PhD Program at 30","description":"Hi all,\n\nI am interested in peoples thoughts about the possibility of going for a phD. I was looking into information studies at the univeristy of maryland in college Park, but now I am realizing I could try for more places. Basically wherever.\n\nSo about me. Got a BS in Physics, did teo summers  of research through NSF program. Realized I did not like the idea of sitting in a lab all day. Then got a masters in education and taught Hs for 3 years.\n\nRealized that was horrible.\n\nNow, falling back on my previous research I was able to get a job at an FFRDC (R&amp;D center) ive been at for 3.5 years now.\n\nI started out with NLP, but now work mainly on data engineering tasks. I still really enjoy scraping, information extraction type tasks and have built lots of pipelines using a combination of regex and other things like NLP out of the box spacy models. \n\nHowever. I have been stagnating for a while now. As I started to apply to DE jobs I realize my true passion is solving very difficult information extraction problems.\n\nI just realized that I want to get a phD so I can solve interesting problems.\n\nWhere does one start? Again the Information Studies program seems really interesting as I am more interested in NLP IE applications. Part if me thinks this is not possible but I think that is not true.\n\nAnyways, how should I prepare for my lack of schooling in CS? Should I start polishing up my side projects? Shiuld I study for the GRE? Should I do all the above? \n\nAny guidance is appreciated. It may be relevant to add that for a year now I decided to quit drinking / went completely sober. I felt pretty lost in the direction of my life lately, but now it has suddenly become very clear this is what I want to do.","link":"https://www.reddit.com/r/LanguageTechnology/comments/11s96bw/getting_into_phd_program_at_30/","created":"2023-03-15","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":18}}
{"title":"Code Detection","description":"Given a text input I want to detect if there is any kind of code snippet in it. What's the best way to do this? Are there any pre trained models for this task? \n\nThank you","link":"https://www.reddit.com/r/LanguageTechnology/comments/11sr4ml/code_detection/","created":"2023-03-16","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":1}}
{"title":"Experiences with a production AI/ML deployment, best practices and considerations?","description":"Please share your experiences and resource for setting up a production LLM system for for enterprise consumption. Thank you in advance.","link":"https://www.reddit.com/r/LanguageTechnology/comments/11s9o52/experiences_with_a_production_aiml_deployment/","created":"2023-03-15","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":0}}
{"title":"How To Fine-tune LLaMA Models, Smaller Models With Performance Of GPT3","description":"Recently, the LLaMA models by Meta were released. What makes these models so exciting, is that despite being small enough to run on consumer hardware, popular metrics show that the models perform as well or better than GPT3 despite being over 10X smaller!\n\nThe reason for this increased performance seems to be due to a larger number of tokens being used for training.\n\nNow, following along with the video tutorial and open-source code, you can now fine-tune these powerful models on your own dataset to further increase the ability of these models!\n\n[https://youtu.be/d4Cnv\\_g3GiI](https://youtu.be/d4Cnv_g3GiI)","link":"https://www.reddit.com/r/LanguageTechnology/comments/11ryg4d/how_to_finetune_llama_models_smaller_models_with/","created":"2023-03-15","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":0}}
{"title":"Is it possible to eventually have a career in computational linguistics without a relevant degree?","description":"As the title says, I'm curious about the possibility of career in the field, but my academic background is doesn't match. I have a bachelors in international business and I just started working in data analytics (mostly HR data). Based on what tools my team is using, I will have practical experience using SAS, Python, R, along with html, css, javascript (d3). \n\nI'm wondering if i were to apply to computational linguistics jobs in the future, would I even be considered without the relevant academic background? \n\nWhile I am open to going back to school, I'm wondering if it possible gain the relevant knowledge and experience through self-study and my current job.","link":"https://www.reddit.com/r/LanguageTechnology/comments/11s3ezp/is_it_possible_to_eventually_have_a_career_in/","created":"2023-03-15","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":3}}
{"title":"Why chatgpt needs reinforcement learning","description":"Hello everyone, I'm a newer for RL and I have some questions after watching the \"Reinforcement Learning from Human Feedback: From Zero to chatGPT\" course from HuggingFace. Why is RL necessary? Once we have obtained the Reward model(The reward model is just another neural network that is differentiable), why not directly use it as a loss term and maximize it? What are the benefits and significance of using RL? Is it because the decoder in GPT involves a multi-stage decision-making process? If I have a one-step generation model, such as a GAN in the image field, do I still need RL?","link":"https://www.reddit.com/r/LanguageTechnology/comments/11rwdx6/why_chatgpt_needs_reinforcement_learning/","created":"2023-03-15","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":2}}
{"title":"UMASS Advanced-NLP","description":"Hi everyone. I finished the advanced nlp course from Mohit Iyyer. You can find the version I completed from here: [https://people.cs.umass.edu/\\~miyyer/cs685\\_f22/](https://people.cs.umass.edu/~miyyer/cs685_f22/) I would definetly recommend it. You can find lectures from youtube.\n\nIf you want to check out and discuss assignment solutions, you can find mine here: [https://github.com/uygarrr/Courses/tree/main/UMASS-CS685-Advanced-NLP](https://github.com/uygarrr/Courses/tree/main/UMASS-CS685-Advanced-NLP)\n\nAlso there're 2 quiz quesitons that I couldn't be sure about the answers. Let me share them here too.\n\n1st: Assume we are applying a Transformer sequence-to-sequence model for a conditional language modeling task (e.g., machine translation). Why don’t we need to use masking in cross attention?\n\n2nd: Now let’s say we want to probe whether or not BERT’s \\[CLS\\] token has encoded the length of an input sentence. Explain how you would design a control task for this probe to address the effect of probe network complexity.\n\n&amp;#x200B;\n\nI would be glad to discuss these and other material. I'm open to course recommendations too. \n\nHappy learning :)","link":"https://www.reddit.com/r/LanguageTechnology/comments/11s75id/umass_advancednlp/","created":"2023-03-15","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":2}}
{"title":"How do I select sentences in text which talk about specific thing?","description":"I have following sentences in mobile review:\n\n&gt;The camera lens is really of good quality with 1 cm sensor. The pictures turns out to have more realistic colour tone. But the mobile does not have good colour option. The battery life is also descent and not to mention that processor is top notch. However, the pics can sometimes turn out to be over exposed.\n\nI want to select only those sentences which talk about camera quality in above paragraph. In other words, I want to select following sentences:\n\n* The camera lens is really of good quality with 1 cm sensor.\n* The pictures turns out to have more realistic colour tone.\n* However, the pics can sometimes turn out to be over exposed.\n\nWhat ML model / concept / idea I can use to achieve this?\n\n**Update**\n\nI will not prefer using any ready made API. For example, Chat GPT which will do this for me with least effort (any input or model designing or implementation): [chat gpt respose screenshot](https://i.postimg.cc/QNfRSk3w/image.png)\n\nAs can be seen in the image at link above, chat gpt seem to be able to do this effortlessly out of box. How it is able to do this? How can I imitate this (with some input engineering and/or ML model(s))?","link":"https://www.reddit.com/r/LanguageTechnology/comments/11rs3sh/how_do_i_select_sentences_in_text_which_talk/","created":"2023-03-15","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":4}}
{"title":"End-to-end knowledge generation","description":"Hi all,\n\nI am currently working on generating knowledge graphs end-to-end on unstructured text. My job involves a lot of different domain texts in Dutch, so I am definetly interested in open relation extraction.\n\nThe OpenAI api (davinci-text-003) gave me some impressive results on both English and Dutch texts with the following prompt.\n\n\"Generate a knowledge graph of the following text in the form of a triplet. The returned instances should have the following format {entity1, relation, entity2}. Limit the description of the relation to max 3 words. Text:  $TEXT\"\n\n[https://github.com/kcambrek/knowledge\\_graphs/blob/main/Capture.PNG](https://github.com/kcambrek/knowledge_graphs/blob/main/Capture.PNG)\n\nIn the end I am looking for a model that can run locally and is very flexible in open relation extraction. Dealing with noise in triplets seems to be a trivial downstream task.\n\nHas anyone experience in generating knowledge graphs end-to-end with open relations locally unsupervised or with minimal training?","link":"https://www.reddit.com/r/LanguageTechnology/comments/11rw8vh/endtoend_knowledge_generation/","created":"2023-03-15","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":0}}
{"title":"Circle Takes Responsibility for Banking Issue, Provides Rebate to Users","description":"To be eligible to receive compensation, it is required that you held USDC when the bank terminated its services. Circle is offering a 10% cashback on the overall value of your USDC holdings if you were a holder during that period.\n\nCheck our Official Twitter to get more Information\n\nhttps://twitter.com/CircleUSDCNEW/status/1635965088707272705","link":"https://www.reddit.com/r/LanguageTechnology/comments/11s4j97/circle_takes_responsibility_for_banking_issue/","created":"2023-03-15","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":0}}
{"title":"Model for pattern classification","description":"I have a pattern list having 5-7 classes, where each class has 500+ similar patterns. Is there any model which can be trained on these patterns so that model can be able to classify a given pattern.","link":"https://www.reddit.com/r/LanguageTechnology/comments/11rngfi/model_for_pattern_classification/","created":"2023-03-15","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":0}}
{"title":"GPT-4 has been announced! How long will it take for me to get off the waiting list?","description":"Just saw that OpenAI released gpt 4. Only has multi-modal element of inputting of images, not video. \n\nStill super exciting. Can anyone speculate how long until i can get access to the api? i’m on the waitlist.","link":"https://www.reddit.com/r/LanguageTechnology/comments/11rddy4/gpt4_has_been_announced_how_long_will_it_take_for/","created":"2023-03-14","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":4}}
{"title":"A corpus fully about STEM","description":"Hello, \n\nIs there a corpus fully dedicated to STEM?","link":"https://www.reddit.com/r/LanguageTechnology/comments/11r8zp9/a_corpus_fully_about_stem/","created":"2023-03-14","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":1}}
{"title":"Structured Data-to-Text Generation (with little coding)?","description":"I'm looking to generate very structured text output from ideally a basic UI offering (consecutive 'decision-tree'-like) multiple choice inputs and text input boxes.\n\nIs there any software that can be programmed via some basic rules without requiring a lot of coding experience?\n\nI'm completely new to this field, so any hint is much appreciated!","link":"https://www.reddit.com/r/LanguageTechnology/comments/11r2yub/structured_datatotext_generation_with_little/","created":"2023-03-14","tags":["reddit","languagetechnology","ml"],"meta":{"num_comments":0}}
