{"title":"LLMs are getting much cheaper — business impact? [D]","description":"Saw this out of Stanford. Apologies if it’s been shared here already. \n\n*We introduce Alpaca 7B, a model fine-tuned from the LLaMA 7B model on 52K instruction-following demonstrations. On our preliminary evaluation of single-turn instruction following, Alpaca behaves qualitatively similarly to OpenAI’s text-davinci-003, while being surprisingly small and easy/cheap to reproduce (&lt;600$).*\n\nBasically, starting w an open source Meta 7B LLaMa model, they recruited GPT-3.5 to use for self-instruct training (as opposed to RLHF) and were able to produce a model that behaved similar to GPT-3.5. Amazingly, the process only took few weeks and $600 in compute cost.  \n\nAny thoughts on how such low cost to train/deploy LLMs could affect companies like AMD, Nvidia and Intel etc? This seems like new idiom of AI tech and trying to wrap my head around CPU/GPU demand implications given the apparent orders of magnitude training cost reduction. \n\nLink: https://crfm.stanford.edu/2023/03/13/alpaca.html","link":"https://www.reddit.com/r/MachineLearning/comments/11tenm7/llms_are_getting_much_cheaper_business_impact_d/","created":"2023-03-17","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":49}}
{"title":"[P] nanoT5 - Inspired by Jonas Geiping's Cramming and Andrej Karpathy's nanoGPT, we fill the gap of a repository for pre-training T5-style \"LLMs\" under a limited budget in PyTorch","description":"We release the code to reproduce the pre-training of a \"Large Language Model\" (T5) under a limited budget (1xA100 GPU, \\~20 hours) in PyTorch. We start from the randomly initialised T5-base-v1.1 (248M parameters) model implemented in HuggingFace. Next, we pre-train it on the English subset of the C4 dataset and then fine-tune it on Super-Natural Instructions (SNI).\n\n**In \\~20 hours on a single GPU, we achieve \\~40 RougeL on the SNI test set, compared to \\~42 RougeL of the original model available on HuggingFace Hub and pre-trained through \"a combination of model and data parallelism \\[...\\] on slices of Cloud TPU Pods\", each with 1024 TPUs.**\n\nOur core contribution is not the T5 model itself, which follows the HuggingFace implementation. Instead, we optimise everything else in the training pipeline to offer you a user-friendly starting template for your NLP application/research.\n\nWe are keen to hear your suggestions to improve the codebase further.\n\n&amp;#x200B;\n\nGithub: [https://github.com/PiotrNawrot/nanoT5](https://github.com/PiotrNawrot/nanoT5)\n\nTwitter: [https://twitter.com/p\\_nawrot/status/1636373725397520384](https://twitter.com/p_nawrot/status/1636373725397520384)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zluas7u235oa1.png?width=1152&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8d642abdce1753841b7fc977a141d0f13ca2b213","link":"https://www.reddit.com/r/MachineLearning/comments/11t1857/p_nanot5_inspired_by_jonas_geipings_cramming_and/","created":"2023-03-16","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":18}}
{"title":"[R] RWKV 14B ctx8192 is a zero-shot instruction-follower without finetuning, 23 token/s on 3090 after latest optimization (16G VRAM is enough, and you can stream layers to save more VRAM)","description":"I try the \"Alpaca prompt\" on RWKV 14B ctx8192, and to my surprise it works out of box without any finetuning (RWKV is a 100% RNN trained on 100% Pile v1 and nothing else):\n\nhttps://preview.redd.it/fciatottq7oa1.png?width=1046&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=891904adbadefb5902b86f67098c852da88dc167\n\nYou are welcome to try it in RWKV 14B Gradio (click examples below the panel):\n\n[https://huggingface.co/spaces/BlinkDL/ChatRWKV-gradio](https://huggingface.co/spaces/BlinkDL/ChatRWKV-gradio)\n\nTips: try \"Expert Response\" or \"Expert Long Response\" or \"Expert Full Response\" too.\n\nhttps://preview.redd.it/qo71b85vq7oa1.png?width=2516&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=c4b1717754d03e28b4bba01530672935407e7797\n\n===================\n\nChatRWKV v2 is now using a CUDA kernel to optimize INT8 inference (23 token/s on 3090): [https://github.com/BlinkDL/ChatRWKV](https://github.com/BlinkDL/ChatRWKV)\n\nUpgrade to latest code and \"pip install rwkv --upgrade\" to 0.5.0, and set os.environ\\[\"RWKV\\_CUDA\\_ON\"\\] = '1' in v2/chat.py to enjoy the speed.\n\nThe inference speed (and VRAM consumption) of RWKV is independent of ctxlen, because it's an RNN (note: currently the preprocessing of a long prompt takes more VRAM but that can be optimized because we can process in chunks).\n\nMeanwhile I find the latest RWKV-4-Pile-14B-20230313-ctx8192-test1050 model can utilize a long ctx:\n\nhttps://preview.redd.it/a68dw0hzq7oa1.png?width=398&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=307e4d7847cb03cab3930b3ea07e9b2f856c9b1c","link":"https://www.reddit.com/r/MachineLearning/comments/11teywc/r_rwkv_14b_ctx8192_is_a_zeroshot/","created":"2023-03-17","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":9}}
{"title":"[D] Our community must get serious about opposing OpenAI","description":"OpenAI was founded for the explicit purpose of democratizing access to AI and acting as a counterbalance to the closed off world of big tech by developing open source tools.\n\nThey have abandoned this idea entirely.\n\nToday, with the release of GPT4 and their direct statement that they will not release details of the model creation due to \"safety concerns\" and the competitive environment, they have created a precedent worse than those that existed before they entered the field. We're at risk now of other major players, who previously at least published their work and contributed to open source tools, close themselves off as well.\n\nAI alignment is a serious issue that we definitely have not solved. Its a huge field with a dizzying array of ideas, beliefs and approaches. We're talking about trying to capture the interests and goals of all humanity, after all. In this space, the one approach that is horrifying (and the one that OpenAI was LITERALLY created to prevent) is a singular or oligarchy of for profit corporations making this decision for us. This is exactly what OpenAI plans to do.\n\nI get it, GPT4 is incredible. However, we are talking about the single most transformative technology and societal change that humanity has ever made. It needs to be for everyone or else the average person is going to be left behind.\n\nWe need to unify around open source development; choose companies that contribute to science, and condemn the ones that don't.\n\nThis conversation will only ever get more important.","link":"https://www.reddit.com/r/MachineLearning/comments/11sboh1/d_our_community_must_get_serious_about_opposing/","created":"2023-03-15","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":372}}
{"title":"[D] PyTorch 2.0 Native Flash Attention 32k Context Window","description":"Hi,\n\nI did a quick experiment with Pytorch 2.0 Native scaled\\_dot\\_product\\_attention. I was able to a single forward pass within 9GB of memory which is astounding. I think by patching existing Pretrained GPT models and adding more positional encodings, one could easily fine-tune those models to 32k attention on a single A100 80GB. Here is the code I used:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6csxe28lv9oa1.png?width=607&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=1db074eaea9bb6d0b95678c2cfe39dc71cb48adf\n\nI think it should be possible to replicate even GPT-4 with open source tools something like Bloom + FlashAttention &amp; fine-tune on 32k tokens.","link":"https://www.reddit.com/r/MachineLearning/comments/11tmpc5/d_pytorch_20_native_flash_attention_32k_context/","created":"2023-03-17","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":1}}
{"title":"training KGE model [Project]","description":"I have knowledge graph : 24 relationships, 11 entities , &gt; 20K facts   (rows). What I need is the embedding for only one entity, out of those 11. Once the training is completed, I will extract those embeddings and  use them to train a separate GNN model.  \nMy idea was to over-fit  the  KGE model and use all data for training. Given my use case I don't  see  why a test set is needed. Once the model is trained, I will  evaluate it  on the train set, if MRR/ Hits@10 are good, I would extract  the embedding  and mode forward. If not, I will test a different model  and iterate.  \nAm I doing something stupid ?","link":"https://www.reddit.com/r/MachineLearning/comments/11tda6k/training_kge_model_project/","created":"2023-03-17","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":1}}
{"title":"Is it worth it getting into ML/DL now? \"[D]\"","description":"I am a blockchain dev with a huge passion in ML, for the past few months i have been all in on web3, i still am, but machine learning has always been a part of me, and this recent boom of it , has led to want to go back and learn it and develop some stuff with it or even find a case where i might be able to merge web3 and ML/DL.\n\nThe rise of  LLM's, makes me feel that there's not much i can do, what do you guys feels about this, how do you overcome this feeling.","link":"https://www.reddit.com/r/MachineLearning/comments/11tmz03/is_it_worth_it_getting_into_mldl_now_d/","created":"2023-03-17","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":0}}
{"title":"[D] GPT-4 is really dumb","description":"Probably I was to hyped about it, but the model seems to fail at basic math. For example 2015 is not the sum  11\\^3 + 8\\^3 + 2\\^3\n\n&amp;#x200B;\n\nhttps://preview.redd.it/35d4rh7tw9oa1.png?width=1498&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=b83029b1442bc87c6231e8dad1e7a646f3c098d9","link":"https://www.reddit.com/r/MachineLearning/comments/11tmu9u/d_gpt4_is_really_dumb/","created":"2023-03-17","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":1}}
{"title":"[P]: Can i create a text completion, algorithm using markov models?","description":"I am currently trying to write a discord chatbot, without reassembling on LLMs like GPT-J, or BLOOM.\n\nThe issue i has with these teo LLMs, is that i cant finetune them on my hardware, or even on google colab with GPU. Because theyre pretty big.\n\nCan you guys give me tips, to model, or combine multiple markov models to create a chatbot, that can continue a concise dialog.\n\nI preferer markov models because theyre pretty lighweight, and i can use a small handcraft dataset.\n\nThis is just for fun and learning.","link":"https://www.reddit.com/r/MachineLearning/comments/11tgdiy/p_can_i_create_a_text_completion_algorithm_using/","created":"2023-03-17","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":3}}
{"title":"[N] A $250k contest to read ancient Roman papyrus scrolls with ML","description":"Today we launched [the Vesuvius Challenge](https://scrollprize.org/), an open competition to read a set of charred papyrus scrolls that were buried by the eruption of Mount Vesuvius 2000 years ago. The scrolls can't be physically opened, but we have released 3d tomographic x-ray scans of two of them at 8µm resolution.  The scans were made at a particle accelerator. \n\nA team at UKY led by Prof Brent Seales has [very recently demonstrated](https://scrollprize.org/tutorial4) the ability to detect ink inside the CT scans using CNNs, and so we believe that it is possible for the first time in history to read what's in these scrolls without opening them. There are hundreds of carbonized scrolls that we could read once the technique works – enough to more than double our total corpus of literature from antiquity.\n\nMany of us are fans of /r/MachineLearning and we thought this group would be interested in hearing about it!","link":"https://www.reddit.com/r/MachineLearning/comments/11sgn67/n_a_250k_contest_to_read_ancient_roman_papyrus/","created":"2023-03-16","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":32}}
{"title":"[D] Creating an open platform for collecting corrective feedback on conversational ML products &amp; projects","description":"Any applied scientist or engineer working with deep learning would tell you that corrective info/feedback is the only way up (especially for massive deep networks). With some of my fellows, we are watching what has been happening in the last couple of months with quite a shock and wonder as the community is throwing valuable feedback (for free) to a (closed source) company from all available online channels (e.g., Reddit, Twitter, Github, blogs), boosting their models (again for free).\n\nI should better note here that this is what they need to go from GPT-4 to v5, or GPTX (folks love X these days).\n\nThere are also valuable calls to action from the community. As a start, community can attempt to create an open initiative to organize all the feedback thrown to open or closed (e.g., GPT-4) conversational models/papers/products. One may argue this will make companies' work even easier, but if there is a resource to mine, it will be mined. Therefore creating a (legal) initiative may work in the favor of the community.\n\nWe should consider that conversational DL (maybe in the far future AI, not sure about that yet) becoming like the commercial aircraft industry where the only way to succeed is to fall and enforce what went wrong. Although the community is very excited now, folks may (probably will) get saturated, and the new companies and initiatives in the future may not get the same amount of feedback. \n\nThis may create a monopoly, so it can be a better idea now to discuss the options how we can unify these valuable resources.","link":"https://www.reddit.com/r/MachineLearning/comments/11szdo9/d_creating_an_open_platform_for_collecting/","created":"2023-03-16","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":5}}
{"title":"[N] bloomz.cpp: Run any BLOOM-like model in pure C++","description":"[bloomz.cpp](https://github.com/NouamaneTazi/bloomz.cpp) allows running inference of BLOOM-like models in pure C/C++ (inspired by llama.cpp). It supports all models that can be loaded with `BloomForCausalLM.from_pretrained()`. For example, you can achieve 16 tokens per second on a M1 Pro.","link":"https://www.reddit.com/r/MachineLearning/comments/11spw6r/n_bloomzcpp_run_any_bloomlike_model_in_pure_c/","created":"2023-03-16","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":0}}
{"title":"[N] PyTorch 2.0: Our next generation release that is faster, more Pythonic and Dynamic as ever","description":"Preview of the post since it's dropping in a few hours: https://deploy-preview-1313--pytorch-dot-org-preview.netlify.app/blog/pytorch-2.0-release/\n\n\nAlso a post about Accelerated Diffusers with 2.0: https://deploy-preview-1315--pytorch-dot-org-preview.netlify.app/blog/accelerated-diffusers-pt-20/\n\nGPT Summary:\n\n- PyTorch 2.0 is a next generation release that offers faster performance and support for dynamic shapes and distributed training using torch.compile as the main API.\n\n- PyTorch 2.0 also includes a stable version of Accelerated Transformers, which use custom kernels for scaled dot product attention and are integrated with torch.compile.\n\n- Other beta features include PyTorch MPS Backend for GPU-accelerated training on Mac platforms, functorch APIs in the torch.func module, and AWS Graviton3 optimization for CPU inference.\n\n- The release also includes prototype features and technologies across TensorParallel, DTensor, 2D parallel, TorchDynamo, AOTAutograd, PrimTorch and TorchInductor.","link":"https://www.reddit.com/r/MachineLearning/comments/11s58n4/n_pytorch_20_our_next_generation_release_that_is/","created":"2023-03-15","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":32}}
{"title":"[D] What do people think about OpenAI not releasing its research but benefiting from others’ research? Should google meta enforce its patents against them?","description":"It seems like the days for open research in AI are gone.\n\nAlso, since one of the main reasons they say about not releasing any details is competetive pressure (aka commercial interest), I feel it is fair for others to enforce their patents just like in other fields like pharma? I am very interested in the counter arguments and understanding around this.","link":"https://www.reddit.com/r/MachineLearning/comments/11rtzv6/d_what_do_people_think_about_openai_not_releasing/","created":"2023-03-15","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":164}}
{"title":"In your experience, are AI Ethics teams valuable/effective? [D]","description":"Hello! I read the following article about Microsoft laying off their AI Ethics team: https://www.cmswire.com/customer-experience/microsoft-cuts-ai-ethics-and-society-team-as-part-of-layoffs/\n\nIn your experience, what value do AI ethics teams add? Do they actually add useful insight, or do they serve more as a PR thing? I’ve heard conflicting anecdotes for each side. Is there anything you think AI ethics as a field can do to be more useful and to get more change? Thanks!","link":"https://www.reddit.com/r/MachineLearning/comments/11sfhzx/in_your_experience_are_ai_ethics_teams/","created":"2023-03-16","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":29}}
{"title":"[D] Comparison of the Model prediction uncertainty of two different models","description":"In your career as data scientists have you ever faced the situation where you have to compare the quality of the predictive uncertainty estimation of a machine learning model with an old statistical model that was already in use? if so, how did you do it?\n\ni have a bnn trained on some experimental data and a statistical models developed by my department that depends on some parameters estimated through the classic mcmc methods. Both seems to agree well with the experimental data but i wanted to compare the quality of the model predictive uncertainty\n\n&amp;#x200B;\n\ni thought about comparing the level of calibration of the uncertainty but  i am not sure if i have to do it on the test dataset (due to the bnn) or the entire dataset ( due to the fact that for the old statistical model they use mcmc methods on the entire dataset)","link":"https://www.reddit.com/r/MachineLearning/comments/11stv9f/d_comparison_of_the_model_prediction_uncertainty/","created":"2023-03-16","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":12}}
{"title":"[D] paperspace or another cloud service","description":"\ni'm working on colab, and i have 25GB of ram but that's not enough for my case and my notebook always end up crashing (only reading data, i haven't even started the training process).\n\ni considering passing to paperspace gradient but can i access my data stored in drive with it ? ( in colab it's easy to mount it),  and if i move the data from drive to github repo can i access it then ?","link":"https://www.reddit.com/r/MachineLearning/comments/11stojh/d_paperspace_or_another_cloud_service/","created":"2023-03-16","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":5}}
{"title":"[D] Anyone else witnessing a panic inside NLP orgs of big tech companies?","description":"I'm in a big tech company working along side a science team for a product you've all probably used. We have these year long initiatives to productionalize \"state of the art NLP models\" that are now completely obsolete in the face of GPT-4. I think at first the science orgs were quiet/in denial. But now it's very obvious we are basically working on worthless technology. And by \"we\", I mean a large organization with scores of teams. \n\nAnyone else seeing this? What is the long term effect on science careers that get disrupted like this? Whats even more odd is the ego's of some of these science people\n\nClearly the model is not a catch all, but still","link":"https://www.reddit.com/r/MachineLearning/comments/11rizyb/d_anyone_else_witnessing_a_panic_inside_nlp_orgs/","created":"2023-03-15","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":457}}
{"title":"[N] Mozilla launched a responsible AI challenge and I'm stoked about it","description":"who's applying and what are you planning to build???  [https://www.axios.com/2023/03/15/mozilla-responsible-ai-challenge](https://www.axios.com/2023/03/15/mozilla-responsible-ai-challenge)","link":"https://www.reddit.com/r/MachineLearning/comments/11s8yk2/n_mozilla_launched_a_responsible_ai_challenge_and/","created":"2023-03-15","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":8}}
{"title":"[D] Any other ICML reviewers noticing strange scores for the papers they're assigned to?","description":"I'm reviewing 4 papers, of which I gave one a very positive review. I am the only negative reviewer for 3/4 of the papers I am reviewing. Most of the papers have short, glowing positive reviews that don't meaningfully engage with the paper at all. At least two of the papers have bizarre formatting problems like blurry figures with unreadable text (not publication quality) that don't pass the eye test.\n\nA similar thing happened at ICLR reviews this year, and the authors withdrew their papers in spite of having 2x very positive reviews and 1x slightly negative review (mine). No attempt at rebuttal.\n\nHas anybody else experienced this?","link":"https://www.reddit.com/r/MachineLearning/comments/11scezi/d_any_other_icml_reviewers_noticing_strange/","created":"2023-03-15","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":10}}
{"title":"[D] 5 days ago I asked a question.","description":"First of all, Id like to apologize for my last post, I could have definitely worded it better. \n\nNow then:\n\nWith the release of GPT4, being multimodal, 32k tokens, and being a pretty decent upgrade from ChatGPT in general, it does seem like some ML fields will be completely dominated by these MLLMs.\n\nSaw some PhD and PhD candidates freaking out too.\n\nSo it begs the question: are you folks still confident that there is room for independent jobs in NLP and computer vision?\n\nOnce again, would love to hear your answers.","link":"https://www.reddit.com/r/MachineLearning/comments/11tdjao/d_5_days_ago_i_asked_a_question/","created":"2023-03-17","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":7}}
{"title":"[D] To those of you who quit machine learning, what do you do now?","description":"I'm currently doing my master's degree and have been set on a DL-related career for a while. But recently I noticed it doesn't bring me joy.\n\nComing up with architectures that randomly work/don't work, tuning parameters, waiting for days till the model is trained... the level of uncertainty is just too high for me. Because of that, I don't feel productive working on it and I'm slowly considering switching to another IT field.\n\nFor those of you who quit machine learning (especially deep learning):\n\n1. What did you switch to?\n2. Are you satisfied with your new job? (Is it stressful/intellectually challenging? Is it possible to keep it 9-5?)\n3. How to ensure a smooth transition to that field?\n\nThanks in advance!\n\n\\_\\_\\_  \nPS I know machine learning isn't all about deep learning, but in my current subfield (computer vision), mostly deep learning is used.","link":"https://www.reddit.com/r/MachineLearning/comments/11ryvao/d_to_those_of_you_who_quit_machine_learning_what/","created":"2023-03-15","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":36}}
{"title":"[D] GPT-3 will ignore tools when it disagrees with them","description":"[https://vgel.me/posts/tools-not-needed/](https://vgel.me/posts/tools-not-needed/)","link":"https://www.reddit.com/r/MachineLearning/comments/11s654g/d_gpt3_will_ignore_tools_when_it_disagrees_with/","created":"2023-03-15","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":5}}
{"title":"[D] Is there an expectation that epochs/learning rates should be kept the same between benchmark experiments?","description":"I've found that by dramatically lowering the LR and increasing the number of epochs, very simple, baseline models can outperform SoTA models which use far more parameters. Is this considered \"cheating\" when comparing models? Is this something interesting enough to warrant a short paper? I'm not sure what to do with this information. \n\nFor example, in the original [VGAE](https://arxiv.org/pdf/1611.07308v1.pdf) paper, when training a GAE, they use a LR of 0.01, and train for 200 epochs to get 0.91 AUC, 0.92 AP on a link prediction experiment. Rerunning the same experiment with a LR of 5e-5 for 1500 epochs gets 0.97 AUC, 0.97 AP which is better than the current leader on papers with code for this dataset. \n\nIt needs more epochs but has way, way fewer parameters than SoTA models, is this a valid trade-off? Is this even a fair comparison?","link":"https://www.reddit.com/r/MachineLearning/comments/11s1zfh/d_is_there_an_expectation_that_epochslearning/","created":"2023-03-15","tags":["ml","machinelearning","reddit"],"meta":{"num_comments":10}}
