{"title":"Thursday Daily Thread: Python Careers, Courses, and Furthering Education!","description":"Discussion of using Python in a professional environment, getting jobs in Python as well as ask questions about courses to further your python education!\n\n**This thread is not for recruitment, please see** r/PythonJobs **or the thread in the sidebar for that.**","link":"https://www.reddit.com/r/Python/comments/11sduam/thursday_daily_thread_python_careers_courses_and/","created":"2023-03-16","tags":["reddit","python"],"meta":{"num_comments":2}}
{"title":"The Ruff python linter is insanely good","description":"I just migrated some of my projects over to using [ruff](https://github.com/charliermarsh/ruff), and I am EXTREMELY impressed. It is quite literally 100 times faster than my previous linting configuration, all while being more organized and powerful. It's mind boggling fast. It has all of the plugins builtin that I was previously using with tools like flake8. It hooks into `pre-commit` and replaces many plugins I had before like:\n\n* `isort` - sorts imports\n* `bandit` - finds common security issues\n* `flake8` - linter; additional benefit is that I can now delete my \\`.flake8\\` file.\n* `pygrep-hooks` - common misc linting\n\nAdditionally, it's completely configurable via pyproject.toml, so that always feels good.\n\nBy the way, if you want to checkout my python template, it has my preferred ruff configuration:[https://github.com/BrianPugh/python-template](https://github.com/BrianPugh/python-template)","link":"https://www.reddit.com/r/Python/comments/11syxd0/the_ruff_python_linter_is_insanely_good/","created":"2023-03-16","tags":["reddit","python"],"meta":{"num_comments":90}}
{"title":"Dad Joke Collector for my Blog","description":"Wrote a dad joke collector for my personal website. It runs on a cron and stores any jokes that have not already been stored into my dadabase based on the creation time of the posts I bookmark/save.  \n   \n[https://krowvin.com/dadjokes](https://krowvin.com/dadjokes)\n\n&amp;#x200B;\n\n[dbapi is a class I wrote using SQLAlchemy to do various things with my homelab database. ](https://preview.redd.it/620fy2g7s7oa1.png?width=793&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=97f2bed3a24f06c71000fe24bc02568ff341e88e)","link":"https://www.reddit.com/r/Python/comments/11tf5xk/dad_joke_collector_for_my_blog/","created":"2023-03-17","tags":["reddit","python"],"meta":{"num_comments":2}}
{"title":"Is setting up React with Python difficult?","description":"Is it difficult to setup React with Python that meets the following requirements:\n\n1. Server Side Rendering\n2. Server Side Generation\n3. Incremental Server Side Generation\n4. Use React as a template with an experience similar to using Jinja templates","link":"https://www.reddit.com/r/Python/comments/11tlnkq/is_setting_up_react_with_python_difficult/","created":"2023-03-17","tags":["reddit","python"],"meta":{"num_comments":18}}
{"title":"Book recommendation, advanced+ level in Python","description":"Hello,\n\nI'd like to deepen my knowledge of Python. I'd like to make good decisions when writing Python code based on a solid foundation of **how Python works internally**.\n\nI have 7 YOE (but that doesn't tell much about my level), I think Python meta-programming level is something I found hardest to understand so far (because I needed it only 2x so far), hope this helps to better judge my level.\n\nI mostly created **web applications**, I'm not interested in machine learning or data science. My focus should ideally be on high-performant APIs in terms of response times and processing load. I realize for this I mostly have to rely on existing tools and good architecture, but I still feel I should have a deeper knowledge of Python itself.\n\nI'm a big fan of **async Python** so if the book goes in this direction too, I'd be happy.\n\nCan you please recommend a book that would fulfill this goal of mine? :) I'd prefer books written after asyncio started to be widely used.\n\nCourse recommendations are welcomed too, but it seems to me most of those are aimed at beginners.\n\nI appreciate your answers and the time spent answering here.  \n\n\nP.S. So far it seems **High Performance Python** might tick the boxes, but I'm not sure.","link":"https://www.reddit.com/r/Python/comments/11t29at/book_recommendation_advanced_level_in_python/","created":"2023-03-16","tags":["reddit","python"],"meta":{"num_comments":13}}
{"title":"Here is how i made a 2D game using Python Matplotlib","description":"Im only few month into learning Python and i was wondering if i could make a game with it. I didnt know about any libraries created specifically for developing games at the time, so i asked an AI if i could somehow make a code that opens and plays GIF animations. AI came up with a function that opens GIFs as matplotlib plots. I added a condition that if 'space' button is pressed, the animation stops and the last frame number is saved into a variable, and then the value of the variable determines what happens next. This whole game is built around this simple algorithm.\n\nshowcase: [https://youtu.be/ZAXlaOWMgfM](https://youtu.be/ZAXlaOWMgfM)\n\nsource code: [https://drive.google.com/drive/folders/1bKV4\\_AdCgnW40A8B1kFkFYryIuTE44A6?usp=share\\_link](https://drive.google.com/drive/folders/1bKV4_AdCgnW40A8B1kFkFYryIuTE44A6?usp=share_link)\n\n[icon](https://preview.redd.it/q6463xvfr4oa1.png?width=640&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=68ba371480740ee9117b4fd4b68d1ef37554d4f2)\n\n&amp;#x200B;\n\n[QTE](https://preview.redd.it/kzjifyrkr4oa1.png?width=575&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=3c45f92e81ba39711ea5ff760766e9ddf07e236d)","link":"https://www.reddit.com/r/Python/comments/11szlvk/here_is_how_i_made_a_2d_game_using_python/","created":"2023-03-16","tags":["reddit","python"],"meta":{"num_comments":9}}
{"title":"Theine 0.3.3, introducing new Clock-PRO eviction policy","description":"Theine: high performance in-memory cache\n\n[https://github.com/Yiling-J/theine](https://github.com/Yiling-J/theine)\n\nTheine 0.3.3 add a new eviction policy called Clock-PRO, which has better hit ratio than LRU in most cases and outperform W-TinyLFU in some benchmarks.\n\n[Clock-PRO](https://static.usenix.org/event/usenix05/tech/general/full_papers/jiang/jiang_html/html.html): An improved CLOCK replacement policy (CLOCK: an approximation of LRU).\n\n**10k requests benchmark**\n\nPython: 3.11 / OS: Ubuntu 22.04.2 LTS\n\nWrite and Mix Zipf use 1k max cache size, so you can see the high cost of traditional LFU eviction policy here.\n\n||Read|Write|Mix Zipf|\n|:-|:-|:-|:-|\n|Theine(Clock-Pro) API|3.07 ms|9.86 ms||\n|Theine(W-TinyLFU) API|3.42 ms|10.14 ms||\n|Theine(W-TinyLFU) Auto-Key Decorator|7.17 ms|18.41 ms|13.18 ms|\n|Theine(W-TinyLFU) Custom-Key Decorator|6.45 ms|17.67 ms|11.50 ms|\n|Cachetools LFU Decorator|15.70 ms|627.10 ms|191.04 ms|\n|Cacheout LFU Decorator|50.05 ms|704.70 ms|250.95 ms|\n|Theine(LRU) Custom-Key Decorator|5.70 ms|16.04 ms|10.91 ms|\n|Cachetools LRU Decorator|14.05 ms|61.06 ms|36.89 ms|\n|Cacheout LRU Decorator|47.90 ms|94.94 ms|68.25 ms|\n\nSee github README for hit ratio benchmarks.","link":"https://www.reddit.com/r/Python/comments/11tn0gv/theine_033_introducing_new_clockpro_eviction/","created":"2023-03-17","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"What should I unit test?","description":"I have a code challenge which was to call the Rick and Morty API and display a list of characters. It's all working. However, one of the requirements asks for a unit test.\n\nI'm not exactly sure what I should unit test here. I usually just have tests for util functions. Would a test to make sure the API is returning 200 be a good test?","link":"https://www.reddit.com/r/Python/comments/11tj7gm/what_should_i_unit_test/","created":"2023-03-17","tags":["reddit","python"],"meta":{"num_comments":7}}
{"title":"PEP 8","description":"Hello all, just wanted to say hi because I'm new here. I found the group searching PEP 8 gvr online. I'm actually surprised I hadn't thought to look for this group here sooner. Anyway I'm very new and I look forward to learning a lot here and possibly sharing my knowledge in the near future. Thanks!","link":"https://www.reddit.com/r/Python/comments/11tm7pk/pep_8/","created":"2023-03-17","tags":["reddit","python"],"meta":{"num_comments":2}}
{"title":"README-AI: automated README creation and codebase documentation!","description":"Hey all,\n\nWanted to share a Python project I'm building called [README-AI](https://github.com/eli64s/README-AI). The goal of this project is to automate the process of creating README Markdown files and generate boilerplate documentation for your codebase, leveraging OpenAI's language model API.\n\nThe project can be found on GitHub using the link below:  \n[**https://github.com/eli64s/README-AI**](https://github.com/eli64s/README-AI).\n\nContributions are welcomed and appreciate any feedback or suggestions to improve the codebase and enhance the project's usability for users.\n\nThanks for taking the time to read this post, and happy coding!","link":"https://www.reddit.com/r/Python/comments/11ti68c/readmeai_automated_readme_creation_and_codebase/","created":"2023-03-17","tags":["reddit","python"],"meta":{"num_comments":1}}
{"title":"Github Action and Pre-commit hooks","description":"I’m curious, how do you use github actions with your projects? What are some cool pipelines that you have set up?","link":"https://www.reddit.com/r/Python/comments/11t597e/github_action_and_precommit_hooks/","created":"2023-03-16","tags":["reddit","python"],"meta":{"num_comments":3}}
{"title":"Made a Python package for extracting color palettes from images","description":"So I made a color palette extractor Python package last year which extracts color palettes from images and stores them in JSON files. When I made the package, it was for the Unix-ricing community here on Reddit and I wasn’t aware at that time that similar packages were already available or did something similar.\n\nAnyways, I never made a post here about the package. And since I’ve recently reworked the codebase, I wanted to share about it with the Python community. This is my first time working with the Python language and also my first time publishing something I made as a whole package.\n\nA small 1 minute demonstration of the package being used:  \n[Package Example](https://imgur.com/a/jKjagVE)\n\nThe package is available through PyPI and GitHub, however I hope it’s okay if I only post the link to it’s PyPI homepage since I don’t want my GitHub name to be attached to this post (the link to the source code as well as the GitHub home page is both in the ReadMe and the homepage button in the PyPI project details):  \n[PyPI package homepage](https://pypi.org/project/pypalex/)\n\nIf the GitHub link to the source code is a hard requirement, please let me know and I will change the link in this post to point to it’s GitHub repo instead of PyPI!\n\nI ask that if you use the package please feel free to leave any kind of feedback, especially if it’s constructive criticism! I have discussion posts that are open on the GitHub repo for every new version of the package I’ve released. And thank you so much for any feedback! I appreciate and value it a whole lot!","link":"https://www.reddit.com/r/Python/comments/11sxgjp/made_a_python_package_for_extracting_color/","created":"2023-03-16","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"looking for a coding buddy!","description":"Hit me up!","link":"https://www.reddit.com/r/Python/comments/11suzz1/looking_for_a_coding_buddy/","created":"2023-03-16","tags":["reddit","python"],"meta":{"num_comments":29}}
{"title":"How to keep a command prompt window open after subprocess is launched in it and completes","description":"I could not find the answer to this on reddit, stackoverflow, anywhere. Adding 'pause' to the args in any combination did not work, and there were some VERY advanced explanations that involved tying another Python process to the command window, logging the process instead, etc.\n\n\nAfter some time spent grinding, I found it. I thought I'd save someone else some time.\n\n\nsubprocess.Popen([\"start\", \"cmd\", \"/k\", \"your_external_executable_path_here\", \"your_exe_params_here\"], shell=True]\n\nThis will launch the subprocess in a command prompt and will return to command prompt at the end of execution. It will stay open. So you can actually read what was printed out and not have the window disappear afterwards.","link":"https://www.reddit.com/r/Python/comments/11talaa/how_to_keep_a_command_prompt_window_open_after/","created":"2023-03-16","tags":["reddit","python"],"meta":{"num_comments":3}}
{"title":"Export geopandas df to .geojson","description":"Hey guys,\ncan someone help me with exporting a geopandas dataframe to a .geojson? \n\nEvery example I’ve seen so far didn’t work for me","link":"https://www.reddit.com/r/Python/comments/11t8ebh/export_geopandas_df_to_geojson/","created":"2023-03-16","tags":["reddit","python"],"meta":{"num_comments":4}}
