{"title":"deepmind's ai vision","description":"hey i've been looking at this paper from deepmind [https://arxiv.org/pdf/1807.01281.pdf](https://arxiv.org/pdf/1807.01281.pdf) where they train agents to play capture the flag based off of only visual input. what i'm curious about is are there any tricks going on here? Is the ai looking at a \"screen\" the same way a human would and then encodes it's observations after? or is it just looking at a grid of numbers?","link":"https://www.reddit.com/r/deeplearning/comments/10pwpcu/deepminds_ai_vision/","created":"2023-01-31","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"Best practice for capping a softmax","description":"I'd like to train a neural network where the softmax output has a minimum possible probability. During training, none of the probabilities should go below this minimum. Basically I want to avoid the logits from becoming too different from each other so that none of the output categories are ever completely excluded in a prediction, a sort of smoothing. What's the best way to do this during training?","link":"https://www.reddit.com/r/deeplearning/comments/10puvih/best_practice_for_capping_a_softmax/","created":"2023-01-31","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":12}}
{"title":"Looking for a learning peer...","description":"Hi,\n\nI started the journey of deep learning in about 2 months ago.\n\nWas looking for some peer on learning this beautiful beasty.\n\nI think this kind of learning is more effective than solo learning. This way we define some problems and try to find solutions and ideas for them each other. That's very better I would say than doing these things alone.\n\nWe can do things like, solving problems together, participating in various contests, helping each other to understand things, sharing w/ each other our resources, etc etc.\n\nI'm currently learning based on Hands On ML book chapters.\n\nWanna join me? DM me :)","link":"https://www.reddit.com/r/deeplearning/comments/10pzh0j/looking_for_a_learning_peer/","created":"2023-01-31","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"testing pre trained models","description":" hello  everyone, I'm a beginner working on object detection, I tried different  pre-trained DL models to get predictions, and to compare them I need to  test them using mAP and other metrics, but I have no idea how can u  guys give me a code example?","link":"https://www.reddit.com/r/deeplearning/comments/10pwsfg/testing_pre_trained_models/","created":"2023-01-31","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"I am using MTCNN to detect face in an image, FACENET to extract and save features from each detected face and OpenCV Gaussian Blur filter to mask the detected faces. My end goal is to find a target face in the masked image using saved features and unmask target face only. Any idea or advice ?","description":"","link":"https://www.reddit.com/gallery/10osw3f","created":"2023-01-31","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":1}}
{"title":"[D] Patenting Research Papers?","description":"As a fan of AutoML, I was reading some notorious papers on the subject, and noticed that one author in particular Barret Zoph, arguable one of the founding fathers of AutoML in deep learning, patents his research papers...\n\n[https://patents.justia.com/inventor/barret-zoph](https://patents.justia.com/inventor/barret-zoph)\n\n[https://scholar.google.com.tr/citations?hl=tr&amp;user=NL\\_7iTwAAAAJ&amp;view\\_op=list\\_works](https://scholar.google.com.tr/citations?hl=tr&amp;user=NL_7iTwAAAAJ&amp;view_op=list_works) (crl-f search US Patent App on the page)\n\nWhat would be the reason to patent research papers? Especially if the paper you're presenting literally details the thing that you presenting... with code...","link":"https://www.reddit.com/r/deeplearning/comments/10pfcmh/d_patenting_research_papers/","created":"2023-01-30","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":1}}
{"title":"How can I start to study Deep learning?","description":"","link":"https://www.reddit.com/r/deeplearning/comments/10odzhd/how_can_i_start_to_study_deep_learning/","created":"2023-01-29","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":14}}
{"title":"How to evaluate the F1 score values from LightGBM","description":"I am applying LightGBM for a prediction task, and I would like to understand how good / bad my model is. From what I understood, usually F1 scores below 0.5 are considered bad. Does anyone have a good reference for this? Thanksgood/bad","link":"https://www.reddit.com/r/deeplearning/comments/10ow3ec/how_to_evaluate_the_f1_score_values_from_lightgbm/","created":"2023-01-30","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":2}}
{"title":"Why did the original ResNet paper not use dropout?","description":"The ResNet paper by Kaiming He et al. does not use dropout for the models. A lot of models prior to ResNets, such as AlexNet and VGGNet gained from using dropout.\n\nWhy did the authors choose not to use dropout for ResNets ? Is it because they use L2 regularization(weight decay) and batch normalization which are forms of regularization which can substitute dropout regularization ?","link":"https://www.reddit.com/r/deeplearning/comments/10ol7g6/why_did_the_original_resnet_paper_not_use_dropout/","created":"2023-01-29","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":7}}
{"title":"If anyone know answer of my question, please tell me","description":"so, I have been learning what DL is and how NN learns to do stuff. From what I understand is the repeated iteration will take random weights and at some point those weights will be kinda perfect for the given task (plz correct me if i'm wrong)\n\nOk, so lets take an example of a task like path finding AI, so we make a NN and train it to go from point A to point B, now it is trained and doing nice and goes to point b perfectly, SO here the weights are set to go from point A to point B right?\n\nWhat if we give the point B somewhere else, How will the AI get perfect weights as the current weights are only perfect for current point B\n\nWhat if we put an obstacle in between point A and B, how will the NN set weights, or is it something like a range of weights which are perfect for any given task for NN\n\n&amp;#x200B;\n\nIDK if I explained it right, plz comment if you have question about my question, and answer also💕","link":"https://www.reddit.com/r/deeplearning/comments/10ohqyw/if_anyone_know_answer_of_my_question_please_tell/","created":"2023-01-29","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":6}}
{"title":"[Project] Classifier using Transformer's Encoder written in Pytorch","description":"Hi fellow Redditors,\n\nI want to share my piece of code with you guys\n\n[https://github.com/maqboolkhan/Transformer\\_classifier\\_pytorch](https://github.com/maqboolkhan/Transformer_classifier_pytorch)\n\nThe notebook is heavily commented on with tensor's shape and a possible explanation of the logic. I believe this repository might help someone understand how to exploit the Encoder block of the Transformer. \n\nIt is my first post on Reddit :) .\n\nStars, comments, and discussion are welcome and very much appreciated.\n\nThanks","link":"https://www.reddit.com/r/deeplearning/comments/10o50wn/project_classifier_using_transformers_encoder/","created":"2023-01-29","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":0}}
{"title":"[Project] Lanytek Audio2Midi Transcription Service","description":"Hello everyone! \n\nWe're excited to introduce our audio2midi transcription service, which transforms music audio into an instrumental midi file and a pdf music sheet. we're providing \\~200 requests per month for free. \n\nIf you're interested, give it a try and see what it can do for you!\n\n[https://rapidapi.com/JC1DA/api/lanytek-audio2midi](https://rapidapi.com/JC1DA/api/lanytek-audio2midi)","link":"https://www.reddit.com/r/deeplearning/comments/10o4jd4/project_lanytek_audio2midi_transcription_service/","created":"2023-01-29","tags":["ml","deeplearning","reddit"],"meta":{"num_comments":1}}
