{"title":"Is there a database of words grouped by their class/category?","description":"Forgive me, I'm new to this field and don't know how to say it precisely, but I'm looking for a database in which you can lookup a word and get sets related words based on specific functional categories. For example:\n\n- searching \"east\" would return a category of \"cardinal directions\" and the related words \"north\", \"south\", \"west\"\n- searching \"now\" would return \"temporal proximity\" which might have \"soon\", \"later\", \"never\", etc.\n\nI've tried various thesauruses but they only give words of either similar or opposite meaning. They won't give you \"north\" if you search \"east\". Does such a database exist?","link":"https://www.reddit.com/r/LanguageTechnology/comments/10pr8n1/is_there_a_database_of_words_grouped_by_their/","created":"2023-01-31","tags":["languagetechnology","reddit","ml"],"meta":{"num_comments":4}}
{"title":"How to determine how many layers of a transformer model to freeze when fine-tuning?","description":"I frequently read about how people freeze e.g,. all layers except for the 2 top layers when fine-tuning a pretrained model on a downstream task. Is there some literature that could provide some guidance on the topic, since the choice seems arbitrary at first glance? Thanks","link":"https://www.reddit.com/r/LanguageTechnology/comments/10pi16y/how_to_determine_how_many_layers_of_a_transformer/","created":"2023-01-31","tags":["languagetechnology","reddit","ml"],"meta":{"num_comments":8}}
{"title":"MusicLM Text to Music AI Google Research","description":"MusicLM is a model generating high-fidelity music from text descriptions such as \"a calming violin melody backed by a distorted guitar riff\". MusicLM casts the process of conditional music generation as a hierarchical sequence-to-sequence modeling task, and it generates music at 24 kHz that remains consistent over several minutes. MusicLM can be conditioned on both text and a melody in that it can transform whistled and hummed melodies according to the style described in a text caption.\n\nIn this short video i explain the model behind MusicLM. Do checkout \nhttps://youtu.be/8rofGhGJmgY","link":"https://www.reddit.com/r/LanguageTechnology/comments/10ppmou/musiclm_text_to_music_ai_google_research/","created":"2023-01-31","tags":["languagetechnology","reddit","ml"],"meta":{"num_comments":0}}
{"title":"ContrastiveLoss vs CosineSimilarityLoss in Sentence Transformers","description":"I'm looking at loss-functions for Sentence Transformers on https://www.sbert.net/docs/package_reference/losses.html, and was wondering if `ContrastiveLoss` has ANY advantage over `CosineSimilarityLoss`, apart from that in most cases, it would be easier to find training data with distinct (binary) labels instead of fuzzy (continuous) class membership?","link":"https://www.reddit.com/r/LanguageTechnology/comments/10phk0i/contrastiveloss_vs_cosinesimilarityloss_in/","created":"2023-01-31","tags":["languagetechnology","reddit","ml"],"meta":{"num_comments":1}}
{"title":"How Is Netflix and Other Streaming Platforms Changing the Way People Watch Movies in India ?","description":"The advent of OTT platforms has revolutionized the way Hindi-speaking audiences watch movies. From streaming high-quality content to providing personalized recommendations, these platforms are providing an enhanced movie experience for viewers.","link":"https://www.reddit.com/r/LanguageTechnology/comments/10pp6q4/how_is_netflix_and_other_streaming_platforms/","created":"2023-01-31","tags":["languagetechnology","reddit","ml"],"meta":{"num_comments":0}}
{"title":"Need help with hierarchical classification","description":"Hello there! \nLet’s say I have texts (avg word count = 50) and I have to classify them into three levels of labels with 10 labels on each level (1000 classes in total). I’ve found a few solutions: \n1) label-tree can be represented as label-chains so that  it’s simply becomes 1000 different classes and you just build one classifier. \n2) build classifier for each node and make pipeline to get all level labels\n\nFirst approach is not solution for me because I have huge disbalance issue with my classes. Moreover, classes may overlap (one text may belong to several classes).\nI have built classifier according to the second approach and it works fine, but I still have some problems with class overlapping. \n\nHow to build a multi label hierarchical classifier? if I continue to create the classifier system according to the second approach, the system will become very complex. Is there an easier way to solve that problem?\n\nAnother question I have - what label tool should I use for hierarchical classification? I couldn't find such a tool that supports nested lists.","link":"https://www.reddit.com/r/LanguageTechnology/comments/10p4yrq/need_help_with_hierarchical_classification/","created":"2023-01-30","tags":["languagetechnology","reddit","ml"],"meta":{"num_comments":0}}
{"title":"Easily Build Your Own GPT from Scratch using AWS: A Comprehensive Guide for Domain Adaptation","description":"🔥🤖Get ready to train your own GPT-2 model from scratch using AWS SageMaker!🤖🔥\n\nThis comprehensive guide will take you through the entire process of creating a custom-built GPT-2 model, tailored to your specific domain or industry. 💻\n\nYou'll learn how to acquire and prepare raw data, create custom vocabularies and tokenizers, pre-train large language models, and evaluate the performance of your custom model. 📈\n\nNot only that, but you'll also delve into the intricacies of training a GPT-2 model to generate cohesive news articles related to the COVID-19 pandemic! 🦠\n\nAnd the best part? It comes with 9 Jupyter notebooks and all the necessary Python scripts to help you get started right away! 🚀\n\nYou'll also gain a solid understanding of key concepts like generative AI, foundational models, language alignment, and prompt engineering with a focus on GPT. 💡 [https://tinyurl.com/hvrjkm5r](https://tinyurl.com/hvrjkm5r)","link":"https://www.reddit.com/r/LanguageTechnology/comments/10ohy1m/easily_build_your_own_gpt_from_scratch_using_aws/","created":"2023-01-29","tags":["languagetechnology","reddit","ml"],"meta":{"num_comments":5}}
{"title":"ML developments in measuring text readability and text summarization","description":"I'm curious whether there are any significant developments in measuring text readability using ML, e.g. transformers. I see that many people still rely on simpler measures (like fog index), because they are easier to calculate and explain. Are there ML models that consistently provide improvement over existing measures? \n\n&amp;#x200B;\n\nSimilarly, I'm curious about text summarization, which probably is more ML reliant. I get two texts (each contains 1000 words). I want to summarize them without losing content, not to a certain level (both summaries of 500 words). So one summary might be 400 words long, another 800 words long. Is anything like this possible?","link":"https://www.reddit.com/r/LanguageTechnology/comments/10oj1d7/ml_developments_in_measuring_text_readability_and/","created":"2023-01-29","tags":["languagetechnology","reddit","ml"],"meta":{"num_comments":3}}
{"title":"[D] Combining results from multiple test dataset","description":"Hello all! \nI'm working on a project building multi class text classifier. As a part of it I'm required to evaluate my machine learning model on different sets of test data. Consider each test data represents a different section/location. \n\nHowever, we want to present a single metric combining the results on all of these location through aggregation. The location specific test data can be of different size and different label distribution. Right now, we average the result obtained for each location. For example final result = average ( acc of location 1 + acc of loc 2 + acc of loc 3)\nAcc - accuracy. \n\nIs there any other way to reflect the dataset size and label distribution while combining results from multiple test data?","link":"https://www.reddit.com/r/LanguageTechnology/comments/10oncpq/d_combining_results_from_multiple_test_dataset/","created":"2023-01-30","tags":["languagetechnology","reddit","ml"],"meta":{"num_comments":1}}
{"title":"looking for opportunities in NLP","description":"Hi everybody! I'm going to finish my MSc and an internship in Data Science and I am willing to gain experience in NLP. I'm looking for open-source projects to work with in part -time, since I have a full time job as a high school teacher. Do you need where to find some startup/projects?\n\nThank you in advance","link":"https://www.reddit.com/r/LanguageTechnology/comments/10o63nr/looking_for_opportunities_in_nlp/","created":"2023-01-29","tags":["languagetechnology","reddit","ml"],"meta":{"num_comments":1}}
