{"title":"Thursday Daily Thread: Python Careers, Courses, and Furthering Education!","description":"Discussion of using Python in a professional environment, getting jobs in Python as well as ask questions about courses to further your python education!\n\n**This thread is not for recruitment, please see** r/PythonJobs **or the thread in the sidebar for that.**","link":"https://www.reddit.com/r/Python/comments/11sduam/thursday_daily_thread_python_careers_courses_and/","created":"2023-03-16","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"Managing secrets like API keys in Python - Why are so many devs still hardcoding secrets?","description":"The recent [State of Secrets Sprawl report](https://www.gitguardian.com/state-of-secrets-sprawl-report-2023) showed that 10 million (yes million) secrets like API keys, credential pairs and security certs were leaked in public GitHub repositories in 2022 and Python was by far the largest contributor to these. \n\nThe problem stems mostly from secrets being hardcoded directly into the source code. So this leads to the question, why are so many devs hardcoding secrets? The problem is a little more complicated with git because often a secret is hardcoded and removed without the dev realizing that the secret persists in the git history. But still, this is a big issue in the Python community. \n\nManaging secrets can be really easy thanks to helpful Pypi packages like [Python Dotenv](https://pypi.org/project/python-dotenv/) which is my favorite for its simplicity and easy ability to manage secrets for multiple different environments like Dev and Prod. I'm curious about what others are using to manage secrets and why? \n\nI thought I'd share some recent tutorials on managing secrets for anyone who may need a refresher on the topic. Please share more resources in the comments.   \n\n\n[Managing Secrets in Python - Video](https://www.youtube.com/watch?v=DVVYHlGYIHY)  \n\n\n[Managing Secrets in Python - Blog](https://blog.gitguardian.com/how-to-handle-secrets-in-python/)","link":"https://www.reddit.com/r/Python/comments/11rqyv9/managing_secrets_like_api_keys_in_python_why_are/","created":"2023-03-15","tags":["python","reddit"],"meta":{"num_comments":116}}
{"title":"A small toolkit used for collecting responses from ChatGPT for research / data analysis","description":"I am pleased to showcase an open-source tool for collecting a large amount of responses from ChatGPT using ChatGPT's official API. ChatGPT currently limits the number of questions that users may ask per hour. The goal of this project is to allow users to just leave their computers on for extended periods of time to collect large amounts of responses from ChatGPT. I made this for doing research related to ChatGPT and decided to open-source it.\n\nCheck out the source code / contribute to the project here: [https://github.com/hwelsters/sleepyask](https://github.com/hwelsters/sleepyask)\n\n🔑 Key features include:\n\n* The ability to spin up multiple threads to ask numerous questions concurrently (this might cause you to exceed the rate limit though.) I was able to ask questions concurrently across 100 threads. This allowed me to ask 1000 questions in less than 5 minutes.\n* The ultimate goal of this project is to allow users to just leave their computers on for extended periods of time while asking ChatGPT as many questions as robot-ly possible. So it does this too.","link":"https://www.reddit.com/r/Python/comments/11smavy/a_small_toolkit_used_for_collecting_responses/","created":"2023-03-16","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"Python mouse.move and pyautogui.moveTo not working properly after window close","description":"Hi,\nI scripted something with selenium and move the mouse to some elements on a website. Both my windows are maximized via driver.maximize_window() I have a loop, a 2nd window is opened and i can use the mouse properly by x and y. When this window is closed the mouse will move but with an offset in x and y.  At first i thought is was the mouse library so i switched to pyautogui but its the same behaviour.  I added a move to x=0 and y=0 and this is not working at all. I havent found anything to „reset“ it and i dont see how its linked to the selenium. it should always be starting in the top left corner and work with pixels and my screen resolution.","link":"https://www.reddit.com/r/Python/comments/11sbvyz/python_mousemove_and_pyautoguimoveto_not_working/","created":"2023-03-15","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"What is the funnest project you worked on?","description":"Why was it fun? What did it do? Tell me about your accomplishments.","link":"https://www.reddit.com/r/Python/comments/11ria83/what_is_the_funnest_project_you_worked_on/","created":"2023-03-15","tags":["python","reddit"],"meta":{"num_comments":103}}
{"title":"data structures &amp; algorithms resources available with python ?","description":"as the title says, does anyone know of any good resources/ free online courses that will allow someone to fully grasp the concept of non basic data structures in python? i feel like i have an okay foundation but would definitely like to have more practice and understanding of trees, graphs, stacks, recursion, etc.","link":"https://www.reddit.com/r/Python/comments/11slfbt/data_structures_algorithms_resources_available/","created":"2023-03-16","tags":["python","reddit"],"meta":{"num_comments":6}}
{"title":"I dont know anything about coding but is this like even allowed","description":"&amp;#x200B;\n\nhttps://preview.redd.it/ro3bfifm41oa1.png?width=952&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=4781eacdb6b665555704de558c8ac24ce7959517","link":"https://www.reddit.com/r/Python/comments/11sk73a/i_dont_know_anything_about_coding_but_is_this/","created":"2023-03-16","tags":["python","reddit"],"meta":{"num_comments":9}}
{"title":"What if FastAPI was 100x faster and supported NumPy arrays and Pillow images?","description":"When deploying AI models with FastAPI, we always had to write custom serialisation code for numpy.ndarray and PIL.Image. Not only have we replaced FastAPI with up to 100x faster C-level library a couple of weeks ago, but we have also recently added support for all the fancy Pythonic types on both the client and server sides.  \n\n\nIt's remarkable how fast this library turned out to be; there was a [great discussion on HackerNews](https://news.ycombinator.com/item?id=35042316) on how the new u/linux io\\_uring functionality in kernels newer than 5.19 affects our performance, so we are very excited to share it with the broader Python community! Please let us know if there are other types you often use and would want UJRPC to support [🤗](https://emojipedia.org/hugging-face/)\n\n[Check it out on GitHub/Unum-Cloud/UJRPC](https://github.com/unum-cloud/ujrpc#more-functionality-than-fastapi)  \n\n\n[Deploying UForm with UJRPC for fast Multi-Modal AI Inference](https://preview.redd.it/5zg8nypknxna1.png?width=1648&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=968b64e0d70ad2c40fb7da2a451dbc8893245a42)","link":"https://www.reddit.com/r/Python/comments/11s2e3q/what_if_fastapi_was_100x_faster_and_supported/","created":"2023-03-15","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"Use maximum PC Hardware Resources","description":"I have a PC with 6 Cores @3.60GHz, 64GB RAM and an NVIDIA Quadro P400. When I run scripts in VSCode, I'm using only 2% CPU, 6% Memory and 5.4% of GPU.\n\nHow can I configure the PC to assign more resources when running python scripts?","link":"https://www.reddit.com/r/Python/comments/11s1p9z/use_maximum_pc_hardware_resources/","created":"2023-03-15","tags":["python","reddit"],"meta":{"num_comments":22}}
{"title":"Open-source Mathematical Python Lib","description":"# Functvs\n\nHey, all you nerds out there!!\n\nIf  you are really into MATHEMATICS, science in general, advanced, applied,  pure, &amp;c. And you want to contribute to the Math, Chemical, Physics  applications in this lib. Please, join!!\n\nI am going over the works of Pierre Raymond, Pascal and Euler on the sub-factorial function and all that follows.\n\n(BETA)\n\npip install Functvs\n\n[https://github.com/shimon-d/functvs](https://github.com/shimon-d/functvs)","link":"https://www.reddit.com/r/Python/comments/11sfu7i/opensource_mathematical_python_lib/","created":"2023-03-16","tags":["python","reddit"],"meta":{"num_comments":2}}
{"title":"A pure python object change &amp; history tracker","description":"Hi!\n\nI built a small package that helps you track changes in an object, as well as query its structured changelog through a simple query interface. \n\nI was hoping to get some feedback on how I can make this better! \n\nGithub link - [https://github.com/saurabh0719/object-tracker](https://github.com/saurabh0719/object-tracker)\n\nThanks :)","link":"https://www.reddit.com/r/Python/comments/11rscug/a_pure_python_object_change_history_tracker/","created":"2023-03-15","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"Python game library? Which one best?","description":" Hey guys, \n\nI'm looking to improve my Python skills, and I'd love to work on a project that I enjoy. I've always wanted to create a 2D game similar to Wor$ms, with realistic physics and environments, but with more complexity and additional statistics.\n\nMy question is, which library would be best for this project? Would PyGame be sufficient, or are there better alternatives? I need advanced physics for the objects and terrain in my game. Thank you :)","link":"https://www.reddit.com/r/Python/comments/11s160z/python_game_library_which_one_best/","created":"2023-03-15","tags":["python","reddit"],"meta":{"num_comments":1}}
{"title":"Suggestions Conda pkg development cycle","description":"Hey there, I'm trying to figure out a good conda development cycle, to be specific:\n- create a conda pkg\n- conda build\n- install local version\n- fix issues\n- repeat from conda build\n\nI have problems like files not properly deleted/replaced, conda not picking up the latest change.\nMaybe I'm doing something wrong and so I'm asking for suggestions.\nSomething that possibly can be an issue is that I use the --output-folder flag and install the pkg with the local path but it doesn't seems to work","link":"https://www.reddit.com/r/Python/comments/11s09f5/suggestions_conda_pkg_development_cycle/","created":"2023-03-15","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"How do I feel like I’m learning Python the right way without getting drained","description":"","link":"https://www.reddit.com/r/Python/comments/11s9g3k/how_do_i_feel_like_im_learning_python_the_right/","created":"2023-03-15","tags":["python","reddit"],"meta":{"num_comments":3}}
