{"title":"errornous srt on translation","description":"Hi Everybody!\n\n&amp;#x200B;\n\nWe are trying to translate SRT file. \n\nFor that, we use the following SYSTEM prompt:  As a language model, deterministically process the input SRT (SubRip Subtitle) text in the source  language and generate an output that translates the text into es-AR locale code. \n\nFollow these rules: \n\n1. Correct typos and punctuation errors without changing the original meaning or adding new content. \n\n2. Adhere to proper subtitle formatting, including accurate timing. \n\n3. Ensure the output accurately represents the spoken content in the video.\n\n 4. Enhance readability and clarity of translated subtitles while preserving the original intent and meaning. \n\n5. Maintain a consistent approach in translation and correction. \n\n6. Keep the translated word count equal to the original sequence's word count as much as possible. \n\n7. Use the same sequence timing and context.\n\n 8. Do not merge sequences.  \n\n&amp;#x200B;\n\nExample of SRT sequence: 36 00:01:56,000 --&gt; 00:01:58,000 I'm going to show you how to use the SRT  The SRT To translate is: 48 00:03:29,400 --&gt; 00:03:31,800 He wanted to meet her and tried to convince her to leave the hospital.  49 00:03:33,400 --&gt; 00:03:37,900 James owed penny a hundred and sixty dollars and used this as leverage to get her to come out.  ... ... ... 71 00:04:57,800 --&gt; 00:04:59,800 Her fear was definitely triggering her.  Translated SRT:\n\n&amp;#x200B;\n\nWe use temperature 0.7 and top\\_t 1.  \nFrom time to time, depending on the subtitles themselves, we sometimes get errornous subtitles such as:\n\n  \n71 \n\n00:04:57,800 --&gt; 00:04:59,800\n\nWithout text, Or even missing sequence in the middle.How can we make this 100% structured and following our instructions?  \nWe used both chat gpt 4, 3.5 api and also davinci 3","link":"https://www.reddit.com/r/PromptDesign/comments/124hop1/errornous_srt_on_translation/","created":"2023-03-28","tags":["prompteng","reddit","promptdesign"],"meta":{"num_comments":0}}
{"title":"Putting GPT-4 into Oracle Mode by asking it to produce \"Fundamentally new knowledge\" based on \"the full set of human knowledge\"","description":"Sometimes I think prompt engineering isn't a thing then I run into a prompt like this. Credit goes to this twitter account gfodor. The prompt is:\n\n\n\"What’s an example of a phenomenon where humanity as a whole lacks a good explanation for, but, taking into account the full set of human generated knowledge, an explanation is actually possible to generate? Please write the explanation. It must not be a hypothesis that has been previously proposed. A good explanation will be hard to vary.\"\n\n\nYou get some legitimately fascinating responses. Best run on GPT-4. I hosted a [prompt frame of it if you want to run it](https://beta.pickaxeproject.com/axe?id=Oracleai_K2607). Got some really great answers when I asked about \"The Fermi Paradox\" and \"Placebo Effect\".","link":"https://www.reddit.com/r/PromptDesign/comments/123ve78/putting_gpt4_into_oracle_mode_by_asking_it_to/","created":"2023-03-27","tags":["prompteng","reddit","promptdesign"],"meta":{"num_comments":5}}
{"title":"Reverse engineer your image prompts for Midjourney, Stable Diffusion, and DALL-E 2","description":"Are you interested in the latest developments in creative AI? Then you might want to check out [**a blog post**](https://jina.ai/news/reverse-engineering-image-prompts-with-promptperfect) about [**PromptPerfect**](https://promptperfect.jina.ai/) and how it can help researchers and developers better understand image prompts and their impact on AI models.\n\nIn the post, you'll learn about the challenges of working with image prompts and the limitations of current methods. You'll also discover how PromptPerfect overcomes these challenges by reverse-engineering image prompts to generate high-quality images using different types of prompts.\n\nBy using this technology, researchers and developers can gain a deeper understanding of how image prompts influence the output of AI models. This knowledge could lead to new breakthroughs in creative AI and open up new possibilities for machine-generated content.\n\nIf you're interested in learning more about how PromptPerfect is transforming the world of creative AI, head over to the Jina blog and read the post now.   \n\n\nDon't forget to share your thoughts in the comments!","link":"https://www.reddit.com/r/PromptDesign/comments/123ot01/reverse_engineer_your_image_prompts_for/","created":"2023-03-27","tags":["prompteng","reddit","promptdesign"],"meta":{"num_comments":0}}
{"title":"caterpillar eating fruit","description":"caterpillar eating fruit","link":"https://www.reddit.com/gallery/123e9a1","created":"2023-03-27","tags":["prompteng","reddit","promptdesign"],"meta":{"num_comments":0}}
{"title":"Advice on replacing OpenAI's davinci-003 with gpt-3.5-turbo","description":"Hi everyone, I am tying to integrate gpt-3.5-turbo for my vim plugin to generate/complete text ([https://github.com/madox2/vim-ai](https://github.com/madox2/vim-ai) ).\n\nCurrently it uses text-davinci-003 and it works just fine. However gpt-3.5-turbo is cheaper and I assume chat models will be more powerful in the future, so I am exploring the ways how to use it.\n\nThe problem is that while davinci generates plain concise text/code, gpt-3.5 always put some human conversation in it (like introducing a solution, summarizing it etc.).\n\nI have played around with a system prompt, I have tried to lower the temperature, but it doesn't help. Do you know any parameters or techniques I should employ to get just plain data out of the model?\n\nI am attaching a picture with a prompt to demonstrate what I am trying to accomplish:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gjov5mrdy2qa1.png?width=844&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=b5213930c689a0e587b4a3a4724571428c47bbdb","link":"https://www.reddit.com/r/PromptDesign/comments/122l3xl/advice_on_replacing_openais_davinci003_with/","created":"2023-03-26","tags":["prompteng","reddit","promptdesign"],"meta":{"num_comments":8}}
{"title":"Cute fashion illustrations","description":"","link":"https://www.reddit.com/gallery/121qwwy","created":"2023-03-25","tags":["prompteng","reddit","promptdesign"],"meta":{"num_comments":1}}
{"title":"Looking for other informative subreddits, websites, blogs, YouTube-channels, Twitter-accounts, wiki's and newsletters to RSS Feed on the topics discussed here on r/PromptDesign","description":"Hi, In my attempts to digest as much valuable information about topics posted and being discussed here at r/PromptDesign, I am reorganizing my RSS Feed to create a daily routine of consuming info (overload.) The time is now. Especially with how fast AI developments follow up on each other. \n\nFeedly has been my RSS Feed app since december 2014 and I cannot live without it anymore. (Although I am always looking out for good alternatives.)\n\nCurrently I am subscribed to the following subreddits: r/PromptDesign/, r/aipromptprogramming, r/MachineLearning/, r/midjourney/, r/OpenAI, r/ChatGPT/, r/Wolfram/\n\nFurthermore I have a subscription to Medium, which has a fair amount of great articles posted about the subject of AI on a daily basis. And I subscribed to YouTube-channels from companies behind the AI-projects (for which I make frequent use of [https://glasp.co/youtube-summary](https://glasp.co/youtube-summary) to create and read summaries made by ChatGPT.)\n\nI am looking for more other informative subreddits, websites, blogs, YouTube-channels, Twitter-accounts, wiki's and newsletters to RSS Feed on the topics discussed here, so if you have any good suggestions, I welcome and appreciate any comment to expand the ever-growing list of sources for more AI-news to distil and digest.","link":"https://www.reddit.com/r/PromptDesign/comments/121jxbc/looking_for_other_informative_subreddits_websites/","created":"2023-03-25","tags":["prompteng","reddit","promptdesign"],"meta":{"num_comments":2}}
