{"title":"Sunday Daily Thread: What's everyone working on this week?","description":"Tell /r/python what you're working on this week! You can be bragging, grousing, sharing your passion, or explaining your pain. Talk about your current project or your pet project; whatever you want to share.","link":"https://www.reddit.com/r/Python/comments/12244qx/sunday_daily_thread_whats_everyone_working_on/","created":"2023-03-26","tags":["reddit","python"],"meta":{"num_comments":11}}
{"title":"Tuesday Daily Thread: Advanced questions","description":"Have some burning questions on advanced Python topics? Use this thread to ask more advanced questions related to Python.\n\n**If your question is a beginner question we hold a beginner Daily Thread tomorrow (Wednesday) where you can ask any question! We may remove questions here and ask you to resubmit tomorrow.**\n\nThis thread may be fairly low volume in replies, if you don't receive a response we recommend looking at r/LearnPython or joining the Python Discord server at [https://discord.gg/python](https://discord.gg/python) where you stand a better chance of receiving a response.","link":"https://www.reddit.com/r/Python/comments/1245s9e/tuesday_daily_thread_advanced_questions/","created":"2023-03-28","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"Hikaru 1.0.0 released","description":"Hikaru provides a variety of tooling to work with Kubernetes configs in Python, YAML, or JSON, allowing you to move smoothly between each of these representations, and can also use the Python representation to directly interact with Kubernetes. Hikaru helps you migrate from YAML, easily create watches, detect changes in configuration, create CRDs and their controllers, and more. You can find out more Hikaru here at the PyPI page:\n\n[https://pypi.org/project/hikaru/](https://pypi.org/project/hikaru/)\n\n...at the Github repo:\n\n[https://github.com/haxsaw/hikaru](https://github.com/haxsaw/hikaru)\n\n...or read the full doc at ReadTheDocs:\n\n[https://hikaru.readthedocs.io/en/latest/index.html](https://hikaru.readthedocs.io/en/latest/index.html)\n\nHikaru 1.0.0 adds support for custom resource definitions. Hikaru now supports:\n\n* The ability to define the structure of a CRD with Hikaru classes, either from scratch or to mimic one that is already in your environment,\n* Sending the defintition into Kubernetes where it will be established as a CRD managed by K8s,\n* Managing instances of the new CRD using CRUD methods,\n* Establishing Watchers on the new CRD to in order to monitor activity or create controllers in Python, and\n* The use of CRD classes as context managers, just like other Hikaru document classes.\n\nThis all works smoothly with the existing Hikaru features. Full documentation for these new features can be found in the \"Advanced Topics\" section of the Hikaru docs.\n\nThis release still contains support for the same set of Kubernetes releases, 23.x through 26.x.","link":"https://www.reddit.com/r/Python/comments/123sqzs/hikaru_100_released/","created":"2023-03-27","tags":["reddit","python"],"meta":{"num_comments":20}}
{"title":"Debugging script without any documentation","description":"Hi,\n\nI just landed my first job as a programmer (yay), and one of my assignments is to maintain some scripts a guy from IT created in python.\n\nSo the things is - the guy from IT created the scripts without any comments or any other sort of documentation and it's like 300 lines of compact code with functions calling other functions which again calls other functions.  \nIts mainly datajuggling in Pandas and honestly the dataframes are a mess.\n\nDo you guys have any good advice for a newbie in regards to debugging such files?","link":"https://www.reddit.com/r/Python/comments/123yxks/debugging_script_without_any_documentation/","created":"2023-03-27","tags":["reddit","python"],"meta":{"num_comments":38}}
{"title":"Anyone else attending PyCon Italy?","description":"Hey fellow Pythonistas!\n\nI was just wondering if any of you are planning to attend PyCon Italy this year? I've heard great things about the conference and I'm really excited to be a part of it for the first time.\n\nI'd love to hear your thoughts and experiences, especially from those who have been there before. What do you enjoy the most about the event? Are there any must-attend talks or workshops that you would recommend? And, of course, if you're going this year, it would be awesome to meet some fellow Redditors and make new connections!\n\nFeel free to share any tips and advice for getting the most out of the conference. \n\nSee you there! 🐍✨","link":"https://www.reddit.com/r/Python/comments/124j59n/anyone_else_attending_pycon_italy/","created":"2023-03-28","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"The beginner questions man…","description":"Asking people to read a single sentence of the sub description is clearly too much…\nWhat would really hit the spot would be a sort of pre-commit hook on posting with an LLM judging the authors proficiency.\nIf less than 3 days of experience: auto redirect to r/learnpython or better yet stackoverflow.\n\nHow are people entitled enough to think that others want to solve their homework for them in their free time?","link":"https://www.reddit.com/r/Python/comments/124iqa9/the_beginner_questions_man/","created":"2023-03-28","tags":["reddit","python"],"meta":{"num_comments":2}}
{"title":"Building A Custom Geocoding Service With Autocomplete Using Python, PostGIS, And OpenLayers For Address Lookup","description":"&amp;#x200B;\n\n[Building A Custom Geocoding Service With Autocomplete Using Python, PostGIS, And OpenLayers For Address Lookup](https://i.redd.it/b0itqclauaqa1.gif)\n\n[Building A Custom Geocoding Service With Autocomplete Using Python, PostGIS, And OpenLayers For Address Lookup](https://spatial-dev.guru/2023/03/15/building-a-custom-geocoding-service-with-autocomplete-using-python-postgis-and-openlayers-for-address-lookup/)","link":"https://www.reddit.com/r/Python/comments/123q5pt/building_a_custom_geocoding_service_with/","created":"2023-03-27","tags":["reddit","python"],"meta":{"num_comments":4}}
{"title":"Seeking early feedback on MegaMock - a dev experience upgrade to mocking","description":"Hello! I've been working on a project called [MegaMock](https://github.com/JamesHutchison/megamock) that upgrades the developer experience when working with mocks! Some of the key features:\n\n* You pass in objects and functions, not strings, so IDE tools like \"rename\", \"go to definition\", \"find references\", etc will work seamlessly\n* When you pass in an object as a spec, it's automatically auto-speced.\n* When you use patch, all locations are patched, so you don't need to worry about how the object was imported in the module that uses the thing in question.\n* The generated types are a union of the mock and the type, so auto-complete is available via the IDE\n* If you mock out a class entirely, you can restore the real logic for certain methods, as demonstrated in the image below.\n\n&amp;#x200B;\n\nhttps://i.redd.it/wpit0m2xddqa1.gif\n\nDespite working on this for a while, I know there are still gaps in functionality, but I'm putting this out here to get an idea if things are moving in the right direction. Input and feedback is highly appreciated, let me know the first thing to give you an issue, and whether the documentation is clear enough.\n\nIf anyone is interested in helping me maintain the project, just let me know.\n\nIf you find problems, feel free to create an issue.\n\nThanks!\n\n[https://github.com/JamesHutchison/megamock](https://github.com/JamesHutchison/megamock)","link":"https://www.reddit.com/r/Python/comments/1245ugm/seeking_early_feedback_on_megamock_a_dev/","created":"2023-03-28","tags":["reddit","python"],"meta":{"num_comments":3}}
{"title":"I made a file manager in python","description":"Here is the github link: \n\n[https://github.com/Tristan296/FileManager](https://github.com/Tristan296/FileManager)","link":"https://www.reddit.com/r/Python/comments/12460ah/i_made_a_file_manager_in_python/","created":"2023-03-28","tags":["reddit","python"],"meta":{"num_comments":4}}
{"title":"API Access and Token Introspection with OpenID Connect in ZITADEL","description":"ZITADEL is an open source Identity and Access Management (IAM) platform that provides authentication and authorization services. ​​You can secure APIs and authorize applications  to access these protected APIs on ZITADEL with[ ](https://twitter.com/hashtag/OIDC?src=hashtag_click)OpenID Connect.\n\nPython code samples to secure your APIs and access protected APIs as a back-end application using ZITADEL can be found here: [https://github.com/zitadel/examples-api-access-and-token-introspection](https://github.com/zitadel/examples-api-access-and-token-introspection)\n\nHere's the related blog post: [https://zitadel.com/blog/api-access-and-introspection](https://zitadel.com/blog/api-access-and-introspection)","link":"https://www.reddit.com/r/Python/comments/124e12r/api_access_and_token_introspection_with_openid/","created":"2023-03-28","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"Interactive command line ai tool powered by ChatGPT (ChatGPT 3.5)","description":"https://github.com/knid/ais/","link":"https://www.reddit.com/r/Python/comments/124jeyx/interactive_command_line_ai_tool_powered_by/","created":"2023-03-28","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"Introducing gptty v0.2.1 - A Powerful CLI Wrapper for ChatGPT with Context Preservation &amp; Query Support, Now on PyPI!","description":"Hey Reddit! 🚀\n\nI'm excited to share with you the latest version of **gptty** (v0.2.1), a context-preserving CLI wrapper for OpenAI's ChatGPT, now with a handy `query` subcommand and available on PyPI!\n\n🔗 **GitHub:** [https://github.com/signebedi/gptty/](https://github.com/signebedi/gptty/)\n\n🔗 **PyPI:** [https://pypi.org/project/gptty/](https://pypi.org/project/gptty/)\n\n**What's new in gptty v0.2.1?**\n\n📚 **The Query Subcommand**: The `query` subcommand allows you to submit multiple questions directly from the command line, making it easier than ever to interact with ChatGPT for quick and precise information retrieval (and also has a pretty cool loading graphic).\n\n[Scripting the \\`query\\` subcommand to pass multiple questions](https://preview.redd.it/qw6q6mame7qa1.png?width=1661&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=3a1aad3b9b61babc439ccb0a3a77aa792501cd3e)\n\n🏷️ **Tagging for Context**: gptty enables you to add context tags to your questions, helping you get more accurate responses by providing relevant context from previous interactions. This is useful for generating more coherent and on-topic responses based on your tags.\n\n📦 **PyPI Deployment**: gptty is now available on PyPI, making it super easy to install and get started with just a simple `pip install gptty`.\n\n**Why should developers choose gptty?**\n\n🎯 **Focus on Delivered Value**: gptty is designed to help developers, data scientists, and anyone interested in leveraging ChatGPT to get the most value out of the API, thanks to context preservation, command-line integration, and new query feature.\n\n🛠️ **Ease of Use &amp; Flexibility**: gptty offers an intuitive command-line interface (running [click](https://click.palletsprojects.com/en/8.1.x/) under the hood), making it simple to interact with ChatGPT, either for quick one-off questions or more complex, context-driven interactions. Plus, it can be easily integrated into your existing workflows or automation scripts.\n\n🧠 **Harness the Power of ChatGPT**: By combining the capabilities of ChatGPT with gptty's context-preserving features and query support, you can unlock a wide range of applications, from answering technical questions to generating code snippets, and so much more.\n\n🔀 **Support for All Completion Models**: gptty currently supports all [Completion models](https://platform.openai.com/docs/models/model-endpoint-compatibility), providing developers with the flexibility to choose the model that best suits their specific use case or application. This ensures that you can make the most of the OpenAI API and its various models without having to switch between different tools.\n\n🔌 **Planned Plug-and-Play Support for ChatCompletion Models**: We're working on adding plug-and-play support for [ChatCompletion models](https://platform.openai.com/docs/models/model-endpoint-compatibility) (including GPT-4 and GPT-3-turbo). This means that you'll be able to seamlessly integrate GPT-4 into your gptty setup and continue leveraging the power of the latest generation of language models.\n\nTo get started, simply install gptty using `pip`:\n\n    pip install gptty\n\nCheck out the **GitHub repo** for detailed documentation and examples on how to make the most of gptty: [https://github.com/signebedi/gptty/](https://github.com/signebedi/gptty/). You can also see my original post about this [here](https://www.reddit.com/r/Python/comments/11w7lw6/check_out_gptty_a_cli_wrapper_for_chatgpt_written/).\n\nHappy coding!\n\n**Edit**. Please forgive the cringe worthy emoji use. My lawyer informed me that, as a python / pypi developer, I was legally obligated to add them.","link":"https://www.reddit.com/r/Python/comments/123aiqk/introducing_gptty_v021_a_powerful_cli_wrapper_for/","created":"2023-03-27","tags":["reddit","python"],"meta":{"num_comments":33}}
{"title":"Downloading PDFs from URLs","description":"I'm facing a problem in finding a good python package. My job is to download PDFs from a column containing PDF URLs and storing all the downloaded PDFs in a target folder. I have used wget, TQDM libraries but I'm getting only 60% PDF URLs are able to downloaded as PDF. Other 40% giving me 403, 404 error and some are good URLs but not able to download. Anyone can help me in finding a good package","link":"https://www.reddit.com/r/Python/comments/124g3mo/downloading_pdfs_from_urls/","created":"2023-03-28","tags":["reddit","python"],"meta":{"num_comments":2}}
{"title":"A small doubt..!","description":"how do I get the desired value by subtracting any two values from a list of numbers??\n\nfor eg.: If I have a list of numbers like...\\[2,3,1,4,5,3,7,8\\], and I want (3) as output....so, it will give the difference of values which is equal to (3) ...So, either it will subtract (4 &amp; 1) or (8 &amp; 5)...etc....The output will be the number of combinations that can give this value!\n\nplease help me with this code!And I'm a newbie!!","link":"https://www.reddit.com/r/Python/comments/124fvxb/a_small_doubt/","created":"2023-03-28","tags":["reddit","python"],"meta":{"num_comments":8}}
{"title":"I made a tutorial type Python basic calculator video which can be helpful on remembering the basics","description":"Hello, I made a tutorial type video which covers While loop, if statements and user input. You can reach to the video from the following link, have a great day!\n\n[https://www.youtube.com/watch?v=myfneBV79j4](https://www.youtube.com/watch?v=myfneBV79j4)","link":"https://www.reddit.com/r/Python/comments/124iq0d/i_made_a_tutorial_type_python_basic_calculator/","created":"2023-03-28","tags":["reddit","python"],"meta":{"num_comments":2}}
{"title":"Flask input validation into SQL, but still getting to work with the raw SQL INSERT","description":" Greetings how is everyone doing I am very enthusiastic about using flask as an API, now what is the best route to go when it comes to input validation into SQL server, I know you will say sqlalchemy orm but I want my developers to learn SQL so were using raw sql for the most part, can the sqlalchemy orm itself validate input that will go into SQL or I will need another solution for that","link":"https://www.reddit.com/r/Python/comments/123zdiu/flask_input_validation_into_sql_but_still_getting/","created":"2023-03-27","tags":["reddit","python"],"meta":{"num_comments":12}}
{"title":"Which GUI module is better in Python? tkinter or PyQt or kivy?","description":"","link":"https://www.reddit.com/r/Python/comments/123b6x2/which_gui_module_is_better_in_python_tkinter_or/","created":"2023-03-27","tags":["reddit","python"],"meta":{"num_comments":53}}
{"title":"How to Build Python Media Player with PyQt5","description":"In this Python PyQt5 article we want to learn How to Build Python Media Player with PyQt5, Python is powerful language that can be used for different types of applications including creating multimedia applications. PyQt5 is popular Python library that allows developers to create graphical user interfaces for desktop applications. in this article we want to talk about how to build Python media player with PyQt5.\n\n&amp;#x200B;\n\nYou can check the complete tutorial in the below link\n\n[https://geekscoders.com/how-to-build-python-media-player-with-pyqt5/](https://geekscoders.com/how-to-build-python-media-player-with-pyqt5/)","link":"https://www.reddit.com/r/Python/comments/123hgj0/how_to_build_python_media_player_with_pyqt5/","created":"2023-03-27","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"I Build a very simple Dalai Alpaca Instruction Bot with Python as Proof of Concept.","description":"I build a very simple Instruction Bot as a proof of concept. Out of Dalai and Alpaca. You can find it here:  \n[https://github.com/Maximilian-Winter/DalaiDiscordChatBot](https://github.com/Maximilian-Winter/DalaiDiscordChatBot) \n\nhttps://preview.redd.it/kqpeuwflmcqa1.png?width=1368&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d10b4a2a52d273daac139d43920aab818ef57fcc","link":"https://www.reddit.com/r/Python/comments/12410iw/i_build_a_very_simple_dalai_alpaca_instruction/","created":"2023-03-27","tags":["reddit","python"],"meta":{"num_comments":3}}
{"title":"What is the your biggest problem while coding? (Please leave a comment)","description":"","link":"https://www.reddit.com/r/Python/comments/123xkuf/what_is_the_your_biggest_problem_while_coding/","created":"2023-03-27","tags":["reddit","python"],"meta":{"num_comments":30}}
{"title":"gRPC and Pydantic","description":"We want to implement the following architecture:\n\nThe model will be defined per service as PyDantic model, using their validation infrastructure.\n\nThen of this model we want to generate gRPC (pb2) to communicate between services (internal).\n\nThen we will have one service called \"api-gateway\" which will be implemented in FastAPI, and will include the endpoints that we are exposing to the public. This endpoints will have the OpenAPI decorators using FastApi infrastructure. The implementation of the endpoints will be a relevant gRPC call to the service.\n\nThis allows us to:\n\n1. Keep one source of truth for validation &amp; modeling\n2. Generate inter communication\n3. Generate public documentation and have a good control of what we are exposing\n\nTo make it work we need to:\n\nIn the micro service level use FastAPI so it will generate a json schema of our functionality -&gt; convert this to proto using openapi-generator (java) -&gt; use grpc\\_tools.protoc to generate the clients (python)\n\nThis is obviously ugly. As the source PyDantic is a schematic language and I already have the interface. FastAPI is used only for openAPI generation and not for HTTP (in the micro services) Too many conversions.\n\n**Does anyone knows a way to convert pedantic to a gRPC communication?**","link":"https://www.reddit.com/r/Python/comments/123m4oa/grpc_and_pydantic/","created":"2023-03-27","tags":["reddit","python"],"meta":{"num_comments":2}}
