{"title":"Saturday Daily Thread: Resource Request and Sharing! Daily Thread","description":"Found a neat resource related to Python over the past week? Looking for a resource to explain a certain topic?\n\nUse this thread to chat about and share Python resources!","link":"https://www.reddit.com/r/Python/comments/1213pp7/saturday_daily_thread_resource_request_and/","created":"2023-03-25","tags":["reddit","python"],"meta":{"num_comments":1}}
{"title":"popularity behind pydantic","description":"I was trying to find a good data validation library to use and then came across pydantic.\n\nI was wondering what exactly is the reason behind this popularity of pydantic. I saw some other libraries also such as msgspec which seems to be still faster than pydantic-core, but doesn't seems much popular.\n\nAlthough I know speed is a secondary matter and first comes developer comfort as per many (this is what pydantic also claims to be the reason behind their popularity)... I just wanted to know if there are some mind blowing features in pydantic which I am missing.\n\nPS : can anyone share their experience, especially in production about how helpful pydantic was to them and wether they tried any other alternatives only to find that they lack in some aspects?","link":"https://www.reddit.com/r/Python/comments/121amct/popularity_behind_pydantic/","created":"2023-03-25","tags":["reddit","python"],"meta":{"num_comments":19}}
{"title":"pandas 2.0 is coming out soon","description":"pandas 2.0 will come out soon, probably as soon as next week. The (hopefully) final release candidate was published last week.\n\n&amp;#x200B;\n\nI wrote about a couple of interesting new features that are included in 2.0:\n\n* non-nanosecond Timestamp resolution\n* PyArrow-backed DataFrames in pandas\n* Copy-on-Write improvement\n\n[https://medium.com/gitconnected/welcoming-pandas-2-0-194094e4275b](https://medium.com/gitconnected/welcoming-pandas-2-0-194094e4275b)","link":"https://www.reddit.com/r/Python/comments/120mci9/pandas_20_is_coming_out_soon/","created":"2023-03-24","tags":["reddit","python"],"meta":{"num_comments":38}}
{"title":"Build your own python security tools - PortScanner, Visual Network Tracker and Anonymous FTP Scanner","description":"**Python Cybersecurity — PortScanner**\n\nBuild a simple Port Scanner using the Python Programming language. Port Scanner is an application designed to probe a server or host for open ports. Such an application may be used by administrators to verify security policies of their networks and by attackers to identify network services running on a host and exploit vulnerabilities\n\n**Link**: [https://vinsloev.medium.com/python-cybersecurity-build-a-port-scanner-13b798a1b654](https://vinsloev.medium.com/python-cybersecurity-build-a-port-scanner-13b798a1b654)\n\n**Python Cybersecurity — Visual Network Tracker**\n\nDive into Network Traffic visualization using the Python programming language, Wireshark and Google Maps. This tutorial, covers the implementation steps needed to take a file of network traffic and convert it into a visual presentation using Google Maps.\n\n**Link**: [https://medium.com/vinsloev-academy/python-cybersecurity-network-tracking-using-wireshark-and-google-maps-2adf3e497a93](https://medium.com/vinsloev-academy/python-cybersecurity-network-tracking-using-wireshark-and-google-maps-2adf3e497a93)\n\n**Python Cybersecurity — Anonymous FTP Scanner**\n\nBuild a simple FTP Scanner using the Python Programming language. Anonymous FTP is a means by which archive sites allow general access to their archives of information. These sites create a special account called anonymous\n\n**Link**: [https://vinsloev.medium.com/python-cybersecurity-for-beginners-build-anonymous-ftp-scanner-a62f0534fcf5](https://vinsloev.medium.com/python-cybersecurity-for-beginners-build-anonymous-ftp-scanner-a62f0534fcf5)","link":"https://www.reddit.com/r/Python/comments/121f4w0/build_your_own_python_security_tools_portscanner/","created":"2023-03-25","tags":["reddit","python"],"meta":{"num_comments":1}}
{"title":"I made a cli tool to convert m3u to pyradio playlist.","description":"I made a cli tool to convert m3u to pyradio playlist.\n\nhttps://i.redd.it/8g7rxh11xspa1.gif\n\nIt converts m3u files to pyradio ([https://github.com/coderholic/pyradio](https://github.com/coderholic/pyradio)) CSV stations file format.\n\nYou can also automatically download and convert stations from the \"everything full\" m3u in this repo: [https://github.com/junguler/m3u-radio-music-playlists](https://github.com/junguler/m3u-radio-music-playlists).\n\nAnd there's also an option to download, convert and override current stations.csv (what GIF shows).\n\nGithub: [https://github.com/LionyxML/pyradio-m3u-to-playlist](https://github.com/LionyxML/pyradio-m3u-to-playlist)\n\nPip: `pip install m3u_to_pyradio_playlist`","link":"https://www.reddit.com/r/Python/comments/1218jin/i_made_a_cli_tool_to_convert_m3u_to_pyradio/","created":"2023-03-25","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"Python Web Scraping Delay","description":"Web Scraping Headlines delay\n\nI’m using python, beautiful soup (bs4) and requests to scrape headlines from an website within seconds when they appear in website.. here’s how i do it.\n\nI modified script to check theblock.co/latest h2 div where (headlines) are and if a new headline appears i receive data (headline) via cmd immediately but someone else is scraping the same headline 20 seconds earlier than me..\n\nHere is an screenshot that i compared seconds when i get data to cmd and someone’s terminal that scrapes same website/headline before me.\n\nLink Screenshot “imgbb”\nhttps://ibb.co/19NpV1q\n\nWhat could be the case and what it’s preventing me to scrape quicker.. Is Selenium/Scrapy faster than Beautiful Soup?\n\nOr could it be that im using VPN to avoid getting blocked by site?\n\nLooking forward to hear your opinions.","link":"https://www.reddit.com/r/Python/comments/12159xu/python_web_scraping_delay/","created":"2023-03-25","tags":["reddit","python"],"meta":{"num_comments":6}}
{"title":"A system for deep learning and reinforcement learning.","description":"Note is a system for deep learning and reinforcement learning.It makes it easy to create and train neural network.Note supports TensorFlow and PyTorch platform.It can speed up the training of neural network by multithreading and multiprocessing.\nhttps://github.com/NoteDancing/Note","link":"https://www.reddit.com/r/Python/comments/121h7fh/a_system_for_deep_learning_and_reinforcement/","created":"2023-03-25","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"My first app in Tkinter - Bézier curve read off","description":"Hello, I started coding in Python about 5 months ago. I worked mainly with Pygame, but now, I have shifted my interest to Tkinter.  \nFor my first application with this module, I chose to do Bézier curve read off. If you have an image with a quadratic or cubic Bézier curve and do not know the correct equations, this application can help you with that. You only need to import the image and shape the Bézier curve in the app to look like the one in the image, the application can then provide you with the corresponding equations. In addition, it also tells you where the extrema of the curve are and highlights them for you.\n\nIn the future, I plan to add the ability to add more than one Bézier curve.\n\nI also made a Youtube video where I go into a little bit more detail:  \n[https://www.youtube.com/watch?v=HN47iyTLCG8](https://www.youtube.com/watch?v=HN47iyTLCG8)\n\nI would like to hear your opinion and what I could improve.\n\nYou can find the code here:  \n[https://drive.google.com/file/d/1-iKEmiFGzq0-Gq76yNXk5jrb2IK3BUEX/view?usp=sharing](https://drive.google.com/file/d/1-iKEmiFGzq0-Gq76yNXk5jrb2IK3BUEX/view?usp=sharing)","link":"https://www.reddit.com/r/Python/comments/121h43w/my_first_app_in_tkinter_bézier_curve_read_off/","created":"2023-03-25","tags":["reddit","python"],"meta":{"num_comments":1}}
{"title":"Input on designing an introduction to python course","description":"Hi!\n\nI am designing a mandatory Python-based introductory programming course for \\*all\\* engineering students at my university (software engineering to medico technology!). \n\nThe course will be placed in their first semester and correspond to 1/6th of their overall workload in that semester (5ECTS/13 teaching sessions/2h teaching+2h lab). It will run in parallel to the math-course, which has examples typeset in notebooks using numpy/sympy (but from a user perspective).\n\nFor some of the technical lines (AI, robotics, etc.) this will unfortunately be their only mandatory programming course, which mean it has to do a great deal for a lot of different students. Because of these demands, I would ideally like it to start from the absolute basics (\\*no\\* prior programming experience) and end up with basic OOP as this will be important for those who do AI later (sklearn, torch, etc.), with a minimum of deviations along the way. The course will be open source  (i.e. hosted on gitlab pages; all material available without login).\n\nI have looked for other courses for inspiration, but many other courses include additional things (CS50 from Harvard) or seem to assume to much prior knowledge: [https://ocw.mit.edu/courses/6-0001-introduction-to-computer-science-and-programming-in-python-fall-2016/](https://ocw.mit.edu/courses/6-0001-introduction-to-computer-science-and-programming-in-python-fall-2016/) \n\nThe kind of course I am aiming for (obviously this is open to criticism) is one that focuses maximally on the language (primitive datatypes, functions, lists+other compound types, loops, basic oop, basics about packages), somewhat focuses on useful developer skills (what is an interpreter, how to debug code, etc.) and very minimally on everything else (no regexp, no big libraries like pandas, only basic file reading/writing, etc.).  The lab sessions will be based on editing/writing .py files in VSCode.\n\nI am hoping that some here can recommend good resources -- Ideally an open-source course which has a similar scope and a really good progression curve, or a good (concise!) book, etc. Any general advice is of course welcome, but I feel stumped by the whole 'what fit in which weeks and how much' side of things. My current outline is:\n\n1. intro, print, simple functions, algebraic operations: Basically a very few examples of python to talk over that 'we will get to'. Must assume many don't have python working yet.\n\n2. primitive types, conversions int('31'), basic functions (analogy with math). \n\n3. functions++, variables, if/else. Mention type annotation to avoid confusion.\n\n4. Reading/writing text files as 'copy paste code', string operations. String manipulation is formatted as a soft intro to lists.\n\n5. Lists, loops, tuples, functions of multiple variables. \"adfsa\".split(), \"\".join(..), etc.\n\n6. Sets, functions of mutiple output arguments, comprehension, range(), enumerate()\n\n7. dicts, more on comprehension and looping, items()\n\n8. exceptions, asesrt, packages (all just a very brief overview). This is a catch-up lecture\n\n9. classes 1 (classes, mutability)\n\n10. classes 2 (inheritance, \\_\\_add\\_\\_, etc.)\n\n11. build your own sympy 1: running example on building an alternative sympy\n\n12. build your own sympy 2: running example on building a sympy + catch-up","link":"https://www.reddit.com/r/Python/comments/121gujc/input_on_designing_an_introduction_to_python/","created":"2023-03-25","tags":["reddit","python"],"meta":{"num_comments":1}}
{"title":"myKamus: A Free and Open Source Indonesian Translation Program","description":"G'day all!\n\nToday I am here to showcase my first public open source program (which is VERY simple but very useful or anyone like me)!\n\nIf you try to clone it, take note that one of the files is over 700mb so it is stored on the GitHub large file service.\n\nDescription:\n\n*myKamus is An open source instant translation software for Indonesian that provides the user with complex Indonesian-English translation capabilities. To run the program you can either do it from inside an IDE of your choice, or with Python installed either:*\n\n*a) Run clipboard\\_monitor through IDLE*\n\n*b) Launch a Powershell session through the directory and run clipboard\\_monitor through it*\n\n*It utilises several open source bitext corpus to provide access to over 50 million example sentences and words for the purposes of translation. The program is free to use for academic and non-commercial applications, if you wish to use it for something else email me at* [*gabrielcbarnett@gmail.com*](mailto:gabrielcbarnett@gmail.com)*. There will be no cost involved for a license to use in a corporate, government or military environment, it is so we can discuss any needs you might have for updates, specific vocabulary or language requirements. Again, it will be free but a representative from your organization must make contact with me first.*\n\n&amp;#x200B;\n\n*If you like this program and have found it useful for your work, feel free to email with your success story or anyimprovements that you might suggest.*\n\nFeatures:\n\n* Automatically translate individual words and phrases from the computers clipboard which it monitors through the use of pyperclip\n* The library of approximately 60 million sentences and words means the nine times out of ten you will find either the definition of the word that you are looking for or an example sentence that you will be able to infer the meaning of the word from.\n* This means you are likely to find almost all verb/noun forms that Indonesian has to offer\n* Excellent for people who have learnt Indonesian through school or work and just need to look the odd word up quickly without using a translation service like Google or Deepl (which often provide misleading results anyway).\n\nA link to the program can be found here:\n\n[https://github.com/GabrielBarnett/myKamus](https://github.com/GabrielBarnett/myKamus)\n\nI am happy to take suggestions on how to improve the program, but I have only been working on the for a few hours now. At some point I would like to build it into a GUI and use pyInstaller to actually make an executable for the program, but I can't work out how to use pyInstaller on a project with multiple py files and have it also include the dependent translation files which at over 700mg in size.","link":"https://www.reddit.com/r/Python/comments/1219gse/mykamus_a_free_and_open_source_indonesian/","created":"2023-03-25","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"NASA's Cassini - Cosmic Dust Analyzer: A proper calibration!","description":"[In my last post](https://www.reddit.com/r/Python/comments/11vjmc2/nasas_cassini_cosmic_dust_analyzer_how_to/) I showed you, how spacecraft instruments are calibrated. To be more precise: it was about so called dust detectors, like the Cosmic Dust Analyzer (CDA) that was on-board the NASA's probe Cassini.\n\nBut conducting calibration experiments and recording and storing tons of data is one thing. The next logical step: deriving actual calibration functions!\n\nFor this part I created a small tutorial that shows the already existing functions to compute the velocity of dust impacts, based on some electric signals. *Why is the velocity so important?* Well, based on the impact speed and direction of the instrument at the \"moment\" of impact, one can derive astro-dynamical insights.\n\nAnd later ... when we take a look at the science part ... you will see that ... well I don't want to spoil ... you can create amazing science results with these \"simple\" computations!\n\nAnyway, further I compute the Mean Absolute Error (MAE) and Root Mean Square Error (RSME) to obtain some performance result of the calibration functions. *Why?* Well next week we will use a **Tensorflow / Keras** based approach to create a **Machine Learning based calibration function**. The MAEs and RSME are the \"benchmark\" values we need to \"beat\".\n\nStay tuned,\n\nThomas\n\nVideo: [https://youtu.be/RkVx-7fcVRY](https://youtu.be/RkVx-7fcVRY)\n\nGitHub: [https://github.com/ThomasAlbin/Astroniz-YT-Tutorials/blob/main/%5BProject%5D-Cassini-CDA/01-Calibration/02\\_prior\\_calibration.ipynb](https://github.com/ThomasAlbin/Astroniz-YT-Tutorials/blob/main/%5BProject%5D-Cassini-CDA/01-Calibration/02_prior_calibration.ipynb)","link":"https://www.reddit.com/r/Python/comments/120zfin/nasas_cassini_cosmic_dust_analyzer_a_proper/","created":"2023-03-24","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"Spotr - a simple spotify CLI made in python","description":"I made a spotify CLI in python.\n\nI know its very basic, but this is my first python project and i think its pretty cool and useful :)It has all the commands you would need (i think), even a suprise command for song recommendations!\n\nMade this beacuse i wanted a simple way of controlling my spotify in the terminal.I has a hint of neofetch in the way its displays info, so if you like that give it a try\n\nIt can be easily modified, and if you know basic python you can easily make your own commands\n\nFor more information and the source code check the github - [https://github.com/Havard03/spotr](https://github.com/Havard03/spotr)  \nIf you like it or find it useful, i would very much appreciate any stars :D  \n\n\nhttps://i.redd.it/e6wnrz258ppa1.gif\n\nhttps://preview.redd.it/inrkqqiu7ppa1.png?width=1914&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ec598dfc26e2554bdd6ff622182e56a3d216920d","link":"https://www.reddit.com/r/Python/comments/120mdb8/spotr_a_simple_spotify_cli_made_in_python/","created":"2023-03-24","tags":["reddit","python"],"meta":{"num_comments":4}}
{"title":"Alarm clock made with Python &amp; Kivy","description":"Hello! A time ago, I decided to make an alarm-clock using Python and Kivy as a means of practicing both languages. I really liked the process of learning and debugging through the code. Also I ended up really liking the end result. Below is a link to the project if you're willing to see it and perhaps give a feedback! Thank you :)\n\n&amp;#x200B;\n\nGitHub: [https://github.com/v0di/alarm-clock](https://github.com/v0di/alarm-clock)","link":"https://www.reddit.com/r/Python/comments/120vt7l/alarm_clock_made_with_python_kivy/","created":"2023-03-24","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"reKarma - my first public app ever. MacOS menu bar app that checks reddit's karma of given user.","description":"Here's the first application I ever published, and definitely the first in Python.\n\n[reKarma github](https://github.com/nutellaordidnthappen/reKarma)\n\nThe app will reside in the macOS menu bar, where it will create a text icon that will update the karma score for that user every 5 minutes.\n\nNo reddit account login required.\n\nI started learning Python a few days ago (my biggest experience is with C#). I've already made a few scripts/console apps in Python, and I wanted to try how hard/easy it would be to make something as specific as an app directly for Mac that would only live in the status bar.\n\n&amp;#x200B;\n\nHopefully someone will like it :)","link":"https://www.reddit.com/r/Python/comments/120vq47/rekarma_my_first_public_app_ever_macos_menu_bar/","created":"2023-03-24","tags":["reddit","python"],"meta":{"num_comments":13}}
{"title":"Python Verse Series: The Ultimate Guide for Beginners in Python!","description":"Are you new to Python and looking for a comprehensive guide to get started? Look no further! Introducing the Python Verse Series, a collection of videos that covers all the basic concepts in Python.\n\nLink :: [Link to Python Verse Series](https://www.youtube.com/watch?v=Zufhf-1sAGk&amp;list=PLGti5cnlfURpXuEWmHsVaQ8zzz4srH4ZD)\n\n&amp;#x200B;\n\n[The PythonVerse Series](https://preview.redd.it/mhcl4xx6lopa1.png?width=1920&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=ece53acfcec3b065a8e0d4fdea3d9db4d90452a2)","link":"https://www.reddit.com/r/Python/comments/120iu3i/python_verse_series_the_ultimate_guide_for/","created":"2023-03-24","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"New Release: ChatGPT desktop application written in Python","description":"https://github.com/nero-dv/Generally-Pretty-True-Assistant\n\nI got tired of not being able to view my history in ChatGPT, so I wrote a python program that utilizes Qt (PySide6) to generate a simple UI to talk to the OpenAI API. \n\nYou must enter your own OpenAI API key either through the File Menu &gt; Set API Key, or by setting the following environment variable (and logging out then back in for your login shell to recognize it), though usage is generally very cheap. I've sent it over 300 requests and have only been billed a few cents","link":"https://www.reddit.com/r/Python/comments/120xgrr/new_release_chatgpt_desktop_application_written/","created":"2023-03-24","tags":["reddit","python"],"meta":{"num_comments":12}}
{"title":"New release of FastKafka supporting Redpanda","description":"We were searching for something like FastAPI for Kafka-based service we were developing, but couldn’t find anything similar. So we shamelessly made one by reusing beloved paradigms from FastAPI and we shamelessly named it FastKafka. The point was to set the expectations right - you get pretty much what you would expect: function decorators for consumers and producers with type hints specifying Pydantic classes for JSON encoding/decoding, automatic message routing to Kafka brokers and documentation generation.\n\nThis new release implements a number of feature requests coming from the community, the most significant one being adding support for Redpanda broker for both testing and deployment. Please take a look and let us know how to make it better:\n\n[https://github.com/airtai/fastkafka](https://github.com/airtai/fastkafka)","link":"https://www.reddit.com/r/Python/comments/120mt5k/new_release_of_fastkafka_supporting_redpanda/","created":"2023-03-24","tags":["reddit","python"],"meta":{"num_comments":4}}
{"title":"Generating PDF files via FastAPI and sending the file to the user's email. (Currently using PyPDF2)","description":"Current project I'm working on requires me to build a REST API to connect with the existing application that my client made.\n\nThe application is sending some data to my API in which I need to format and generate a PDF file. With how the current application is being made now, it does not accept any file-type data to be returned. Thus, I need to generate the PDF file and send it to the user's email.\n\nI've experimented with modules like PyPDF2 in which I can take in data and generate tables very easily. However, to view the file, I need to generate it and export it to my local drive.\n\nWhat I do not understand is, how will this work in the deployment server? I've deployed a test API on [Render](https://dashboard.render.com/). The packages that are available only supplies the RAM and CPU to do computation.\n\n&amp;#x200B;\n\nMy question is, would it be possible to somehow generate the PDF file in memory and sending it to the user's email? Or maybe there is a better way of doing this whole process that is cost-effective.\n\nIf anyone has better ideas or other recommendations in regard to the module that I chose, feel free to give your opinion.\n\nMany thanks.\n\n&amp;#x200B;\n\n\\*Edit:(Correction, currently I am using FPDF2, not PyPDF2)","link":"https://www.reddit.com/r/Python/comments/120spc5/generating_pdf_files_via_fastapi_and_sending_the/","created":"2023-03-24","tags":["reddit","python"],"meta":{"num_comments":4}}
{"title":"https://www.fiverr.com/share/Ebzma7","description":"Lessons python","link":"https://www.reddit.com/r/Python/comments/121f99i/httpswwwfiverrcomshareebzma7/","created":"2023-03-25","tags":["reddit","python"],"meta":{"num_comments":0}}
{"title":"Is it a good time to use asyncio?","description":"I used asyncio around 6 months ago to build our CLI that does a lot of IPC with NodeJS processes. The CLI turned out to be a nightmare for our users because we didn't realize how wrong our code was due to following reasons:\n\n1. We didn't handle \\`asyncio.CancelledError\\` properly. It seems all the co-routine should have try-catch.\n2. Consequently, something as simple as handling \\`KeyboardInterrupt\\` became a nightmare for us.\n3. We went through the python docs but it wasn't clear how to handle edge cases such as an async generator during KeyboardInterrupt.\n4. The spec around asyncio is changing very fast. I realized asyncio is not backward compatible between 3.11 and 3.7. Please correct me if I am wrong.\n\nWould love to know the views of python developers on this.","link":"https://www.reddit.com/r/Python/comments/11zsr7f/is_it_a_good_time_to_use_asyncio/","created":"2023-03-23","tags":["reddit","python"],"meta":{"num_comments":96}}
{"title":"Customs Inspector - Easy manual auditing of Python Poetry package updates","description":"Hello all,\n\nVery excited to share a tool I've been working on and explore it's feasibility with the community.\n\n[https://github.com/R9295/customs-inspector](https://github.com/R9295/customs-inspector)\n\nCustoms Inspector  hooks into Poetry's package management system to allow for manual auditing of package changes during updates. It opens a browser with a diff view of the changes for you to manually audit.\n\nThe idea is to harness the community's collective effort to find malicious packages.\n\nNo one likes manual auditing, but perhaps, this makes it less so?\n\nLooking forward to your thoughts","link":"https://www.reddit.com/r/Python/comments/1201eri/customs_inspector_easy_manual_auditing_of_python/","created":"2023-03-23","tags":["reddit","python"],"meta":{"num_comments":3}}
{"title":"Python software developer role is really profitable?","description":"Guys, I have started to learn python and I want to be a python software developer but I am little confused that how much growth of a python software developer?","link":"https://www.reddit.com/r/Python/comments/1219z55/python_software_developer_role_is_really/","created":"2023-03-25","tags":["reddit","python"],"meta":{"num_comments":7}}
