{"title":"How do I select sentences in text which talk about specific thing?","description":"I have following sentences in mobile review:\n\n&gt; The camera lens is really of good quality with 1 cm sensor. The pictures turns out to have more realistic colour tone. But the mobile does not have good colour option. The battery life is also descent and not to mention that processor is top notch. However, the pics can sometimes turn out to be over exposed.\n\nI want to select only those sentences which talk about camera quality in above paragraph. In other words, I want to select following sentences:\n\n* The camera lens is really of good quality with 1 cm sensor. \n* The pictures turns out to have more realistic colour tone.\n* However, the pics can sometimes turn out to be over exposed.\n\nWhat ML model / concept / idea I can use to achieve this?","link":"https://www.reddit.com/r/LanguageTechnology/comments/11rs3sh/how_do_i_select_sentences_in_text_which_talk/","created":"2023-03-15","tags":["ml","languagetechnology","reddit"],"meta":{"num_comments":0}}
{"title":"Model for pattern classification","description":"I have a pattern list having 5-7 classes, where each class has 500+ similar patterns. Is there any model which can be trained on these patterns so that model can be able to classify a given pattern.","link":"https://www.reddit.com/r/LanguageTechnology/comments/11rngfi/model_for_pattern_classification/","created":"2023-03-15","tags":["ml","languagetechnology","reddit"],"meta":{"num_comments":0}}
{"title":"Finno-Ugric open-source machine translation","description":"We here at the University of Tartu created an NMT engine for 23 Finno-Ugric languages, targeting low-resource languages: Livonian, Komi, Udmurt, Võro and several others. Most of the covered low-res languages are not part of Meta's M2M100 or NLLB, nor are they part of Google Translate, Bing Translator or DeepL yet.\n\nFairSeq translation model and full list of supported languages here: [https://huggingface.co/tartuNLP/smugri3-finno-ugric-nmt](https://huggingface.co/tartuNLP/smugri3-finno-ugric-nmt). Online demo here: [https://translate.ut.ee/](https://translate.ut.ee/), submitting corrected translations is also supported, in case you speak any of these languages - we are hoping to use the feedback to improve translation quality in the near future.","link":"https://www.reddit.com/r/LanguageTechnology/comments/11r0izu/finnougric_opensource_machine_translation/","created":"2023-03-14","tags":["ml","languagetechnology","reddit"],"meta":{"num_comments":0}}
{"title":"GPT-4 has been announced! How long will it take for me to get off the waiting list?","description":"Just saw that OpenAI released gpt 4. Only has multi-modal element of inputting of images, not video. \n\nStill super exciting. Can anyone speculate how long until i can get access to the api? i’m on the waitlist.","link":"https://www.reddit.com/r/LanguageTechnology/comments/11rddy4/gpt4_has_been_announced_how_long_will_it_take_for/","created":"2023-03-14","tags":["ml","languagetechnology","reddit"],"meta":{"num_comments":1}}
{"title":"A corpus fully about STEM","description":"Hello, \n\nIs there a corpus fully dedicated to STEM?","link":"https://www.reddit.com/r/LanguageTechnology/comments/11r8zp9/a_corpus_fully_about_stem/","created":"2023-03-14","tags":["ml","languagetechnology","reddit"],"meta":{"num_comments":1}}
{"title":"Is GPT-3(and ChatGPT) trained with the MLM task?","description":"Hi all experts, I have a quick question.\n\n\\- Is the GPT family(GPT1/2/3/Chat) trained with the MLM(Masked Language Modeling) task?\n\nI guess no, because the GPT is basically auto-regressive(unidirectional), and their papers didn't mention the MLM training task, afaik. But when I googled, there is no clear answer, and the ChatGPT answers that the GPT family was trained on MLM.\n\nDoes anyone know the precise answer?","link":"https://www.reddit.com/r/LanguageTechnology/comments/11qvs3t/is_gpt3and_chatgpt_trained_with_the_mlm_task/","created":"2023-03-14","tags":["ml","languagetechnology","reddit"],"meta":{"num_comments":5}}
{"title":"Structured Data-to-Text Generation (with little coding)?","description":"I'm looking to generate very structured text output from ideally a basic UI offering (consecutive 'decision-tree'-like) multiple choice inputs and text input boxes.\n\nIs there any software that can be programmed via some basic rules without requiring a lot of coding experience?\n\nI'm completely new to this field, so any hint is much appreciated!","link":"https://www.reddit.com/r/LanguageTechnology/comments/11r2yub/structured_datatotext_generation_with_little/","created":"2023-03-14","tags":["ml","languagetechnology","reddit"],"meta":{"num_comments":0}}
{"title":"Evaluation Methods for text segment matching","description":"Hi together,\n\nright now I'm working on my masters thesis with the goal of exploring the usage of Language Models for matching Information Security controls. I am having a few questions about the evaluation methods which I have used so far and some which I might have missed. \n\nA little background: \nI have created a data set based on existing mappings between the ISO27001 security framework and another IT security framework. \n\nThe data set is created in the following way:\nI have two sentences/paragraphs per training example, one ISO sentence and one paragraph (might be one sentence up to a full subchapter) from the other framework, and per each pair of sentences a similarity score which indicates their semantic overlap / if they \"fit together\" (derived from an official existing mapping which maps chapters of sentences from both frameworks to each other).\n\nThe task for the models is as follows: I want the models to create embeddings of the sentence pairs and learn to put those embeddings which \"fit together\", as indicated by the ground truth similarity score, close to each other, while pulling those sentence pairs which do not belong together farther away in the embedding space. Later on, I want to let the model encode previously unseen sentences (e.g. new ISO controls) and then use semantic search based on a distance metric, at first cosine similarity (or possibly other methods) to find the most similar sentences from another IT security framework, as to match them together.\n\nFor this task I am using a SentenceBERT variant as a strong baseline.\n\nIn terms of model evaluation I use a held out test set from a 80/20 train test split. On trained models, I have used two evaluation methods so far:\n\n1. Let the model encode sentence pairs from test set (where a ground truth cosine similarity score is known) and then calculate the Cosine similarity. Calculate Cosine similarity loss on test set.\n\n2. For each distinct sentence / ISO control in the test set, use this sentence as query for the trained model and let the model output the top-k most similar sentences from the second security framework. Compare the calculated top-k matches with the actual matches and calculate precision at k and recall at k.\n \nNow coming to the questions:\n\n1. Do you think that the evaluation methods I have used so far are appropriate for evaluating the models' performances on the task described above?\n\n2. Can you think of any other evaluation methods I might have missed? \n\n3. Do you possibly know of similar research, and if so, could you point me in this direction?\n\nI would appreciate any answers or feedback, feel free to point out any flaws if you do not mind.\nOh and also please excuse the formatting, I am typing this on my phone. \n\nThank you!","link":"https://www.reddit.com/r/LanguageTechnology/comments/11r1jch/evaluation_methods_for_text_segment_matching/","created":"2023-03-14","tags":["ml","languagetechnology","reddit"],"meta":{"num_comments":0}}
{"title":"Optimum Dataset for Sequence Labelling","description":"Hi everyone. I'm working on a custom NER like task.\n\nHowever some tags have very low frequency in the data. Hence mode is not good in predicting them.\n\nThis problem got me thinking what would the optimum dataset look like for such a task? \nShould number of samples for each label be similar? \nif we increase the data for all labels but keep a specific label same would it impact the preformance?\n\nPapers usually just take a toy dataset and tweak the model or data little bit. I couldn't find an answer to these questions. Do you have any resource or knowledge on this?","link":"https://www.reddit.com/r/LanguageTechnology/comments/11qf9sv/optimum_dataset_for_sequence_labelling/","created":"2023-03-13","tags":["ml","languagetechnology","reddit"],"meta":{"num_comments":2}}
{"title":"Recommendations for a newbie","description":"I've been reading a lot of articles about AI in general, machine learning and NLP etc but I want to learn more about NLP, creating desktop and mobile apps for questions-answering and summarizing texts. \n\nI've done programming in javascript and C# in the past and I wonder if that is enough or if I must learn python as well. \n\nWhat are your recommendations regarding language, tools, APIs, models, transformers etc and why should I start with these?","link":"https://www.reddit.com/r/LanguageTechnology/comments/11pdpc3/recommendations_for_a_newbie/","created":"2023-03-12","tags":["ml","languagetechnology","reddit"],"meta":{"num_comments":11}}
