{"title":"Training only Labelled Bbox for Object Detection.","description":"Hi,\n\nI'm trying to use the Open Image Dataset to train Yolov5 model. However, in the dataset, not all of object in a image are labelled. For example, there are a computer, a table, and a chair in a image, and the computer and the table are labelled with bouding-box, but the chair is not labelled. And many other images including chairs have labels of chairs.\n\nThen, it will affect to the training. I want to know that if I want to ignore unlabelled objects in some images for computing the loss, how could I do for it?\n\nPlease let me know the solution or some websites that have the answer.","link":"https://www.reddit.com/r/deeplearning/comments/123gy5h/training_only_labelled_bbox_for_object_detection/","created":"2023-03-27","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":1}}
{"title":"Looking for book recommendations on [Geometric] Deep Learning","description":"Hi everyone, I'm new to this sub so please let me know if I am violating any rule by asking this type of question.   \nI'm a graduate student in Italy studying Applied Mathematics and recently I just started a course in differential geometry. A few days ago, I came up against [this seminar](https://www.youtube.com/watch?v=MtZV82LCNHc&amp;list=PLJ1v1ouVb6bCBajvaqvsFKjnIO72NcfCD&amp;index=1&amp;t=35s) about manifold learning in computer vision by Richard Hartley and just got more and more hooked on the topic of geometric Deep Learning. I would like to write my thesis on the topic and to start learning more about it I decided to follow [this online course by M. Bronstein](https://www.youtube.com/playlist?list=PLn2-dEmQeTfQ8YVuHBOvAhUlnIPYxkeu3) on geometric Deep Learning.   \n\n\nWhile I think my mathematical foundations are solid enough, I think I will have some trouble with the topics related to DL, so I was planning in buying a book on DL (it was long overdue) to keep as a reference throughout the course.   \nI found these two books quite interesting, but unfortunately, there are not many reviews on them, so it's quite difficult for me to understand which one would be the best fit for my use. The books:\n\n*  *Deep Learning Architectures: A Mathematical ApproachDeep Learning Architectures: A Mathematical Approach*    by Ovidiu Calin\n*  *Geometry of Deep Learning: A Signal Processing Perspectiv**e*   by  Jong Chul Ye \n\nSo I'm kindly asking you if you had any suggestions for the books (also ones not listed like the Goodfellow book if you think it's better). Also, more general tips and pieces of advice are very welcome:)  \n Thank you in advance to everyone who takes the time to answer my question.","link":"https://www.reddit.com/r/deeplearning/comments/122p2go/looking_for_book_recommendations_on_geometric/","created":"2023-03-26","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":1}}
{"title":"is 'reward model' used in PPO also used at inference of the policy?","description":"I'm studying PPO because its related to RLHF.\n\nI get that the 'reward model' is used to train the policy. \n\nBut at inference I think the policy model is the only one that is used. \n\nIs this correct?","link":"https://www.reddit.com/r/deeplearning/comments/1229ne0/is_reward_model_used_in_ppo_also_used_at/","created":"2023-03-26","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":1}}
{"title":"Linear activation or classification for approximating continuous outputs","description":"What is generally the most effective model strategy when training a neural network to predict values on a continuous interval of values - to use e.g an output layer with regular linear activation (to output continuous values) or to bin the allowed output intervals into bins with tolerable resolution and use e.g softmax for multi-classification?","link":"https://www.reddit.com/r/deeplearning/comments/122f857/linear_activation_or_classification_for/","created":"2023-03-26","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":3}}
{"title":"Introtodeeplearning.com","description":"Anyone taking this course on YouTube ?  I wanted to see if anyone wants to form a study group. I need some help.","link":"https://www.reddit.com/r/deeplearning/comments/122awd9/introtodeeplearningcom/","created":"2023-03-26","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":1}}
{"title":"Using Stable Diffusion's training method for Reverse engineering?","description":"Bellow is what I know about Stable diffusion\n\n&amp;#x200B;\n\n* The base model of the Stable Diffusion is orignially trained for removing noises in images.\n* With a given training image, a series of images are created by repeatedly adding noise to the previous image. \n* The model is trained to revert this process, removing noises repeatedly to create the original image. \n\n&amp;#x200B;\n\nCan't this training method be used for training a reverse engineering model?\n\nA model that can create C, C++,  or some language code from a binary code?\n\n&amp;#x200B;\n\n1. Make compiler to output not only the binary code but also every code that occurs in the middle steps; hence, make a series of code that begins from the original source code and ends to the binary code(or just assembly code.).\n2. Train a model to revert each code to its previous code in the series.\n3. A model that can retrieve a source code from a binary code is created. \n4. Maybe, it can be trained and updated further, to accept text instruction, like Stable Diffusion. Modifying the source as instructed in the text.\n\n&amp;#x200B;\n\nIs this not plausible?\n\nOr are there already some researches on this idea?","link":"https://www.reddit.com/r/deeplearning/comments/121kxlt/using_stable_diffusions_training_method_for/","created":"2023-03-25","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":9}}
{"title":"Do we really need 100B+ parameters in a large language model?","description":"DataBricks's open-source LLM, [Dolly](https://www.databricks.com/blog/2023/03/24/hello-dolly-democratizing-magic-chatgpt-open-models.html) performs reasonably well on many instruction-based tasks while being \\~25x smaller than GPT-3, challenging the notion that is big always better?\n\nFrom my personal experience, the quality of the model depends a lot on the fine-tuning data as opposed to just the sheer size. If you choose your retraining data correctly, you can fine-tune your smaller model to perform better than the state-of-the-art GPT-X. The future of LLMs might look more open-source than imagined 3 months back?\n\nWould love to hear everyone's opinions on how they see the future of LLMs evolving? Will it be few players (OpenAI) cracking the AGI and conquering the whole world or a lot of smaller open-source models which ML engineers fine-tune for their use-cases?\n\nP.S. I am kinda betting on the latter and building [UpTrain](https://github.com/uptrain-ai/uptrain), an open-source project which helps you collect that high quality fine-tuning dataset","link":"https://www.reddit.com/r/deeplearning/comments/121agx4/do_we_really_need_100b_parameters_in_a_large/","created":"2023-03-25","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":52}}
{"title":"Which master program is best value for a career in ML","description":"Currently which master program do you think is the best for a machine learning career (currently thinking of machine learning engineer in particular but you can suggest other jobs which has stable future or has/will have high pay)? Also I am currently a CS undergrad, also which program gives more flexiblity to pivot into other domains? Also which ML jobs are in or going to be in high demand that has good pay which doesn't require a phd but just a masters? Also is masters in statistics more valuable than in cs/ml ?","link":"https://www.reddit.com/r/deeplearning/comments/121yfet/which_master_program_is_best_value_for_a_career/","created":"2023-03-25","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":2}}
{"title":"Has anyone tried to use deep learning with CNNs on satellite images to predict malaria risk (or other similar diseases)?","description":"We are writing our master's thesis in deep learning where we are predicting malaria risk with remote sensing data, but so far we have not found any papers that specifically use CNNs on satellite images in their models. Does anyone know if this has been tried before?","link":"https://www.reddit.com/r/deeplearning/comments/120urzh/has_anyone_tried_to_use_deep_learning_with_cnns/","created":"2023-03-24","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":19}}
{"title":"What Cloud GPU flatrate models for Machine Learning exist there?","description":"I am currently aware of Colab Plus and Paperspace Gradient. Are there better / cheaper alternatives?","link":"https://www.reddit.com/r/deeplearning/comments/120rohs/what_cloud_gpu_flatrate_models_for_machine/","created":"2023-03-24","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
{"title":"How to use a training set to train a standard RNN","description":"hi everyone\n\nFor my research, im attempting to train a RNN in order to learn the effects of sequence of treatments on survival outcomes. the dataset is a medically realistic data simulation for small-cell lung cancer based on Geng et al 2017. i've began the process with generating the data out of a python array. afterwards, im following the thumb rule of 70% training, 20% testing, 10% validation set.\n\nFyi, im working on VS studio code. How can i start training an RNN ?\n\nthanks","link":"https://www.reddit.com/r/deeplearning/comments/120pqkz/how_to_use_a_training_set_to_train_a_standard_rnn/","created":"2023-03-24","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
{"title":"Introducing the YouTube channel reviewing good GitHub repositories including explaining the code","description":" \n\nHello, does anyone know a YouTube channel or a website that has come to check good repositories in Github, for example, repositories that are written by reliable teams and whose codes have been explained, for example, or...\n\nIf you know, please let me know. Thank you.","link":"https://www.reddit.com/r/deeplearning/comments/120zmb1/introducing_the_youtube_channel_reviewing_good/","created":"2023-03-24","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
{"title":"Introducing the YouTube channel reviewing good GitHub repositories including explaining the code","description":" \n\nHello, does anyone know a YouTube channel or a website that has come to check good repositories in Github, for example, repositories that are written by reliable teams and whose codes have been explained, for example, or...\n\nIf you know, please let me know. Thank you.","link":"https://www.reddit.com/r/deeplearning/comments/120ztv8/introducing_the_youtube_channel_reviewing_good/","created":"2023-03-24","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
{"title":"Introducing the YouTube channel reviewing good GitHub repositories including explaining the code","description":" \n\nHello, does anyone know a YouTube channel or a website that has come to check good repositories in Github, for example, repositories that are written by reliable teams and whose codes have been explained, for example, or...\n\nIf you know, please let me know. Thank you.","link":"https://www.reddit.com/r/deeplearning/comments/120zs3g/introducing_the_youtube_channel_reviewing_good/","created":"2023-03-24","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
{"title":"Introducing the YouTube channel reviewing good GitHub repositories including explaining the code","description":" \n\nHello, does anyone know a YouTube channel or a website that has come to check good repositories in Github, for example, repositories that are written by reliable teams and whose codes have been explained, for example, or...\n\nIf you know, please let me know. Thank you.","link":"https://www.reddit.com/r/deeplearning/comments/120zoxe/introducing_the_youtube_channel_reviewing_good/","created":"2023-03-24","tags":["deeplearning","reddit","ml"],"meta":{"num_comments":0}}
