{"title":"Muppeting: New Term For Off Prompt Response","description":"Muppeting, when an AI seemingly randomly ignores part of your prompt.  For example, ask the ChatGPT API to output its response as a python dictionary, then put the call in the loop.  The responses where it goes oft prompt and offers commentary before giving you the dictionary (or messes up the dictionary) are Muppets.","link":"https://www.reddit.com/r/PromptDesign/comments/11p8alo/muppeting_new_term_for_off_prompt_response/","created":"2023-03-12","tags":["reddit","promptdesign","prompteng"],"meta":{"num_comments":2}}
{"title":"Prompt for preserving newline and hyphen characters in text to correct","description":"Hello!\n\nI am trying to come up with a prompt that will preserve newlines and hyphens at line ends. I have a OCR scanned page of a book, and I want to pass the prompt the lines from the page. With my current prompt it sometimes does this correctly, sometimes it merges all of the text together into one paragraph, and sometimes it moves words between lines.\n\nI'm wanting the corrected text to be returned with the text on their proper lines so that I can be able to compare the original line to the corrected line with an image of the line of text from the scanned book. I tried using \\\\n as a line separator but I had more success using a custom line separator (| and a number). This also allowed me to put that number into the logit\\_bias.\n\nIn the examples below, I parsed the output into a JSON array, but the actual output is separted by |501|, |502|, etc.\n\n&amp;#x200B;\n\n50-75% of the time it does work, as in the following example: [https://gist.github.com/ReallyNotARussianSpy/a0be73615ce200f2d62d1d711b98930d](https://gist.github.com/ReallyNotARussianSpy/a0be73615ce200f2d62d1d711b98930d)   \nExcept it did remove  from “Guide” when it should not have   \n   \nIt sometimes does not return the number of lines that I want: [https://gist.github.com/ReallyNotARussianSpy/0faa687ab6fdbaf1180c29323af3ba3a](https://gist.github.com/ReallyNotARussianSpy/0faa687ab6fdbaf1180c29323af3ba3a)   \n   \nIt sometimes moves words between lines. Example: [https://gist.github.com/ReallyNotARussianSpy/94617683d4ba658b71a131ccbabddb68](https://gist.github.com/ReallyNotARussianSpy/94617683d4ba658b71a131ccbabddb68)\n\n&amp;#x200B;\n\nI would appreciate any help. Thank you!","link":"https://www.reddit.com/r/PromptDesign/comments/11oapx0/prompt_for_preserving_newline_and_hyphen/","created":"2023-03-11","tags":["reddit","promptdesign","prompteng"],"meta":{"num_comments":0}}
