{"title":"Sunday Daily Thread: What's everyone working on this week?","description":"Tell /r/python what you're working on this week! You can be bragging, grousing, sharing your passion, or explaining your pain. Talk about your current project or your pet project; whatever you want to share.","link":"https://www.reddit.com/r/Python/comments/11ozevp/sunday_daily_thread_whats_everyone_working_on/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":6}}
{"title":"Monday Daily Thread: Project ideas!","description":"Comment any project ideas beginner or advanced in this thread for others to give a try! If you complete one make sure to reply to the comment with how you found it and attach some source code! If you're looking for project ideas, you might be interested in checking out Al Sweigart's, [\"The Big Book of Small Python Projects\"](https://inventwithpython.com/bigbookpython/) which provides a list of projects and the code to make them work.","link":"https://www.reddit.com/r/Python/comments/11pu7bv/monday_daily_thread_project_ideas/","created":"2023-03-13","tags":["python","reddit"],"meta":{"num_comments":2}}
{"title":"How do you research for bugs/issues solutions?","description":"Hi everyone, I was wondering what is the exact process do you use to find out solutions for your code issues. Do you jump straight to StackOverflow? Or do you start by doing something different?","link":"https://www.reddit.com/r/Python/comments/11q16io/how_do_you_research_for_bugsissues_solutions/","created":"2023-03-13","tags":["python","reddit"],"meta":{"num_comments":8}}
{"title":"Is something wrong with FastAPI?","description":"I want to build a REST api with Python, it is a long term project (new to python). I came across FastAPI and it looks pretty promising, but I wonder why there are 450 open PRs in the repo and the insights show that the project is heavily dependent on a single person. Should I feel comfortable using FastAPI or do you think this is kind of a red flag?","link":"https://www.reddit.com/r/Python/comments/11pfgjo/is_something_wrong_with_fastapi/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":88}}
{"title":"procedurally generated fantasy names","description":"Hello! This is one of my first projects in python. What this does is constructs a name from scratch. I found most \"name generators\" just pull from a list of predefined names and spit one or some out. Instead, this \"procedurally\" generates, if you will names based on syllables that it constructs and then joins together. I started this Friday night and it was my first time working with a GUI so I am pretty proud of what has come out so far. I have some ideas for additions but at its core as of right now it does exactly what I want it to do. It has options to export the names to a CSV file, or to copy to your clipboard as either text or an image to share elsewhere.\n\n[https://github.com/Lanecrest/RanGen-Fantasy-Names](https://github.com/Lanecrest/RanGen-Fantasy-Names)\n\nI am happy to hear what anyone has to think about the app itself or also any suggestions to the code, etc :)","link":"https://www.reddit.com/r/Python/comments/11pzdej/procedurally_generated_fantasy_names/","created":"2023-03-13","tags":["python","reddit"],"meta":{"num_comments":4}}
{"title":"FastKafka - free open source python lib for building Kafka-based services","description":"We were searching for something like FastAPI for Kafka-based service we were developing, but couldn’t find anything similar. So we shamelessly made one by reusing beloved paradigms from FastAPI and we shamelessly named it FastKafka. The point was to set the expectations right - you get pretty much what you would expect: function decorators for consumers and producers with type hints specifying Pydantic classes for JSON encoding/decoding, automatic message routing to Kafka brokers and documentation generation.\n\nPlease take a look and tell us how to make it better. Our goal is to make using it as easy as possible for some how has experience with FastAPI.\n\n[https://github.com/airtai/fastkafka](https://github.com/airtai/fastkafka)","link":"https://www.reddit.com/r/Python/comments/11paz9u/fastkafka_free_open_source_python_lib_for/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":17}}
{"title":"Create your Marketing Mix Model (MMM) in 5 Minutes for FREE and train it in Cloud","description":"Hello guys!\n\nIn **Cassandra** we have just built a complete **Marketing Mix Models Builder** that is currently **100% Free** and requires **NO** credit **card** to be used!\n\nThe only thing you’ll have to worry about it **getting** **your** **dataset** ready (automated Data Pipelines are still for Paid Users Only) and then **we’ll handle literally everything else**.\n\nClick on this link, check the **intro video** and then **start** right away: [Get Started for Free](https://cassandra.app/mmm-builder/)\n\nFor those who don’t know what MMMs are: it’s basically **your best shot** at **optimizing** your **ROI/CPO** after the Cookie Apocalypse.\n\nIn more seriousness here’s a playlist on our Youtube Channel where you can **learn** **more** (in a non-technical way) about it: [Learn everything about MMM](https://www.youtube.com/watch?v=D5424PlFE3Q&amp;list=PLdaWFt7A-Gf0gVU-9ctY_SqKkfYD8Bdob&amp;index=1&amp;ab_channel=Cassandra)\n\nWe’d love to **learn** all **about** **your** **experience** as well as **help you** in case you face any issue so if you want here’s the **Slack Channel** dedicated to both getting **support** and sharing **feedbacks**: [Join us in Slack](https://join.slack.com/t/cassandragruppo/shared_invite/zt-1r0obcxdv-VxLn7tqkX~P3NuNGXDPUqQ)\n\nP.S. It will not always be free, we are just beta-testing it so **hurry up** until it’s still available!","link":"https://www.reddit.com/r/Python/comments/11q3lro/create_your_marketing_mix_model_mmm_in_5_minutes/","created":"2023-03-13","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"Need Guidance on Python Script","description":"I'm a sales and online marketer by trait with 16 years experience working with 4 different agencies here in Austin, Texas. I'm not a programmer. But I have about a dozen projects under my belt and worked with a lot programmers in the past. And I see the value of these python tools and emerging technologies that make everything easier today it seems like. \n\nI wanted to know, what would be the best route to take because I have two types of solutions I want to create while trying to weigh in on expense and time.\n\nOne is a Google Maps email lead scrapper tool.(linkedin also) This is right down my alley as I already have a word of mouth social media referral app. \n\nAnd this other solution is social media listening tool that could track keywords/tags from posts on social networks. (sentiment analysis) This one brings way more value to the table and would be my first priority because it could easily sell as high ticket offer.\n\nI want to hire python expert or find partner with sweat equity. Due to this situation. I don't want to take on the wrong project. I'm trying to weight the difference between which one requires more advanced programmer or has the least possible technical  hurdles for a team of two? One marketer and one programmer.\n\nFYI:\n\nI'm planning to add this gmaps scrapper tool as 90 day freebie for attendees of my webinar class. The app Im promoting is a lead generation referral app called friendloops. And basically it's a high ticket sales webinar. Whoever doesn't bye the referral app on this webinar, are then placed into a sales funnel that sells gmaps scrapper on monthly subscription.\n\nThe reason I'm sharing this much detail is because I don't want people to think I'm just throwing things up in the air to see if they stick. I plan to plug in the gmaps scrapper(or listening tool) into a sales funnel along side a social omni present retargeting campaign. The very same campaigns I used to create for marketing agencies promoting their solution here in Austin, across the country. I'll be using my own money to fund the funnels.","link":"https://www.reddit.com/r/Python/comments/11pv6om/need_guidance_on_python_script/","created":"2023-03-13","tags":["python","reddit"],"meta":{"num_comments":9}}
{"title":"Best practices for caching data between runs (non-local library)?","description":"I've got some local code that caches the results of slow functions in a `.cache` folder in my project root directory. I would like to publish this code on PyPI, and I'm looking for some best practices for dealing with this `.cache` directory.\n\nI can put it in the user's temp directory and make provisions for race conditions, bad data, etc.\n\nBut I'm wondering if this is a \"best practice.\" Is there a better way to handle this?\n\nOf course, I'm potentially *over*writing caches, so there are some decisions to be made there.\n\nFWIW:\n\n* cache size is small.\n* speed is a low priority.","link":"https://www.reddit.com/r/Python/comments/11po5eq/best_practices_for_caching_data_between_runs/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":10}}
{"title":"Parser combinator in Python","description":"https://github.com/frndmg/pyrsec\n\nI know we have many already, I was just in the look for some type safe, modern looking, with operator support implementation and ended up with my own 😅.\n\nHope you like it.","link":"https://www.reddit.com/r/Python/comments/11pfh05/parser_combinator_in_python/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":1}}
{"title":"New book available: Python GUI - Develop Cross Platform Desktop Applications using Python, Qt and PySide6","description":"I have just released a new book about Python and **PySide6** based on my book about PyQt5.  \nMany thanks to this community for giving me some requests to be implemented in this book.  \nI have added user controls including transitions.  \n\\- I am showing a sample of a line of business app including database access using tinydb, which is also written in Python.  \n\\- I have added a multi-treading example, where HTML will be created in the background on given markdown.  \n\\- I have also added a filterable dropdown listbox.  \nOne user control dynamically creates icons in different colors based on SVG on the fly.   \nAnd many more...  \nI will send some free copies out to those people how inspired me to add additional content and the rest of you can get the book on Amazon in [English](https://kdp.amazon.com/amazon-dp-action/us/dualbookshelf.marketplacelink/B0BY3PKBSM) and [German](https://kdp.amazon.com/amazon-dp-action/de/dualbookshelf.marketplacelink/B0BXYPZ6VY).\n\nIf you have ideas or requests what else to show in this book, then please let me know.\n\nhttps://preview.redd.it/5wq1tpxq84na1.png?width=1600&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=225dff3d591a855fe14a7cb4a0a53311607609ba","link":"https://www.reddit.com/r/Python/comments/11ola58/new_book_available_python_gui_develop_cross/","created":"2023-03-11","tags":["python","reddit"],"meta":{"num_comments":58}}
{"title":"Using ChatGPT API in Python (feat. DALL-E, Karlo)","description":"**Using ChatGPT API in Python (feat. DALL-E, Karlo)**\n\n[https://wooiljeong.github.io/python/chatgpt-api/](https://wooiljeong.github.io/python/chatgpt-api/)\n\nHello, I've written a post on how to use the ChatGPT API (ChatCompletions) in Python, which was recently released.\n\nIn addition, I've also included a method for asking ChatGPT to imagine something and having image generating AIs like Karlo and DALL-E draw pictures based on the results. For example, I automated the process of requesting an imagined image of what buildings might look like if humans settled on Mars from ChatGPT and then having a picture drawn based on the results.\n\nI've attached pictures drawn by Karlo API from Kakao and DALL-E from OpenAI. The impressive thing is that the results of the different AIs' interpretations based on ChatGPT's imaginative input are unique and meaningful. As the shared link is written in Korean, I recommend using a Chrome extension to translate the content into English for those who are interested.\n\n[ The image of a human settlement on Mars drawn by DALL-E. ](https://preview.redd.it/58p82nmva9na1.jpg?width=1024&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=2ca4f49b746141321ce367712456c935af3f1fda)\n\n[ The image of a human settlement on Mars drawn by Karlo ](https://preview.redd.it/ohjqtolwa9na1.jpg?width=1024&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=9e30b01af6124a72927da7fe3317bae26dd7290f)","link":"https://www.reddit.com/r/Python/comments/11p7yrq/using_chatgpt_api_in_python_feat_dalle_karlo/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"Best places/ways to learn APIs for career progression?","description":"Looking for YT videos, chat chains, something to help me understand APIs and how to build them to use them effectively.","link":"https://www.reddit.com/r/Python/comments/11p4fd0/best_placesways_to_learn_apis_for_career/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":9}}
{"title":"Godot Fast Android Export","description":"Have you ever used Godot to write Android apps?  \nGodot is crazy fast in deploying that app to your mobile.  Seems that the APK file is already ready and all the GDScripts and Scenes where just extended to the end of that APK as resources. Even Android Studio is much slower.  \n\n\nWhat way can we go using Python on Android?  \nWhen I used PyQt5 the freezing, compiling and deploying process where soo slow.  \nWould\\`nt it be nice to have the Python engine and modules ready compiled and just also add our Python code as resource?  \n\n\nHow can we do that?  \nIs there a solution a la pyqtdeploy from riverbank for PySide6 at all, which we might tweak?","link":"https://www.reddit.com/r/Python/comments/11pe06l/godot_fast_android_export/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":9}}
{"title":"Can we expand on the usage of the walrus operator?","description":"I found a way to run asynchronous tasks using `asyncio.gather` and immediately assign the first result to a variable. This is nice, because it uses fewer lines of code. The idea is that here one task returns the result directly, whilst the other stores the result in a class attributes. This is what the syntax looks like:\n\n    response = (_ :=  await asyncio.gather(\n        send_get_request(*args),\n        some_class.load_some_data()\n    ))[0]\n\nIt works because the walrus assignment is execute first, and the result of `gather` is stored in the temporary variable `_`. Now I can get the desired response using the desired index. I know in this example there might be a better way to perform this task, like so:\n\n    response, _ = await asyncio.gather(\n        send_get_request(*args),\n        some_class.load_some_data()\n    )\n\nCan someone think of a scenario where the  `(_ := &lt;some_task&gt; )` is useful? And whether we can consider this pythonic (likely not). I know some already find the walrus operator dubious, and this syntax makes it even more dubious, but I find it an interesting topic and would like to hear some thoughts.","link":"https://www.reddit.com/r/Python/comments/11phtui/can_we_expand_on_the_usage_of_the_walrus_operator/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":7}}
{"title":"StructIO: Library for unpacking and packing binary files","description":"These are generic functions combined with a file-like stream for unpacking and packing binary files. I learned how to make them while trying to figure out how to read the game files of The Sims 2.\n\n[https://github.com/lingeringwillx/StructIO](https://github.com/lingeringwillx/StructIO)\n\nThoughts and opinions?\n\nOther similar tools that perform the same task. This seems to be a bit of a niche issue and so the tools for working with it are hard to find:\n\n[bitstring](https://github.com/scott-griffiths/bitstring)\n\n[Kaitai Struct](https://kaitai.io)\n\n[numpy.frombuffer](https://numpy.org/doc/stable/reference/generated/numpy.frombuffer.html) and [numpy.fromfile](https://numpy.org/doc/stable/reference/generated/numpy.fromfile.html)\n\n[Construct](https://construct.readthedocs.io/en/latest/)\n\n[rawutil](https://github.com/Tyulis/rawutil)\n\nThe last time I posted something here years ago my work was trashed, so I'm worried about posting here again :p","link":"https://www.reddit.com/r/Python/comments/11per16/structio_library_for_unpacking_and_packing_binary/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":3}}
{"title":"Easy Python scripts to impress the business","description":"Hi Python Devs, which quick and easy scripts have you written that impressed the business and got you some kudos without requiring any real effort on your part?","link":"https://www.reddit.com/r/Python/comments/11olib6/easy_python_scripts_to_impress_the_business/","created":"2023-03-11","tags":["python","reddit"],"meta":{"num_comments":96}}
{"title":"Matplotlib showing close but incorrect plot?","description":"&amp;#x200B;\n\nhttps://preview.redd.it/ijy6wrntp7na1.png?width=1153&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=e7ca32ae47d023d2916c35827d11eb6a360a411b","link":"https://www.reddit.com/r/Python/comments/11p1ncc/matplotlib_showing_close_but_incorrect_plot/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":25}}
{"title":"Trying to solve The Collatz Conjecture with python","description":"Trying to solve The Collatz Conjecture with python\n\n&amp;#x200B;\n\nhttps://preview.redd.it/rteikgkc4bna1.jpg?width=3104&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=6d06d5324d2735ebd935f8f55430e85f0dfbf324","link":"https://www.reddit.com/r/Python/comments/11pe3qf/trying_to_solve_the_collatz_conjecture_with_python/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":17}}
{"title":"Python and KIVY for reading info from micro-controller","description":" I created app for reading info from port Arduino. I used Kivy and added one a button, a title and a spinner. User can chose port and read info.\n\nHere my code.\n\n[https://github.com/Pra1seTheSun322/Read-information-from-Arduino-UNO](https://github.com/Pra1seTheSun322/Read-information-from-Arduino-UNO)","link":"https://www.reddit.com/r/Python/comments/11phabb/python_and_kivy_for_reading_info_from/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":0}}
{"title":"Netmeasure - measure Internet connection quality","description":"Netmeasure is a Python library for measuring Internet connection quality in a structured and consistent way.\n\nIt incorporates a variety of measurements that you can run from the command line or incorporate into your own applications.\n\nNetmeasure is a fork of an orphaned commercial open source measurement library that I created with some colleagues a few years ago. Now that it's been re-animated I hope that it can be of some value  to the community.\n\n[https://github.com/amorphitec/netmeasure](https://github.com/amorphitec/netmeasure)  \n[https://pypi.org/project/netmeasure/](https://pypi.org/project/netmeasure/)\n\nhttps://preview.redd.it/8zts10qefana1.png?width=1138&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=5b4e4e6d3b2d5baed82d5cb70c50b3ef866957d6","link":"https://www.reddit.com/r/Python/comments/11pbn4k/netmeasure_measure_internet_connection_quality/","created":"2023-03-12","tags":["python","reddit"],"meta":{"num_comments":2}}
